{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 10,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "So I'm graduating with a CS degree later this year and have been fortunate enough to land 2 full time offers at companies that I've previously interned at. Both companies have very similar (yet contrasting) offers and I've been losing my mind over what to pick. Both of these are small startups so I won't be able to reveal their names.\n\n&amp;#x200B;\n\nCompany A:\n\n$4BN+ valuation, Series D e-commerce company (300 people within the company)\n\nOffer: 140k base + 200k stocks over 4 years (120 day exercise window) + 25k signing bonus + \\~15k benefits/yr\n\nI'd be in the data/infra team (which is the work i love) and I absolutely enjoyed working here. I was able to make a lot of impact and was well recognized within my team. Many of my team members have been reaching out since my internship ended with the hopes of getting me to accept the offer.Although i was working remotely, the company is opening an office in my hometown soon. I would love working in person.\n\n&amp;#x200B;\n\nHowever, I do have some concerns with my employability in the future if I were to join this company since it's not well-known and might make me tied to the e-commerce space.\n\n&amp;#x200B;\n\nCompany B:\n\n$1.5BN+ valuation, Series B SaaS company (250 people within the company)\n\nOffer: 130k base + 300k stocks over 4 years **(7 year exercise window),** \\+ \\~7k benefits/yr\n\n&amp;#x200B;\n\nThis company has a lot of senior engineers and I'd be one of their first junior hires. However, it was difficult to work remotely from home everyday and I found myself losing my personality since most people were not open to casual/semi-casual conversations (sometimes even work-related convos for that matter). My work here was pretty impactful. However, there was a clear feeling that I was an intern and I didn't feel very welcomed due to my lack of experience (which I understand is normal given that I have not yet graduated).\n\nHowever, this company has several top-tier tech companies as customers (some from FAANG, HFTs and well-known companies in the tech space). I feel that my employability would skyrocket if I worked here for a few years. Moreover, given the number of senior members within the company, I would be able to learn a lot. Also, the long exercise window is a nice cushion to have.The role is for a backend/full-stack team, which I don't mind. I find some enjoyment in the work but it is not my first preference.\n\n&amp;#x200B;\n\nSo what do you guys think is the better option?",
                    "author_fullname": "t2_6gt6wzik",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Offer Decision Fatigue",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_15tsral",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.47,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 0,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 0,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1692291100.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1692290631.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m graduating with a CS degree later this year and have been fortunate enough to land 2 full time offers at companies that I&amp;#39;ve previously interned at. Both companies have very similar (yet contrasting) offers and I&amp;#39;ve been losing my mind over what to pick. Both of these are small startups so I won&amp;#39;t be able to reveal their names.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Company A:&lt;/p&gt;\n\n&lt;p&gt;$4BN+ valuation, Series D e-commerce company (300 people within the company)&lt;/p&gt;\n\n&lt;p&gt;Offer: 140k base + 200k stocks over 4 years (120 day exercise window) + 25k signing bonus + ~15k benefits/yr&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d be in the data/infra team (which is the work i love) and I absolutely enjoyed working here. I was able to make a lot of impact and was well recognized within my team. Many of my team members have been reaching out since my internship ended with the hopes of getting me to accept the offer.Although i was working remotely, the company is opening an office in my hometown soon. I would love working in person.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;However, I do have some concerns with my employability in the future if I were to join this company since it&amp;#39;s not well-known and might make me tied to the e-commerce space.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Company B:&lt;/p&gt;\n\n&lt;p&gt;$1.5BN+ valuation, Series B SaaS company (250 people within the company)&lt;/p&gt;\n\n&lt;p&gt;Offer: 130k base + 300k stocks over 4 years &lt;strong&gt;(7 year exercise window),&lt;/strong&gt; + ~7k benefits/yr&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;This company has a lot of senior engineers and I&amp;#39;d be one of their first junior hires. However, it was difficult to work remotely from home everyday and I found myself losing my personality since most people were not open to casual/semi-casual conversations (sometimes even work-related convos for that matter). My work here was pretty impactful. However, there was a clear feeling that I was an intern and I didn&amp;#39;t feel very welcomed due to my lack of experience (which I understand is normal given that I have not yet graduated).&lt;/p&gt;\n\n&lt;p&gt;However, this company has several top-tier tech companies as customers (some from FAANG, HFTs and well-known companies in the tech space). I feel that my employability would skyrocket if I worked here for a few years. Moreover, given the number of senior members within the company, I would be able to learn a lot. Also, the long exercise window is a nice cushion to have.The role is for a backend/full-stack team, which I don&amp;#39;t mind. I find some enjoyment in the work but it is not my first preference.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So what do you guys think is the better option?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "15tsral",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "ParticularRanger1",
                    "discussion_type": null,
                    "num_comments": 14,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/15tsral/offer_decision_fatigue/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/15tsral/offer_decision_fatigue/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1692290631.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "I've been a hiring manager for a US-based university recruiting at my unicorn of a few hundred people. As a follow up to [my previous post](https://www.reddit.com/r/cscareerquestions/comments/inrex1/ive_reviewed_thousands_of_applications_for/), I thought I’d share a bit about how I go about reviewing applications. Also, if you aren’t aware of the [Resume FAQ](https://www.reddit.com/r/cscareerquestions/wiki/faq_resumes), this is a really amazing resource and I would check that out first. My post here represents one specific viewpoint whereas that advice is more broad and generic.\n\n*Edit:* **One thing to note is my experience is only in the context of a Unicorn (which is competitive with FAANG). In our case we have tens of thousands of applications but we only have the capacity to interview a couple hundred.**\n\nHere’s a bit of the behind the scenes for how I review applications:\n\n* Frankly, application review is not my full time job, so usually I end up doing this after work hours. Typically I might spend 30-60 minutes reviewing applications before decision fatigue sets in.\n* Most applications would be pretty clear after about 5 seconds of reviewing. Probably 5% would be an obvious yes and 75% would be an obvious no.\n* The other 20% of the cases take up 90% of the time. If your applications is in that 20%, then I’ll take some more time to look through all the details. If you provide links like personal websites or Github, I'll probably click into that.\n\nWhen reviewing a resume, here is the rough order of things I’ll look for:\n\n* *Industry Experience.* Having an internship at Facebook, Google, or another highly prestigious company on your resume probably makes you a yes most of the time. Otherwise I'd look into the details of what you did in your various roles. If you had an internship where you just pushed code around, that doesn't show much. But if you had an internship where you built and ~~shipped something that was used by a million users, or halved the latency of all requests~~ solved a really challenging but really impactful problem, then that's probably an automatic yes. Because of this, I’ve often preferred candidates who interned at startups and were forced to play an impactful role in the company over candidates who joined a less tech focused F500 company.\n* *University.* I’ll be the first to admit that I’m ashamed at how high this is. There are a number of reasons that which university should not be this high: (1) it is highly correlated to how well off your family is, (2) it only reflects on what you accomplished in high school and ignores what you accomplished in college. Unfortunately, university rankings are still the most reliable standardization out there. There is still a correlation between where your university and your success in interviews and your success in industry. If you go to a top 5 CS school, you’re a bit more likely to be a yes than a no if everything else on your resume looks solid. Granted, if you're at MIT but you haven't shown much else in any of the other categories, then you’re still going to find yourself to be a no in most cases.\n* *Teaching Experience.* I've found that being a TA is one of the signals that helps separate soft skills the most. I appreciate candidates who have deep knowledge of a topic, can empathize with where someone else might be coming from in their understanding, and bridge that gap. If you haven’t done so already, **I highly recommend talking with your professor about becoming a TA.**\n* *Projects.* There's a ton of nuance in projects listed, so I’ll go into more detail.\n   * School project in your introductory CS sequence - this doesn't show me anything that would separate you from everyone else.\n   * Hackathon(or similar) project - This shows me you probably have a genuine interest in learning new technology and building software. Also in this category are clones of apps.\n   * Research project / Project teams - This shows me that you take initiative to dive deep into academic areas that interest you. It’s even better if the research project requires you to work with a team.\n   * Open Source Project - There's a ton of nuance here, but if you're making contributions to a critical library or if you decided to build something from scratch and it has some traction, that looks awesome.\n   * Productionized application solving a real world problem that has real users - I would love to get you an interview ASAP. You don’t need revenue, funding, or even a startup, but there is no shortage of real world problems where software can help. If you can honestly say you’ve dedicated a significant chunk of time to this, feel free to put it on your work experience too. The best part of this is that unlike internships of university, this is 100% in your control. I cannot stress this enough - **show me that you can solve a real world problem with software and have real people use what you built.**\n* *Coursework.* Computer science is still the gold standard in software engineering, but you can still succeed without a CS degree as long as you show that you’re not shying away from project heavy classes and still understand basic CS theory. I generally like candidates who are taking more advanced courses (like grad level classes) and/or more programming heavy courses (like compilers or operating systems).\n* *Extracurriculars.* Candidates that take initiative and can handle large amounts of responsibility are great. In addition to displaying leadership, extracurriculars also show me how you are striving for excellence in the things that you enjoy doing. Show me your passion for sports, dance, theatre, or whatever and the things that you've done to push yourself in those areas.\n* *Degree.* BS vs BA doesn’t make a difference. Having a Masters is a slight bump, but if you can get your Bachelors + Masters degrees in 4 or 4.5 years, then that’s pretty impressive.\n* *GPA.* Honestly, GPA doesn’t really matter too much. If you leave it off your resume, I’ll probably just assume it’s lower than a 3.0, but that also probably wouldn’t be a dealbreaker. If it’s really good, that would be a slight bump. However, I’ve seen people with a 4.0 that fail in industry roles where soft skills and the ability to handle ambiguity are important.\n* *Skills.* I wouldn’t care too much if you included this. When hiring new grads we don’t hire for the programming languages they know or don’t know. However, if you have experience with iOS and you’re applying to a company with a big mobile presence, maybe you should put it on your resume.\n* *Cover Letter.* I almost never look at the cover letter.\n* *Work Authorization.* We don’t have a team capable of handling immigration for more than a handful of people, usually reserved for leadership and extremely senior positions. If you are a US citizen or permanent resident, it would be beneficial to add it.\n\nGeneral advice:\n\n* Less can be more. I’m browsing through applications quickly, so be sure that any key words or accomplishments don’t get missed because your resume is too cluttered. Imagine that my eyes are jumping around the page, looking for key phrases. If you’re describing your previous internship, instead of describing what you did week by week, find 1 bullet point that encapsulates the work you did the entire summer. Then add 2-3 additional ones describing the most impactful or most challenging parts that made up that project. And please make sure your resume fits on one page - I sometimes don’t even think to scroll down when reviewing a resume.\n* When going into the details of your work, avoid jargon that the average technical recruiter wouldn’t know. There is a fine art in communicating accomplishments without going into too much detail, but it helps to imagine yourself explaining it out loud to a friend.\n* Show me the impact of your work. In general, software engineers are responsible for solving real world problems with code. I know that it can be tempting to talk about the technical details of what you did, but be sure to show the impact that it had.\n\nKeep in mind that this post just reflects my thoughts and there are plenty of other companies and other people that review applications that are looking for different things. Please don't overfit your application to one single narrow viewpoint. If you’re in a role that also reviews applications, I’d love to hear your thoughts as well. Let me know your thoughts and if there's any other topic you'd like to learn more about.",
                    "author_fullname": "t2_9q7u9",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I've reviewed thousands of applications for university recruiting at a startup. Here’s a bit of what I look for when reviewing an application. (Part 2)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_irjodn",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.94,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1208,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": "1da52ac2-788a-11e2-9b40-12313d183eb5",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1208,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1599957032.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Engineering Manager"
                        }
                    ],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1599941059.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "richtext",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been a hiring manager for a US-based university recruiting at my unicorn of a few hundred people. As a follow up to &lt;a href=\"https://www.reddit.com/r/cscareerquestions/comments/inrex1/ive_reviewed_thousands_of_applications_for/\"&gt;my previous post&lt;/a&gt;, I thought I’d share a bit about how I go about reviewing applications. Also, if you aren’t aware of the &lt;a href=\"https://www.reddit.com/r/cscareerquestions/wiki/faq_resumes\"&gt;Resume FAQ&lt;/a&gt;, this is a really amazing resource and I would check that out first. My post here represents one specific viewpoint whereas that advice is more broad and generic.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit:&lt;/em&gt; &lt;strong&gt;One thing to note is my experience is only in the context of a Unicorn (which is competitive with FAANG). In our case we have tens of thousands of applications but we only have the capacity to interview a couple hundred.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here’s a bit of the behind the scenes for how I review applications:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Frankly, application review is not my full time job, so usually I end up doing this after work hours. Typically I might spend 30-60 minutes reviewing applications before decision fatigue sets in.&lt;/li&gt;\n&lt;li&gt;Most applications would be pretty clear after about 5 seconds of reviewing. Probably 5% would be an obvious yes and 75% would be an obvious no.&lt;/li&gt;\n&lt;li&gt;The other 20% of the cases take up 90% of the time. If your applications is in that 20%, then I’ll take some more time to look through all the details. If you provide links like personal websites or Github, I&amp;#39;ll probably click into that.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;When reviewing a resume, here is the rough order of things I’ll look for:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Industry Experience.&lt;/em&gt; Having an internship at Facebook, Google, or another highly prestigious company on your resume probably makes you a yes most of the time. Otherwise I&amp;#39;d look into the details of what you did in your various roles. If you had an internship where you just pushed code around, that doesn&amp;#39;t show much. But if you had an internship where you built and &lt;del&gt;shipped something that was used by a million users, or halved the latency of all requests&lt;/del&gt; solved a really challenging but really impactful problem, then that&amp;#39;s probably an automatic yes. Because of this, I’ve often preferred candidates who interned at startups and were forced to play an impactful role in the company over candidates who joined a less tech focused F500 company.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;University.&lt;/em&gt; I’ll be the first to admit that I’m ashamed at how high this is. There are a number of reasons that which university should not be this high: (1) it is highly correlated to how well off your family is, (2) it only reflects on what you accomplished in high school and ignores what you accomplished in college. Unfortunately, university rankings are still the most reliable standardization out there. There is still a correlation between where your university and your success in interviews and your success in industry. If you go to a top 5 CS school, you’re a bit more likely to be a yes than a no if everything else on your resume looks solid. Granted, if you&amp;#39;re at MIT but you haven&amp;#39;t shown much else in any of the other categories, then you’re still going to find yourself to be a no in most cases.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Teaching Experience.&lt;/em&gt; I&amp;#39;ve found that being a TA is one of the signals that helps separate soft skills the most. I appreciate candidates who have deep knowledge of a topic, can empathize with where someone else might be coming from in their understanding, and bridge that gap. If you haven’t done so already, &lt;strong&gt;I highly recommend talking with your professor about becoming a TA.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Projects.&lt;/em&gt; There&amp;#39;s a ton of nuance in projects listed, so I’ll go into more detail.\n\n&lt;ul&gt;\n&lt;li&gt;School project in your introductory CS sequence - this doesn&amp;#39;t show me anything that would separate you from everyone else.&lt;/li&gt;\n&lt;li&gt;Hackathon(or similar) project - This shows me you probably have a genuine interest in learning new technology and building software. Also in this category are clones of apps.&lt;/li&gt;\n&lt;li&gt;Research project / Project teams - This shows me that you take initiative to dive deep into academic areas that interest you. It’s even better if the research project requires you to work with a team.&lt;/li&gt;\n&lt;li&gt;Open Source Project - There&amp;#39;s a ton of nuance here, but if you&amp;#39;re making contributions to a critical library or if you decided to build something from scratch and it has some traction, that looks awesome.&lt;/li&gt;\n&lt;li&gt;Productionized application solving a real world problem that has real users - I would love to get you an interview ASAP. You don’t need revenue, funding, or even a startup, but there is no shortage of real world problems where software can help. If you can honestly say you’ve dedicated a significant chunk of time to this, feel free to put it on your work experience too. The best part of this is that unlike internships of university, this is 100% in your control. I cannot stress this enough - &lt;strong&gt;show me that you can solve a real world problem with software and have real people use what you built.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Coursework.&lt;/em&gt; Computer science is still the gold standard in software engineering, but you can still succeed without a CS degree as long as you show that you’re not shying away from project heavy classes and still understand basic CS theory. I generally like candidates who are taking more advanced courses (like grad level classes) and/or more programming heavy courses (like compilers or operating systems).&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Extracurriculars.&lt;/em&gt; Candidates that take initiative and can handle large amounts of responsibility are great. In addition to displaying leadership, extracurriculars also show me how you are striving for excellence in the things that you enjoy doing. Show me your passion for sports, dance, theatre, or whatever and the things that you&amp;#39;ve done to push yourself in those areas.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Degree.&lt;/em&gt; BS vs BA doesn’t make a difference. Having a Masters is a slight bump, but if you can get your Bachelors + Masters degrees in 4 or 4.5 years, then that’s pretty impressive.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;GPA.&lt;/em&gt; Honestly, GPA doesn’t really matter too much. If you leave it off your resume, I’ll probably just assume it’s lower than a 3.0, but that also probably wouldn’t be a dealbreaker. If it’s really good, that would be a slight bump. However, I’ve seen people with a 4.0 that fail in industry roles where soft skills and the ability to handle ambiguity are important.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Skills.&lt;/em&gt; I wouldn’t care too much if you included this. When hiring new grads we don’t hire for the programming languages they know or don’t know. However, if you have experience with iOS and you’re applying to a company with a big mobile presence, maybe you should put it on your resume.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Cover Letter.&lt;/em&gt; I almost never look at the cover letter.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Work Authorization.&lt;/em&gt; We don’t have a team capable of handling immigration for more than a handful of people, usually reserved for leadership and extremely senior positions. If you are a US citizen or permanent resident, it would be beneficial to add it.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;General advice:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Less can be more. I’m browsing through applications quickly, so be sure that any key words or accomplishments don’t get missed because your resume is too cluttered. Imagine that my eyes are jumping around the page, looking for key phrases. If you’re describing your previous internship, instead of describing what you did week by week, find 1 bullet point that encapsulates the work you did the entire summer. Then add 2-3 additional ones describing the most impactful or most challenging parts that made up that project. And please make sure your resume fits on one page - I sometimes don’t even think to scroll down when reviewing a resume.&lt;/li&gt;\n&lt;li&gt;When going into the details of your work, avoid jargon that the average technical recruiter wouldn’t know. There is a fine art in communicating accomplishments without going into too much detail, but it helps to imagine yourself explaining it out loud to a friend.&lt;/li&gt;\n&lt;li&gt;Show me the impact of your work. In general, software engineers are responsible for solving real world problems with code. I know that it can be tempting to talk about the technical details of what you did, but be sure to show the impact that it had.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Keep in mind that this post just reflects my thoughts and there are plenty of other companies and other people that review applications that are looking for different things. Please don&amp;#39;t overfit your application to one single narrow viewpoint. If you’re in a role that also reviews applications, I’d love to hear your thoughts as well. Let me know your thoughts and if there&amp;#39;s any other topic you&amp;#39;d like to learn more about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Engineering Manager",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "irjodn",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "NullPointer1",
                    "discussion_type": null,
                    "num_comments": 294,
                    "send_replies": false,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/cscareerquestions/comments/irjodn/ive_reviewed_thousands_of_applications_for/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/irjodn/ive_reviewed_thousands_of_applications_for/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1599941059.0,
                    "num_crossposts": 1,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "Hello everyone,\n\nA recent graduate and i’m currently in a startup where i get to make my own decisions and processes on how i should build a part of the system.\n\nI realised i tend to get overwhelmed when trying to decide how to build something. Say a simple example, where i need to locate a string for example. I would start with googling on how to do it and coming across 60+ ways to do that exact same thing and then get super indecisive about the way to do it and end up spending the whole day just messing around with it.\n\nDoes anyone else feel the same way? These problems are small for now but i would love to be able to come up with a way where i could find the most optimal method to decide what tools to use or method to use etc..  \n\nI feel like the reason i have issues is due to lack of experience and a lack of mentorship (bcos startup ) but i plan to do my own reading and research to fill in that gap",
                    "author_fullname": "t2_1lcmbnjy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Decision fatigue",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_lxytaf",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1614901644.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;A recent graduate and i’m currently in a startup where i get to make my own decisions and processes on how i should build a part of the system.&lt;/p&gt;\n\n&lt;p&gt;I realised i tend to get overwhelmed when trying to decide how to build something. Say a simple example, where i need to locate a string for example. I would start with googling on how to do it and coming across 60+ ways to do that exact same thing and then get super indecisive about the way to do it and end up spending the whole day just messing around with it.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else feel the same way? These problems are small for now but i would love to be able to come up with a way where i could find the most optimal method to decide what tools to use or method to use etc..  &lt;/p&gt;\n\n&lt;p&gt;I feel like the reason i have issues is due to lack of experience and a lack of mentorship (bcos startup ) but i plan to do my own reading and research to fill in that gap&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "lxytaf",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "jffryteo",
                    "discussion_type": null,
                    "num_comments": 4,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/lxytaf/decision_fatigue/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/lxytaf/decision_fatigue/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1614901644.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "**My background:** \n\nWhen I started there was hardly any \"learn to code\" movement. I was a non-STEM grad that would probably be bootcamp material but didn't take one. I just took a college course on HTML and CSS and self-taught the rest needed to know for my first few jobs.\n\nThese jobs were contract but with full-time responsibilities. They had the appearance of being secure and legit without providing the perks like benefits and bonuses.\n\nTemp and contract jobs = no promotions = no visible signs of growth\n\nAccordingly, I didn't take my career too seriously. I learned about the term \"quiet quitting\" just this year but I've been practicing it as long as I can remember. Just doing the bare minimum, \"acting your wage\" whatever you want to call it. Since I got paid little I also cared little. I also did not compare myself to other developers (because comparison is the thief of joy). But this combined with my quiet quitter attitude, kept my TC low and my skillset stuck in the early 2010s.\n\n**Taking a break:** \n\nAnyway, I slink back for the past 5 years. Becoming disinterested in contract jobs and unable to find legitimate full-time work, I took a sabbatical and became a family caretaker. This helped cut down on personal expenses. Still did some programming on the side once in a while but just for fun, not for job-seeking purposes.\n\n**The return and reality check:** \n\nAbout one year ago I decided to look for work again. I knew I needed to strengthen my skills. Just learn some React and Node, and practice the Leetcodes (mostly Easy ones for now), and I should be good. Or so I thought. Nope lol after a year I'm still without a job. I wasted time with the wrong approach. There is a whole world more of tech that I missed out on.\n\nI also REALLY underestimated how fast programming jobs have spread. Liberal arts students taking bootcamps, a lot of people telling others the future is in learning to code, etc etc. I also underestimated how much the pandemic increased the competition.\n\nSo now, re-entering in a much more crowded job market, feeling overwhelmed and decision fatigue.\n\nThis is the resume I'm using: https://imgur.com/a/lLnJD6F\n\n**My questions:**\n\nHow do I prioritize and parcel out self-improvement time? Any reading material that would help with that?\n\nShould I add lots of projects on my resume? I feel like I need to compensate for doing my past jobs half-assed.\n\nDo I need to practice data structures and algorithms _every day_? What about general app programming, for portfolio projects... Should that be daily too?\n\nWill learning a new language make my resume more \"popular\"? I know JavaScript, C# and PHP\n\nShould provide code samples to employers even if they don't ask? What about just asking other programmers to review my code on Github?\n\n**Miscellaneous:**\n\nThings that _may_ hurt my chances at a job but are hard to prove. I have a lazy eye. It doesn't interfere with my work but it does make eye contact awkward when I talk to people. I also have a more \"exotic\" last name that is not easy to pronounce for many.",
                    "author_fullname": "t2_qwaiv",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Interested in rejoining the industry 5 years later as a full-time worker and oh man, I was not prepared",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Experienced"
                        }
                    ],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_yf9gs1",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.69,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 6,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Experienced",
                    "can_mod_post": false,
                    "score": 6,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1666925507.0,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1666919637.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;My background:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;When I started there was hardly any &amp;quot;learn to code&amp;quot; movement. I was a non-STEM grad that would probably be bootcamp material but didn&amp;#39;t take one. I just took a college course on HTML and CSS and self-taught the rest needed to know for my first few jobs.&lt;/p&gt;\n\n&lt;p&gt;These jobs were contract but with full-time responsibilities. They had the appearance of being secure and legit without providing the perks like benefits and bonuses.&lt;/p&gt;\n\n&lt;p&gt;Temp and contract jobs = no promotions = no visible signs of growth&lt;/p&gt;\n\n&lt;p&gt;Accordingly, I didn&amp;#39;t take my career too seriously. I learned about the term &amp;quot;quiet quitting&amp;quot; just this year but I&amp;#39;ve been practicing it as long as I can remember. Just doing the bare minimum, &amp;quot;acting your wage&amp;quot; whatever you want to call it. Since I got paid little I also cared little. I also did not compare myself to other developers (because comparison is the thief of joy). But this combined with my quiet quitter attitude, kept my TC low and my skillset stuck in the early 2010s.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Taking a break:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Anyway, I slink back for the past 5 years. Becoming disinterested in contract jobs and unable to find legitimate full-time work, I took a sabbatical and became a family caretaker. This helped cut down on personal expenses. Still did some programming on the side once in a while but just for fun, not for job-seeking purposes.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The return and reality check:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;About one year ago I decided to look for work again. I knew I needed to strengthen my skills. Just learn some React and Node, and practice the Leetcodes (mostly Easy ones for now), and I should be good. Or so I thought. Nope lol after a year I&amp;#39;m still without a job. I wasted time with the wrong approach. There is a whole world more of tech that I missed out on.&lt;/p&gt;\n\n&lt;p&gt;I also REALLY underestimated how fast programming jobs have spread. Liberal arts students taking bootcamps, a lot of people telling others the future is in learning to code, etc etc. I also underestimated how much the pandemic increased the competition.&lt;/p&gt;\n\n&lt;p&gt;So now, re-entering in a much more crowded job market, feeling overwhelmed and decision fatigue.&lt;/p&gt;\n\n&lt;p&gt;This is the resume I&amp;#39;m using: &lt;a href=\"https://imgur.com/a/lLnJD6F\"&gt;https://imgur.com/a/lLnJD6F&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My questions:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;How do I prioritize and parcel out self-improvement time? Any reading material that would help with that?&lt;/p&gt;\n\n&lt;p&gt;Should I add lots of projects on my resume? I feel like I need to compensate for doing my past jobs half-assed.&lt;/p&gt;\n\n&lt;p&gt;Do I need to practice data structures and algorithms &lt;em&gt;every day&lt;/em&gt;? What about general app programming, for portfolio projects... Should that be daily too?&lt;/p&gt;\n\n&lt;p&gt;Will learning a new language make my resume more &amp;quot;popular&amp;quot;? I know JavaScript, C# and PHP&lt;/p&gt;\n\n&lt;p&gt;Should provide code samples to employers even if they don&amp;#39;t ask? What about just asking other programmers to review my code on Github?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Miscellaneous:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Things that &lt;em&gt;may&lt;/em&gt; hurt my chances at a job but are hard to prove. I have a lazy eye. It doesn&amp;#39;t interfere with my work but it does make eye contact awkward when I talk to people. I also have a more &amp;quot;exotic&amp;quot; last name that is not easy to pronounce for many.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "yf9gs1",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "csequivalent",
                    "discussion_type": null,
                    "num_comments": 14,
                    "send_replies": false,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/cscareerquestions/comments/yf9gs1/interested_in_rejoining_the_industry_5_years/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/yf9gs1/interested_in_rejoining_the_industry_5_years/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1666919637.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "**About Me:** I have about 4 YoE working at a startup (+1 YoE as intern). My work mostly involved building client side components with some minor server/services work.\n\nI have recently received two offers from Amazon and Microsoft and would like some help in deciding between the two.\n\n&amp;#x200B;\n\n**Amazon**:\n\nOne of the AWS Compliance services at KMS.\n\nOffer: SDE 2, 200 TC\n\nThe good: I feel like this job would give me direct exposure to server-side work at large scale. Java is sort of my main language. Had some friends ask around for me and current employee on the team seems to like the manager and says pressure is not too high. On call is 24/7 every 2 months?\n\nThe not so good: The amazon culture? I've heard some weird/bad things about Amazon. A quick search of linkedin, average employee tenure is about 2 years. The overall pip culture is a bit off putting to say the least. Should I even work here for 2 years and hop to another job? Bad vesting schedule.\n\n**Microsoft**:\n\nOffice 365 Org, Windows 10 Security client\n\nOffer: SDE 2, 150 TC\n\nThe good: MSFT seems to have better culture, nice perks. Average employee tenure is around 4 - 5 years in this specific office. The skip manager seems to be a nice guy with solid background. This seems like a nice place to build career? I agree with the company and CEO's vision. Learning/growth mindset. On call seems to be less than Amazon? Yearly refresher.\n\nThe not so good: MSFT stack seems to be less open. The work is mostly for the client side in C/C++/C#. Pay is less than AMZN, about 100K less in 4 years. Stock growth is slower. I would have to renege on Amazon offer... \n\n&amp;#x200B;\n\n**Additional Info:**\n\nI've already accepted the Amazon offer before the MSFT offer comes in (Interviewed at MSFT before Amazon). I know it is not ideal to renege (especially when Im about to start at AMZN soon) . But I am really torn on what to do. On one hand, I do want some exposure to cloud/service at scale experience, but on the other I also have some personal interest in security work. Company culture wise, Microsoft wins hands down, but friend of friend seems to suggest it's not that bad in this particular AWS team. As for pay, amazon wins.\n\n&amp;#x200B;\n\nI think i'm overthinking this and reaching decision fatigue... Any help/suggestion/recommendation is greatly appreciated!",
                    "author_fullname": "t2_99vzi5rw",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Early-Mid Career Advice! Please Help Me Decide!",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Experienced"
                        }
                    ],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_kb0yqw",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.81,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Experienced",
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1607685927.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1607685676.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;About Me:&lt;/strong&gt; I have about 4 YoE working at a startup (+1 YoE as intern). My work mostly involved building client side components with some minor server/services work.&lt;/p&gt;\n\n&lt;p&gt;I have recently received two offers from Amazon and Microsoft and would like some help in deciding between the two.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Amazon&lt;/strong&gt;:&lt;/p&gt;\n\n&lt;p&gt;One of the AWS Compliance services at KMS.&lt;/p&gt;\n\n&lt;p&gt;Offer: SDE 2, 200 TC&lt;/p&gt;\n\n&lt;p&gt;The good: I feel like this job would give me direct exposure to server-side work at large scale. Java is sort of my main language. Had some friends ask around for me and current employee on the team seems to like the manager and says pressure is not too high. On call is 24/7 every 2 months?&lt;/p&gt;\n\n&lt;p&gt;The not so good: The amazon culture? I&amp;#39;ve heard some weird/bad things about Amazon. A quick search of linkedin, average employee tenure is about 2 years. The overall pip culture is a bit off putting to say the least. Should I even work here for 2 years and hop to another job? Bad vesting schedule.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Microsoft&lt;/strong&gt;:&lt;/p&gt;\n\n&lt;p&gt;Office 365 Org, Windows 10 Security client&lt;/p&gt;\n\n&lt;p&gt;Offer: SDE 2, 150 TC&lt;/p&gt;\n\n&lt;p&gt;The good: MSFT seems to have better culture, nice perks. Average employee tenure is around 4 - 5 years in this specific office. The skip manager seems to be a nice guy with solid background. This seems like a nice place to build career? I agree with the company and CEO&amp;#39;s vision. Learning/growth mindset. On call seems to be less than Amazon? Yearly refresher.&lt;/p&gt;\n\n&lt;p&gt;The not so good: MSFT stack seems to be less open. The work is mostly for the client side in C/C++/C#. Pay is less than AMZN, about 100K less in 4 years. Stock growth is slower. I would have to renege on Amazon offer... &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Additional Info:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve already accepted the Amazon offer before the MSFT offer comes in (Interviewed at MSFT before Amazon). I know it is not ideal to renege (especially when Im about to start at AMZN soon) . But I am really torn on what to do. On one hand, I do want some exposure to cloud/service at scale experience, but on the other I also have some personal interest in security work. Company culture wise, Microsoft wins hands down, but friend of friend seems to suggest it&amp;#39;s not that bad in this particular AWS team. As for pay, amazon wins.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I think i&amp;#39;m overthinking this and reaching decision fatigue... Any help/suggestion/recommendation is greatly appreciated!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "kb0yqw",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "No_Background_6659",
                    "discussion_type": null,
                    "num_comments": 13,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/kb0yqw/earlymid_career_advice_please_help_me_decide/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/kb0yqw/earlymid_career_advice_please_help_me_decide/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1607685676.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "I'm 38, divorced mom of young kids. I was divorced about 10 years ago (can't believe it). I was in a very mentally abusive relationship that left me with a very bad inferiority complex and anxiety and depression.  After tons of therapy, I'm happy to report that I'm finally feeling better. However, I've wasted a ton of time working retail and \"McJobs\" because I honestly didn't think I could handle anything with more responsibility.\n\nI'm currently finishing up a Business Degree at WGU. Initially, the plan was to get into project management.  I love research and planning so I figured that would be good for me. But here comes self-doubt and worry rearing its ugly head again.  I was looking at a few posts about average days and such and I am starting to think its not a good fit for me. If I'm being honest with myself, I can see myself not doing a good job. Someone said that you have tons of responsibility, but none of the authority. I sometimes have trouble disciplining my kids sometimes how am I going to hold adults accountable?\n\nWhen I get down to it, I really want 4 things:\n\n\\- I don't want to take work home or be on call\n\n\\- I just want to be given work and time to complete it with little to no meetings.\n\n\\- The ability to work from home at least 80% of the time and not just because of Covid. I have a kid that is high risk.\n\n\\- The ability to freelance, start my own business.  If you've read Four Hour Work Week, this should sound familiar. Since I'm older I may be working past normal retirement age. So I want to get to the point where I have money coming in from investments and possibly part-time/contract work if I can't 100% retire.\n\nI don't need to make big bucks. At least $60k/year is good for me. I really want to get into real estate investing. My goal is to have at least 2-3 properties, then a bulk of my earned income can go into my kid's college funds and savings/investments.\n\nAnyway, I was considering two alternatives.\n\nSalesforce admin/developer. I actually went through a free boot camp. But, web dev made me hate programming. I started up recently, learning to make games with Unity and starting liking it again. Programming itself isn't terrible, I think its just how I tackled learning Web development just frustrated and discouraged me.\n\nBookkeeping, Taxes, etc.  - I can easily switch over to the accounting path. But I'm not sure. As a plus, I'm wondering if its easier to get a job NOW as a bookkeeper/accounting clerk after taking the basic accounting and excel classes. I can still take Accounting instead of Business Management and eventually take the CPA exam.\n\nCan someone lend a hand? Is this decision fatigue?  I've been floundering with decision for about a year now. I've been going back and forth. My birthday was a few weeks ago, which reminds me of how old I'm getting. So really need to pick a direction and stick to it.\n\n&amp;#x200B;\n\nThanks",
                    "author_fullname": "t2_137jvb",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Should I learn Salesforce Development or Bookkeeping?",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Student"
                        }
                    ],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_iuldxs",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.56,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Student",
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1600356852.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1600355546.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 38, divorced mom of young kids. I was divorced about 10 years ago (can&amp;#39;t believe it). I was in a very mentally abusive relationship that left me with a very bad inferiority complex and anxiety and depression.  After tons of therapy, I&amp;#39;m happy to report that I&amp;#39;m finally feeling better. However, I&amp;#39;ve wasted a ton of time working retail and &amp;quot;McJobs&amp;quot; because I honestly didn&amp;#39;t think I could handle anything with more responsibility.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently finishing up a Business Degree at WGU. Initially, the plan was to get into project management.  I love research and planning so I figured that would be good for me. But here comes self-doubt and worry rearing its ugly head again.  I was looking at a few posts about average days and such and I am starting to think its not a good fit for me. If I&amp;#39;m being honest with myself, I can see myself not doing a good job. Someone said that you have tons of responsibility, but none of the authority. I sometimes have trouble disciplining my kids sometimes how am I going to hold adults accountable?&lt;/p&gt;\n\n&lt;p&gt;When I get down to it, I really want 4 things:&lt;/p&gt;\n\n&lt;p&gt;- I don&amp;#39;t want to take work home or be on call&lt;/p&gt;\n\n&lt;p&gt;- I just want to be given work and time to complete it with little to no meetings.&lt;/p&gt;\n\n&lt;p&gt;- The ability to work from home at least 80% of the time and not just because of Covid. I have a kid that is high risk.&lt;/p&gt;\n\n&lt;p&gt;- The ability to freelance, start my own business.  If you&amp;#39;ve read Four Hour Work Week, this should sound familiar. Since I&amp;#39;m older I may be working past normal retirement age. So I want to get to the point where I have money coming in from investments and possibly part-time/contract work if I can&amp;#39;t 100% retire.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t need to make big bucks. At least $60k/year is good for me. I really want to get into real estate investing. My goal is to have at least 2-3 properties, then a bulk of my earned income can go into my kid&amp;#39;s college funds and savings/investments.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was considering two alternatives.&lt;/p&gt;\n\n&lt;p&gt;Salesforce admin/developer. I actually went through a free boot camp. But, web dev made me hate programming. I started up recently, learning to make games with Unity and starting liking it again. Programming itself isn&amp;#39;t terrible, I think its just how I tackled learning Web development just frustrated and discouraged me.&lt;/p&gt;\n\n&lt;p&gt;Bookkeeping, Taxes, etc.  - I can easily switch over to the accounting path. But I&amp;#39;m not sure. As a plus, I&amp;#39;m wondering if its easier to get a job NOW as a bookkeeper/accounting clerk after taking the basic accounting and excel classes. I can still take Accounting instead of Business Management and eventually take the CPA exam.&lt;/p&gt;\n\n&lt;p&gt;Can someone lend a hand? Is this decision fatigue?  I&amp;#39;ve been floundering with decision for about a year now. I&amp;#39;ve been going back and forth. My birthday was a few weeks ago, which reminds me of how old I&amp;#39;m getting. So really need to pick a direction and stick to it.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "c9dd4bf2-b859-11e3-8535-12313d31e5b1",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "iuldxs",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "thisoneforfun",
                    "discussion_type": null,
                    "num_comments": 7,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/iuldxs/should_i_learn_salesforce_development_or/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/iuldxs/should_i_learn_salesforce_development_or/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1600355546.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "**Background**\n\nI interviewed at MSFT before AMZN in late November. AMZN came back to me with an offer right away and since my interview with MSFT didn't go as well, I accepted the AMZN's expiring offer. Then a few days later, MSFT reached out and extended an offer to me. Both offers are similar with AMZN paying about 50K more in TC.\n\n&amp;#x200B;\n\n**Current Situation**\n\nI've already quit my current job and I'm set to start AMZN very soon (as in a week away). However, after reading more stories online, AMZN seems less and less appealing to me. Especially with the whole pip culture and the employee tenure I've seen on Linkedin (for employees in the area). Compare to AMZN, MSFT seems like a better choice each day... I am really torn on what to do.\n\nAlso MS jobs in my area is significantly smaller than AM job openings. And it is bound to stay that way. If I don't take the MS job now, I will likely not be able to try MS as easily in the future.\n\n&amp;#x200B;\n\n**Help Request**\n\nIf I renege, what is the consequences? I understand renege before starting is not ideal but it is definitely better than quitting a few days into the job.\n\n&amp;#x200B;\n\nI think i'm overthinking this and reaching decision fatigue... Any help/suggestion/recommendation is greatly appreciated!",
                    "author_fullname": "t2_99vzi5rw",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Backing out before staring? I'm really overthinking here, please help...",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_kbbfyw",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.6,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1607721098.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Background&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I interviewed at MSFT before AMZN in late November. AMZN came back to me with an offer right away and since my interview with MSFT didn&amp;#39;t go as well, I accepted the AMZN&amp;#39;s expiring offer. Then a few days later, MSFT reached out and extended an offer to me. Both offers are similar with AMZN paying about 50K more in TC.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Current Situation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve already quit my current job and I&amp;#39;m set to start AMZN very soon (as in a week away). However, after reading more stories online, AMZN seems less and less appealing to me. Especially with the whole pip culture and the employee tenure I&amp;#39;ve seen on Linkedin (for employees in the area). Compare to AMZN, MSFT seems like a better choice each day... I am really torn on what to do.&lt;/p&gt;\n\n&lt;p&gt;Also MS jobs in my area is significantly smaller than AM job openings. And it is bound to stay that way. If I don&amp;#39;t take the MS job now, I will likely not be able to try MS as easily in the future.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Help Request&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If I renege, what is the consequences? I understand renege before starting is not ideal but it is definitely better than quitting a few days into the job.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I think i&amp;#39;m overthinking this and reaching decision fatigue... Any help/suggestion/recommendation is greatly appreciated!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "kbbfyw",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "No_Background_6659",
                    "discussion_type": null,
                    "num_comments": 5,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/kbbfyw/backing_out_before_staring_im_really_overthinking/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/kbbfyw/backing_out_before_staring_im_really_overthinking/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1607721098.0,
                    "num_crossposts": 1,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "So I have come into a situation where I have to pick between two different positions that seem like awesome fits...\n\nOne is an interview I have today at a small company. I'd be able to have tons of responsibilities, and the owner seems to REALLY REALLY need someone to fill more than one role (I originally interviewed for one role but he was so impressed with my unique background in other fields that he asked if I would be interested in transitioning to their programming team in a few months), so my potential for growth would be high (the pay for the non-tech position I applied for was already good, so I'll likely get a raise being on their dev team), and the pay is good. I'd also be able to work from home a majority of the time, which is super appealing to me.\n\nThe other role I happened upon by chance: I won an essay contest while at non-profit event I attended through my school and apparently impressed the Vice President so much that she's offering me an internship. According to her secretary who called me, she was \"not sure what I did to impress Ms. \\_\\_\\_\\_\\_\\_\\_\\_, but she's pulled the funds together to make this internship for you. We aren't even in the season for interning\". Apparently they'll place me in whatever role in the company that I want when we discuss tomorrow, and they basically *made* this position for me. I'm not sure if they're converting, but the junior software developers at that company make WAY above this city's market value, and 20-30k more than the position I'm interviewing today for.\n\nI'm stoked, but now what was an easy choice (the only interview I had was for the small company and I was absolutely going to take it) doesn't seem so easy. I'm panicking because I get decision fatigue really easy. **On one hand**, the small company seem like they want to hire me TODAY and that this interview is more or less a formality. I'd be able to work from home a MAJORITY of the time, and make pretty good pay, with great potential for growth and possibly lots of security, because I have a unique background in other stuff before CS and will have more than one role. **On the other hand**, I could intern at a huge, globally recognized non-profit and potentially get hired there making lots of money, but from what I've seen on Glassdoor, their interns to NOT get paid well. I would feel bad about passing up that opportunity as well because the vice president literally made the job for me and I'm meeting with someone shortly to tailor the position to my desires. I could learn a lot though and have a good name on my resume.\n\n**What should I do here? What factors am I also not considering? I'm nervous because I've thought about asking the non-profit if they couldn't work with my schedule on the other job, because the small company will allow me to work from home most of the time, and the second position says that they take people part or full time... would it be rude for me to ask for either company to work around? When should I ask that, when I have an offer from both? Is me saying \"Can I wait until Friday/Monday to give you an answer\" rude (that's two to five days away)?**",
                    "author_fullname": "t2_12jcsh",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I've never had to navigate between picking new positions before. Can I ask someone to wait a week for my decision?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_d2okom",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.79,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 12,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 12,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1568201064.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I have come into a situation where I have to pick between two different positions that seem like awesome fits...&lt;/p&gt;\n\n&lt;p&gt;One is an interview I have today at a small company. I&amp;#39;d be able to have tons of responsibilities, and the owner seems to REALLY REALLY need someone to fill more than one role (I originally interviewed for one role but he was so impressed with my unique background in other fields that he asked if I would be interested in transitioning to their programming team in a few months), so my potential for growth would be high (the pay for the non-tech position I applied for was already good, so I&amp;#39;ll likely get a raise being on their dev team), and the pay is good. I&amp;#39;d also be able to work from home a majority of the time, which is super appealing to me.&lt;/p&gt;\n\n&lt;p&gt;The other role I happened upon by chance: I won an essay contest while at non-profit event I attended through my school and apparently impressed the Vice President so much that she&amp;#39;s offering me an internship. According to her secretary who called me, she was &amp;quot;not sure what I did to impress Ms. ________, but she&amp;#39;s pulled the funds together to make this internship for you. We aren&amp;#39;t even in the season for interning&amp;quot;. Apparently they&amp;#39;ll place me in whatever role in the company that I want when we discuss tomorrow, and they basically &lt;em&gt;made&lt;/em&gt; this position for me. I&amp;#39;m not sure if they&amp;#39;re converting, but the junior software developers at that company make WAY above this city&amp;#39;s market value, and 20-30k more than the position I&amp;#39;m interviewing today for.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m stoked, but now what was an easy choice (the only interview I had was for the small company and I was absolutely going to take it) doesn&amp;#39;t seem so easy. I&amp;#39;m panicking because I get decision fatigue really easy. &lt;strong&gt;On one hand&lt;/strong&gt;, the small company seem like they want to hire me TODAY and that this interview is more or less a formality. I&amp;#39;d be able to work from home a MAJORITY of the time, and make pretty good pay, with great potential for growth and possibly lots of security, because I have a unique background in other stuff before CS and will have more than one role. &lt;strong&gt;On the other hand&lt;/strong&gt;, I could intern at a huge, globally recognized non-profit and potentially get hired there making lots of money, but from what I&amp;#39;ve seen on Glassdoor, their interns to NOT get paid well. I would feel bad about passing up that opportunity as well because the vice president literally made the job for me and I&amp;#39;m meeting with someone shortly to tailor the position to my desires. I could learn a lot though and have a good name on my resume.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What should I do here? What factors am I also not considering? I&amp;#39;m nervous because I&amp;#39;ve thought about asking the non-profit if they couldn&amp;#39;t work with my schedule on the other job, because the small company will allow me to work from home most of the time, and the second position says that they take people part or full time... would it be rude for me to ask for either company to work around? When should I ask that, when I have an offer from both? Is me saying &amp;quot;Can I wait until Friday/Monday to give you an answer&amp;quot; rude (that&amp;#39;s two to five days away)?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "d2okom",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "CaliBounded",
                    "discussion_type": null,
                    "num_comments": 9,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/d2okom/ive_never_had_to_navigate_between_picking_new/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/d2okom/ive_never_had_to_navigate_between_picking_new/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1568201064.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "**TLDR: My classmate who has come with me on my internship is not where he needs to be in terms of working on a team with me. He doesn't understand basic concepts, but he's been assigned to work on an app with me. He slows down my work, but is also too prideful to accept any help or tutoring in fear of looking like he doesn't know something (he doesn't, and it's actually obvious to everyone else), yet he is even taking it a step further trying to take charge of the production /delegate tasks to me on making this app that even he doesn't know how to make any part of it, and frequently asks ME for help. I don't know how to tell our representative from the school about this without making me sound like some asshole who's too impatient to help, but I am not okay with him getting credit for an app he didn't build. I'm considering even delegating him some kind of busy work... how do I handle this?**\n\nSo this is kind of long, but I do definitely need some help with this.\n\nSo I finished the first half of a fantastic program where students who are accepted learn something IT-related for 6 months, and receive a Fortune 500 company internship for another 6 months in the hopes of being hired/converted, then we graduate. I am in the Software Development track of my program.\n\nPrior to entry, I worked my tail off learning web development on my own for 8 long months. For the first two months, I'd come home from work and study for 8 hours a day. I was tired of working customer service jobs, as I have no parents, and no means to pay for college or higher education, but I figured I'd learn a trade in something I was already somewhat versed in. I found out about the program, got in, and have a 4.0 (our courses count for college credits). This has resulted in me being sent to one of three internships that our best students go to.\n\nSo far, my internship environment is great: I love my supervisors and the atmosphere of the office. It's super casual, and I've only been there 2 weeks but I've been learning so much. The thing is, I was sent to my internship with a few other students from my program; Some students, however, because of the fact that we had to learn so much in 6 months, were really good at convincing our instructors they knew more than they actually did. The student that is on my team is one of those students: I feel bad for him in a sense, because on one hand, we both need to do well on this internship to get good recommendations to get hired after its over, or even possibly taken on by the company. But if I had to describe his level of skill, it's like... trying to explain geometry to someone who only knows arithmetic. I wouldn't mind helping him if it weren't for the fact that he's stubborn.\n\nLet me give an example: We work with mostly Ruby and Ruby on Rails in our company, and not much else besides front-end technologies (HTML, CSS, and JS). He was attempting to teach himself SQL, Python, Django, and C++ at the **same time**, and three of those technologies are not anything we're using at our company; I tried to explain to him that Python is not something we're using, and he said he \"Wanted to learn it anyway\" because he doesn't like being corrected. As a result, he doesn't even know the syntax of Ruby yet, and our supervisor ended up having to tell him exactly what i did during a meeting that we don't use Python, and that he recommended he didn't learn it right now. I also warned him not to be doing several tutorial series at once on one subject, because in my experience, it throws me off and makes things take longer (decision fatigue is very real, and it slows down the learning process for me when I can't even decide which book or video series I'm consuming that day). I feel alot of the times that he is afraid of coming off like he doesn't know anything, so he attempts to make himself look good, which results in him learning even less than he could from this rare experience. **The issue is that we have recently been told that we have to create an app for the company...** ***together***. I have never done this before, but I do know the concepts involved: We have to make a database, find an API so people can book reservations with the app, create a backend, link it to the front end, etc. What I don't know, I at least know HOW to find out how to do it. He doesn't understand basic concepts and has barely ever written basic scripts like a CLI calculator (thus the arithmetic/geometry analogy earlier) and will ask for help, but will then completely deviate from what you tell him to do -- I explained to him that there's an order to the things he needs to learn... that he needs to at least know what composes a web app (what HTTP is, APIs, JSON, etc.) before he starts working on one. he just barraged me with questions earlier today, then directly after me trying to (once again, the analogy) explain geometry to someone who knows arithmetic, he tried to instruct ME on what task I should do first. I was livid. I stood my ground and reminded him (in the most professional language possible) of the fact that I've been his personal google machine the last two weeks, so maybe I should be the one delegating tasks (he backed down after that) I do feel like some of his issues stem from the fact that I'm a woman, and maybe it hurts his pride or something having to come to me for help (this happened a few times during school actually)\n\nMy point is, I'm at a loss how to handle this. I feel like this guy found his way into this internship not knowing as much as he's supposed to, which is fine -- I would feel bad for him if it weren't for the fact that he doesn't take criticism well. I am tired of him riding my coat tails -- before he tried instructing me (the person who has been instructing him these last two weeks) what to do on this app, he messaged me to find out what I was doing/studying. Because whenever I tell him, he begins working on the same thing I am even if it's a one-person job: If I told him I was working on the database for this project, he'd immediately start creating a database too... the exact same one with the exact same data I'm making, because he's afraid of not looking busy and literally has no clue how to do anything without my help He's not independent, and is riding my coat-tails, and by the time I'm halfway finished with this app, he'll actually know enough to do something to help me on it. He wants me to assign him tasks but if I do, he'll be coming to me every 3 minutes asking me what to do next(he's done this to a coworker who's been hired from the same program we came from, to the point where he became visibly annoyed), and absolutely won't listen when I try to tell him what he can do next, leading himself down some kind of rabbithole (\"Hey, I know you told me to make a database, but I decided to teach myself HTML and CSS and started making the front end!\") and whatever he makes, I'll end up having to fix it, thereby making this whole app take even longer to make.\n\nWe have a representative that we're supposed to report to who monitors our progress during internship and helps us negotiate salary if they decide to hire us, provide us with moral support, etc. We have the same rep since we're on the same internship, and I don't know how to let him know that he literally can't contribute to this project rn without making me sound like a dick who \"just doesn't want to help your fellow classmate in need\"(staff often reminds us to help eachother, but he doesn't want the help, so idk what the heck I'm supposed to do). I'm also debating finding some kind of way to delegate him busy work... I'm just really annoyed by how all over the place this guy is. Like legit, I could finish this app in a month or so I'm sure, and by the end of the month, he'll have finished picking up Rails and will be ready to actually help.",
                    "author_fullname": "t2_12jcsh",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I am on internship and feel that I am stuck babysitting my classmate who is on my internship with me. What can I do about this situation?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_apdc56",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.64,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": 1549865746.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1549865460.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TLDR: My classmate who has come with me on my internship is not where he needs to be in terms of working on a team with me. He doesn&amp;#39;t understand basic concepts, but he&amp;#39;s been assigned to work on an app with me. He slows down my work, but is also too prideful to accept any help or tutoring in fear of looking like he doesn&amp;#39;t know something (he doesn&amp;#39;t, and it&amp;#39;s actually obvious to everyone else), yet he is even taking it a step further trying to take charge of the production /delegate tasks to me on making this app that even he doesn&amp;#39;t know how to make any part of it, and frequently asks ME for help. I don&amp;#39;t know how to tell our representative from the school about this without making me sound like some asshole who&amp;#39;s too impatient to help, but I am not okay with him getting credit for an app he didn&amp;#39;t build. I&amp;#39;m considering even delegating him some kind of busy work... how do I handle this?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So this is kind of long, but I do definitely need some help with this.&lt;/p&gt;\n\n&lt;p&gt;So I finished the first half of a fantastic program where students who are accepted learn something IT-related for 6 months, and receive a Fortune 500 company internship for another 6 months in the hopes of being hired/converted, then we graduate. I am in the Software Development track of my program.&lt;/p&gt;\n\n&lt;p&gt;Prior to entry, I worked my tail off learning web development on my own for 8 long months. For the first two months, I&amp;#39;d come home from work and study for 8 hours a day. I was tired of working customer service jobs, as I have no parents, and no means to pay for college or higher education, but I figured I&amp;#39;d learn a trade in something I was already somewhat versed in. I found out about the program, got in, and have a 4.0 (our courses count for college credits). This has resulted in me being sent to one of three internships that our best students go to.&lt;/p&gt;\n\n&lt;p&gt;So far, my internship environment is great: I love my supervisors and the atmosphere of the office. It&amp;#39;s super casual, and I&amp;#39;ve only been there 2 weeks but I&amp;#39;ve been learning so much. The thing is, I was sent to my internship with a few other students from my program; Some students, however, because of the fact that we had to learn so much in 6 months, were really good at convincing our instructors they knew more than they actually did. The student that is on my team is one of those students: I feel bad for him in a sense, because on one hand, we both need to do well on this internship to get good recommendations to get hired after its over, or even possibly taken on by the company. But if I had to describe his level of skill, it&amp;#39;s like... trying to explain geometry to someone who only knows arithmetic. I wouldn&amp;#39;t mind helping him if it weren&amp;#39;t for the fact that he&amp;#39;s stubborn.&lt;/p&gt;\n\n&lt;p&gt;Let me give an example: We work with mostly Ruby and Ruby on Rails in our company, and not much else besides front-end technologies (HTML, CSS, and JS). He was attempting to teach himself SQL, Python, Django, and C++ at the &lt;strong&gt;same time&lt;/strong&gt;, and three of those technologies are not anything we&amp;#39;re using at our company; I tried to explain to him that Python is not something we&amp;#39;re using, and he said he &amp;quot;Wanted to learn it anyway&amp;quot; because he doesn&amp;#39;t like being corrected. As a result, he doesn&amp;#39;t even know the syntax of Ruby yet, and our supervisor ended up having to tell him exactly what i did during a meeting that we don&amp;#39;t use Python, and that he recommended he didn&amp;#39;t learn it right now. I also warned him not to be doing several tutorial series at once on one subject, because in my experience, it throws me off and makes things take longer (decision fatigue is very real, and it slows down the learning process for me when I can&amp;#39;t even decide which book or video series I&amp;#39;m consuming that day). I feel alot of the times that he is afraid of coming off like he doesn&amp;#39;t know anything, so he attempts to make himself look good, which results in him learning even less than he could from this rare experience. &lt;strong&gt;The issue is that we have recently been told that we have to create an app for the company...&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;together&lt;/em&gt;&lt;/strong&gt;. I have never done this before, but I do know the concepts involved: We have to make a database, find an API so people can book reservations with the app, create a backend, link it to the front end, etc. What I don&amp;#39;t know, I at least know HOW to find out how to do it. He doesn&amp;#39;t understand basic concepts and has barely ever written basic scripts like a CLI calculator (thus the arithmetic/geometry analogy earlier) and will ask for help, but will then completely deviate from what you tell him to do -- I explained to him that there&amp;#39;s an order to the things he needs to learn... that he needs to at least know what composes a web app (what HTTP is, APIs, JSON, etc.) before he starts working on one. he just barraged me with questions earlier today, then directly after me trying to (once again, the analogy) explain geometry to someone who knows arithmetic, he tried to instruct ME on what task I should do first. I was livid. I stood my ground and reminded him (in the most professional language possible) of the fact that I&amp;#39;ve been his personal google machine the last two weeks, so maybe I should be the one delegating tasks (he backed down after that) I do feel like some of his issues stem from the fact that I&amp;#39;m a woman, and maybe it hurts his pride or something having to come to me for help (this happened a few times during school actually)&lt;/p&gt;\n\n&lt;p&gt;My point is, I&amp;#39;m at a loss how to handle this. I feel like this guy found his way into this internship not knowing as much as he&amp;#39;s supposed to, which is fine -- I would feel bad for him if it weren&amp;#39;t for the fact that he doesn&amp;#39;t take criticism well. I am tired of him riding my coat tails -- before he tried instructing me (the person who has been instructing him these last two weeks) what to do on this app, he messaged me to find out what I was doing/studying. Because whenever I tell him, he begins working on the same thing I am even if it&amp;#39;s a one-person job: If I told him I was working on the database for this project, he&amp;#39;d immediately start creating a database too... the exact same one with the exact same data I&amp;#39;m making, because he&amp;#39;s afraid of not looking busy and literally has no clue how to do anything without my help He&amp;#39;s not independent, and is riding my coat-tails, and by the time I&amp;#39;m halfway finished with this app, he&amp;#39;ll actually know enough to do something to help me on it. He wants me to assign him tasks but if I do, he&amp;#39;ll be coming to me every 3 minutes asking me what to do next(he&amp;#39;s done this to a coworker who&amp;#39;s been hired from the same program we came from, to the point where he became visibly annoyed), and absolutely won&amp;#39;t listen when I try to tell him what he can do next, leading himself down some kind of rabbithole (&amp;quot;Hey, I know you told me to make a database, but I decided to teach myself HTML and CSS and started making the front end!&amp;quot;) and whatever he makes, I&amp;#39;ll end up having to fix it, thereby making this whole app take even longer to make.&lt;/p&gt;\n\n&lt;p&gt;We have a representative that we&amp;#39;re supposed to report to who monitors our progress during internship and helps us negotiate salary if they decide to hire us, provide us with moral support, etc. We have the same rep since we&amp;#39;re on the same internship, and I don&amp;#39;t know how to let him know that he literally can&amp;#39;t contribute to this project rn without making me sound like a dick who &amp;quot;just doesn&amp;#39;t want to help your fellow classmate in need&amp;quot;(staff often reminds us to help eachother, but he doesn&amp;#39;t want the help, so idk what the heck I&amp;#39;m supposed to do). I&amp;#39;m also debating finding some kind of way to delegate him busy work... I&amp;#39;m just really annoyed by how all over the place this guy is. Like legit, I could finish this app in a month or so I&amp;#39;m sure, and by the end of the month, he&amp;#39;ll have finished picking up Rails and will be ready to actually help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "apdc56",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "CaliBounded",
                    "discussion_type": null,
                    "num_comments": 7,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/apdc56/i_am_on_internship_and_feel_that_i_am_stuck/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/apdc56/i_am_on_internship_and_feel_that_i_am_stuck/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1549865460.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "cscareerquestions",
                    "selftext": "Good morning from somewhere in Europe!\n\n&amp;nbsp;\n\n**tl;dr: How do I choose a path in this field when I'm presented with so many options?**\n\n&amp;nbsp;\n\n*Please keep in mind that English is not my native language. Feel free to ask me to elaborate if I worded something oddly.*\n\n&amp;nbsp;\n\nMy question is about 'choice fatigue'. I've been reading about 'imposter syndrome' and 'decision fatigue' a lot over the past few days. Some of what I've been reading made a lot of sense, but it wasn't enough to really help me out.\n\nI'm a CS student at a university somewhere in Europe and I'm graduating somewhere in the next few months. I will graduate with the equivalent of a 4.0 GPA as my results officially translate to that. The curriculum has been very tech-y and math-y, which I loved when I was able to combine theory with creating actual software. This leads me to believe that I should persue a career in software engineering when I graduate. I have a handful of solid job offers lined up - one of which is from the company I interned at.\n\n**My problem is that these offers span different 'domains'. I have a really hard time choosing and I would love some input.**\n\nBefore my internship, I took some additional classes on machine learning for extra credit as I wanted to learn more about this topic. I loved learning about machine learning and when I later expressed this during my internship, the company I interned at offered me to do another project for their machine intelligence department. As the project involved a real client with real data, I quickly expressed interest in the client-facing part of the project. Soon after learning from one of the company's BI consultants on the go, I was allowed to work on a smaller project for the client all alone as a 'consultant'. I loved this too and all of this basically led to three job offers: software engineer at the development department, BI engineer at the intelligence department and data scientist at the client company.\n\nThis was last year and because I still had some work to do before I could graduate, I couldn't accept any of the offers back then. After my internship, I focused on writing my thesis. Because I, again, wanted to explore different topics I chose security as my research domain. Long story short as I'm finishing up my thesis: my professor loves my work. I'm going to present my conclusions at a security conference. Additionally, he offered me a job as a PhD student in the security domain.\n\nDuring all of this, I loved developing games for myself on the side. While working on my games, I was often asked to explain how I did X or Y technique on several forums. Because of this, I started creating assets and I've sold quite a lot of these on game development asset stores. Lately, I've been working on a mod for a game developed by a local game company as I wanted to combine everything that I learned. This resulted in that company offering me a position on their team to continue my work.\n\n&amp;nbsp;\n\n**How do I start eliminating choices?**\n\nDo I start my career as a software engineer? I think the recurring theme in all of this is actually creating software - which I love. My career counselor (affiliated with my university), however, downplays this as the 'default choice'. She makes me feel like choosing 'regular software engineering' is an inferior choice, which I don't think I agree with. What do you think?\n\nDo I start my career in machine learning or BI? How do I know if I want do be a consultant or just work on the tech? Is my CS degree coupled with a few Master's level classes enough to hold my own?\n\nDo I pursue a PhD in security? My career advisor strongly advises choosing this, but I'm not sure and I think she's biased. My main 'against' tally is that I don't think that I want to continue working in academia. I've been reading a lot of conflicted posts about whether or not a PhD is worth it when I want to start (not now, as the PhD is a few years) my career in the industry, so I'm still conflicted.\n\nDid I make a few bad choices by learning about these different topics in depth? When I look at, for example, other students that focused on just creating software I feel like I'm behind the curve. They all have cool tools, apps, etc. while I'm stuck with my experience in different fields.\n\nEtc.\n\n&amp;nbsp;\n\nAs I proofread this post, I feel like it sounds really cocky and arrogant. Please don't take it that way. I feel like I owe most of my options to my connections or to plain luck - but I honestly don't feel very lucky as I'm very stressed out about defining my future.\n\nI've tried narrowing down my choices by keeping up the conversation with all of these companies. I'm also in the hiring process of a few different companies. This hasn't really worked, as I'm now even more conflicted and the companies are expecting an answer soon. Additionaly, the companies (especially the larger ones) advocate the possibility of combining different 'fields' ie. software engineering with consulting focused on machine learning. When I look at the vacancies on the websites however, the jobs seem more 'strictly defined' if that makes sense. Additionally, I'm afraid to fall behind if I start out as a generalist and want to work in a single field later on. Finally, I ended up deleting my LinkedIn profile just last week as recruiters kept calling me about my listed date of graduation.\n\n&amp;nbsp;\n\n**I'm looking for your thoughts about choice fatigue and imposter syndrome in the context of having multiple job offers. How did you play the elimination game? Thank you for reading my wall of text.**",
                    "author_fullname": "t2_15sp8u",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Choice fatigue: where to start a career and what does picking a subfield mean for future options?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/cscareerquestions",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_5wnjhb",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.8,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1488282402.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.cscareerquestions",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Good morning from somewhere in Europe!&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr: How do I choose a path in this field when I&amp;#39;m presented with so many options?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Please keep in mind that English is not my native language. Feel free to ask me to elaborate if I worded something oddly.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;My question is about &amp;#39;choice fatigue&amp;#39;. I&amp;#39;ve been reading about &amp;#39;imposter syndrome&amp;#39; and &amp;#39;decision fatigue&amp;#39; a lot over the past few days. Some of what I&amp;#39;ve been reading made a lot of sense, but it wasn&amp;#39;t enough to really help me out.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a CS student at a university somewhere in Europe and I&amp;#39;m graduating somewhere in the next few months. I will graduate with the equivalent of a 4.0 GPA as my results officially translate to that. The curriculum has been very tech-y and math-y, which I loved when I was able to combine theory with creating actual software. This leads me to believe that I should persue a career in software engineering when I graduate. I have a handful of solid job offers lined up - one of which is from the company I interned at.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My problem is that these offers span different &amp;#39;domains&amp;#39;. I have a really hard time choosing and I would love some input.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Before my internship, I took some additional classes on machine learning for extra credit as I wanted to learn more about this topic. I loved learning about machine learning and when I later expressed this during my internship, the company I interned at offered me to do another project for their machine intelligence department. As the project involved a real client with real data, I quickly expressed interest in the client-facing part of the project. Soon after learning from one of the company&amp;#39;s BI consultants on the go, I was allowed to work on a smaller project for the client all alone as a &amp;#39;consultant&amp;#39;. I loved this too and all of this basically led to three job offers: software engineer at the development department, BI engineer at the intelligence department and data scientist at the client company.&lt;/p&gt;\n\n&lt;p&gt;This was last year and because I still had some work to do before I could graduate, I couldn&amp;#39;t accept any of the offers back then. After my internship, I focused on writing my thesis. Because I, again, wanted to explore different topics I chose security as my research domain. Long story short as I&amp;#39;m finishing up my thesis: my professor loves my work. I&amp;#39;m going to present my conclusions at a security conference. Additionally, he offered me a job as a PhD student in the security domain.&lt;/p&gt;\n\n&lt;p&gt;During all of this, I loved developing games for myself on the side. While working on my games, I was often asked to explain how I did X or Y technique on several forums. Because of this, I started creating assets and I&amp;#39;ve sold quite a lot of these on game development asset stores. Lately, I&amp;#39;ve been working on a mod for a game developed by a local game company as I wanted to combine everything that I learned. This resulted in that company offering me a position on their team to continue my work.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How do I start eliminating choices?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Do I start my career as a software engineer? I think the recurring theme in all of this is actually creating software - which I love. My career counselor (affiliated with my university), however, downplays this as the &amp;#39;default choice&amp;#39;. She makes me feel like choosing &amp;#39;regular software engineering&amp;#39; is an inferior choice, which I don&amp;#39;t think I agree with. What do you think?&lt;/p&gt;\n\n&lt;p&gt;Do I start my career in machine learning or BI? How do I know if I want do be a consultant or just work on the tech? Is my CS degree coupled with a few Master&amp;#39;s level classes enough to hold my own?&lt;/p&gt;\n\n&lt;p&gt;Do I pursue a PhD in security? My career advisor strongly advises choosing this, but I&amp;#39;m not sure and I think she&amp;#39;s biased. My main &amp;#39;against&amp;#39; tally is that I don&amp;#39;t think that I want to continue working in academia. I&amp;#39;ve been reading a lot of conflicted posts about whether or not a PhD is worth it when I want to start (not now, as the PhD is a few years) my career in the industry, so I&amp;#39;m still conflicted.&lt;/p&gt;\n\n&lt;p&gt;Did I make a few bad choices by learning about these different topics in depth? When I look at, for example, other students that focused on just creating software I feel like I&amp;#39;m behind the curve. They all have cool tools, apps, etc. while I&amp;#39;m stuck with my experience in different fields.&lt;/p&gt;\n\n&lt;p&gt;Etc.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;As I proofread this post, I feel like it sounds really cocky and arrogant. Please don&amp;#39;t take it that way. I feel like I owe most of my options to my connections or to plain luck - but I honestly don&amp;#39;t feel very lucky as I&amp;#39;m very stressed out about defining my future.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried narrowing down my choices by keeping up the conversation with all of these companies. I&amp;#39;m also in the hiring process of a few different companies. This hasn&amp;#39;t really worked, as I&amp;#39;m now even more conflicted and the companies are expecting an answer soon. Additionaly, the companies (especially the larger ones) advocate the possibility of combining different &amp;#39;fields&amp;#39; ie. software engineering with consulting focused on machine learning. When I look at the vacancies on the websites however, the jobs seem more &amp;#39;strictly defined&amp;#39; if that makes sense. Additionally, I&amp;#39;m afraid to fall behind if I start out as a generalist and want to work in a single field later on. Finally, I ended up deleting my LinkedIn profile just last week as recruiters kept calling me about my listed date of graduation.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I&amp;#39;m looking for your thoughts about choice fatigue and imposter syndrome in the context of having multiple job offers. How did you play the elimination game? Thank you for reading my wall of text.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sdpm",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "5wnjhb",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "youhavemycardioid",
                    "discussion_type": null,
                    "num_comments": 8,
                    "send_replies": false,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/cscareerquestions/comments/5wnjhb/choice_fatigue_where_to_start_a_career_and_what/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/cscareerquestions/comments/5wnjhb/choice_fatigue_where_to_start_a_career_and_what/",
                    "subreddit_subscribers": 1873325,
                    "created_utc": 1488282402.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}