{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 6,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": "Part 1: [https://www.reddit.com/r/Daytrading/comments/fw82ow/after\\_2\\_years\\_of\\_daytrading\\_7\\_months\\_full\\_time/](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/)\n\n&amp;#x200B;\n\nPart 3: [https://www.reddit.com/r/Daytrading/comments/mh0nfp/part\\_3\\_my\\_full\\_time\\_trading\\_career\\_1\\_year\\_since\\_i/](https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/)\n\n&amp;#x200B;\n\nThis industry has a lack of transparency so I'm more than happy to say I will provide lots of that throughout this post with screenshots. There are LOTS of imgur links to back what I say so it's not just words on a post expecting you to just believe what I'm typing.\n\nThis post I suppose is \"Part 2\" my post back in April, [\"After 2 years of Daytrading. 7 months full time. Here's my advice\"](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/). I'm doing this to update everyone who came/comes across this in the future. Yes, it is possible. No, it won't be easy. You will pay homage to the rite of passage into this career. I'll also provide some examples of styles of trading so for the newer aspiring traders, there will be some things I rarely see discussed on forums. So here's to 1 year of [Full Time Day Trading](https://imgur.com/a/wG4UQBO)\n\n&amp;#x200B;\n\n**TL;DR** \\- You'll become desensitized to trading. Stubborn to other strategies (There are bigger/badder/more lucrative strategies. Don't chase them. Why fix what's not broken? I know what works for me and I'm content with it. No strategy is better than another. It's a personal choice. ). Losing individual trades won't faze you, they're inevitable. Profiting certainly feels better. After a while, you won't be as enthralled to trade every morning, it'll become just another part of your day). Trading is just managing your money through a statistic and the medium to execute it is trading on your platform. **Think: \"If. Then. Because\".** Your trading plan should be that black and white. **Ask \"Why\" for everything you do and use. If you can't answer it with documented results, drop it.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n~~I get a bunch of messages all the time from people asking -~~ . [Out of those who follow](https://imgur.com/a/W58BFbe) me and [chat me seeking further tips](https://imgur.com/a/3DUYbwg) through my previous posts. I'll be answering the FAQ's and addressing things I see frequently in this sub as far as trading axioms\n\n**Disclaimer**: I won't sugarcoat anything. I'll share my experiences and add pieces of advice I'd give to those who are currently experiencing the same thing becoming a full time day trader and what day to day life is like, the occasional distress, (*DRAWDOWNS*). Some of you follow my Twitter for the past few months where I post my daily watchlists with a snippet that reveals my DayTradingBuyingPower. I do this not to brag but to demonstrate that the account does yield growth, I pay myself, and there are days where the balance does not move because there was no edge. I also do this since nobody else shows their account performance. (Yes. You, Mr. YouTube gurus and wannabe gurus).\n\nWe do this for income, the numbers on our accounts are real. Treat it as such. Get your initial capital out of your account THEN try to \"*Scale your account*\" with your profits **AKA The Market's Money.**\n\n&amp;#x200B;\n\n**I'll go over:**\n\n•FAQ's that I get in my inbox *(I'm still welcome to further questions if I don't answer here)*\n\n•Decision Fatigue *(You will experience this)*\n\n•The previous year (2019-2020) of ups and downs\n\n•How to use my watchlists that I post on Twitter in the morning to your advantage\n\n•The pivotal moment that changed my trading career *(NFLX 10-17-19)*\n\n•The road to becoming a full time trader. *(It won't be fun unless you're handed the money)*\n\n•You'll have a better grasp of my strategy (Between ProTip 4 and 5. ProTip 8.)\n\n&amp;#x200B;\n\n**There are 10 \"ProTips\" throughout the post that I wish I could tell myself years back** and I'll periodically throw them in here as the post goes on. I make posts long in order to segregate those serious about this business and those who will just become another statistic in the failure rate of this business.\n\n&amp;#x200B;\n\n**At the end of this post, I'll go over the frequent questions I receive such as**: (Answers to FAQ at bottom of post.)\n\n1. \"How do you prepare for a trading day?\"\n2. \"What would you go back to tell yourself?\"\n3. \"Books?\" (*The most abused question, but I get it. I could start a public library with just trading books I bought over the years*)\n4. \"What is your background?\"\n5. \"What is a normal day for you?\"\n6. \"How did you discover your strategy?\"\n7. \"What did you do/How did you get started?\"\n8. \"What is your % return?\" (Not a fun question since a trading account is not an index or investment account. Intraday traders do not measure performance in %. Most are measured in \"R\".)\n9. \"Is &lt;insert sum of money here&gt; enough to start trading?\"\n10. \"Why do you need so many monitors\"? (This one is rarely asked but I do see it discussed on platforms and people trading on mobile phones love giving flack to anybody who trades on multiple monitors. Hint: Everyone's different. Whatever works for the individual. **There are no rules in trading. The only rule is that it works**.)\n\n&amp;#x200B;\n\n# My story:\n\n**Background:**\n\nI heard about daytrading during the **2008** crash while in high school. We all want to make more while working less. I entertained day trading from time to time but always realized I never had enough money. Horrible mindset because I could have still researched WHILE saving money to put into my trading business.\n\n**2015 -** [I opened my first trading account with Scottrade](https://imgur.com/a/Vxcq07g) while in the Marines. Apparently if you have a net worth of over $1,000,000 you can get out early (Biggest rumor ever).\n\nI frivolously bought crap penny stocks. In short - I was a hair away from gambling. What made it NOT gambling was the fact that at least I owned something tangible (Securities of a company) and anything can happen. Buy low sell high was my strategy. Didn't work obviously. No idea what I was doing. I'd buy and hold hoping to wake up to the stock price being way higher and it never happened.\n\n&amp;#x200B;\n\n•**ProTip #1** : *If you hold a trade overnight... It is not daytrading. Stop turning into an investor because you can't admit a minor defeat.*\n\n&amp;#x200B;\n\n**2017 -** I started taking this business seriously while working in the oilfield as a Logistics Planner (If you're wondering what company since I am asked this from time to time, Google: \"World's largest oilfield services company\").\n\nNo kids, girlfriend/wife or financial obligations. I worked 10AM - 7PM CST and would trade the open from home for roughly 1 hour. Later I was offered to be a Data Analyst... Only downside was... I couldn't trade since I had to be at work now at 8AM CST during the market open. In the moment of signing the offer letter, I was bummed thinking, \"No more trading,\"\n\nThat wasn't the case though. You can still build your trading business with a 9-5 and while never making one trade. The data is there.\n\n&amp;#x200B;\n\n•**ProTip #2 :** *We all see the same data. It's there forever. Many strategies show their edge both live and in hindsight the same. (Especially if you trade patterns). You CAN build your business as a trader without even taking a trade. You CAN build your strategy while working a 9-5. Just because you're not trading, does not mean you can't build your business through research. You won't know how you'll react to the losses but at least you can diagnose the raw data with a large enough sample size for assurance and confidence.*\n\n&amp;#x200B;\n\nIf you have a 9-5 and want to go fulltime into this business. Stay for a bit, save, live so far beneath your means that it is *almost* miserable, (depending on your expenses, area you live, family etc) and get a few hundred sample sizes of your strategy! And for your PTO/days off... trade the open. I sacrificed my vacation days to trade.\n\nAfter **2** years in corporate America, eating cheap food, never going out, saving relentlessly, I made the decision to just do it and resigned. I went straight into the ring of fire known as trading. That was on: **September 23rd, 2019**\n\n*\"&lt;insert a bunch of negative comments from family and friends of how bad of an idea it is to go resign from an easy 9-5.&gt;\"* ^((Sound familiar?))\n\n&amp;#x200B;\n\n**When you hear these types of comments.. your response should be**: *\"Nobody put the time I put into this. The 90%+ who fail, don't have it all written out, computerized backtests, manual backtests, statistics, SOP manuals, JUST like the job I have which is a business, I'm just another cog in their wheel. I'll just be wearing all the hats in my trading business. Instead of Oil&amp;Gas, it's just for trading\"*. One thing I see here a lot is people saying to trade X amount of months/years or make X.\n\n&amp;#x200B;\n\n•**ProTip #3 -** *Think in man hours, not calendar. Example:*\n\n**Trader A** puts in 1 hour of study/work/research everyday for 1 year. (**365** Hours)\n\n**Trader B** puts in 12 hours of work **every day** for 4 months. (\\~**1,450** Hours)\n\n**Trader A** lives in a major city while **Trader B** lives in the middle of nowhere. (Think cost of living)\n\n2 totally different living expenses and 2 different calibers of dedication. I'd put my money on **Trader B** because he put in more man hours. (**\\~1,000 more hours** on the clock to be more exact).\n\n&amp;#x200B;\n\n**ProTip #4** \\- *Have a cushion in your account AND your personal bank account. Having a strategy is great but you won't know entirely if you can fulfill and execute your plan until you experience the ups and downs both short and long term. A strategy is constant over long periods of time... there will be days, weeks, and perhaps a month here and there where you aren't making much money. We hear all the time, \"Trade like a casino\". Casinos don't make money day after day but the odds are in there favor over the long haul.*\n\n&amp;#x200B;\n\n**Month 1 of full time trading was great:**\n\nImmediately after going full time, the first month **(September 2019 to October 2019**), I did super well. Business as usual. No stress. Everything going as planned. No turbulence. At least not like I had ever experienced...\n\n&amp;#x200B;\n\n**The 2 prerequisites I had before resigning was:**\n\n1. Show consistency in returns. Consistent Sharpe Ratio.\n2. [Make a 4 figure trade](https://imgur.com/a/4O35MR2) (I achieved this while short 100 shares on ROKU September 20th, 2019 and even made a victory post if you scroll down my profile's posts.)\n\n&amp;#x200B;\n\n**First life-changing trading lesson learned as a full time trader:**\n\nThat money printing spree ended on **NFLX October 17th, 2019**. Less than 1 month of being a full time trader. Deviating and going against my plan I actually made [$500 in a matter of 4 minutes](https://imgur.com/a/uLB7hsx). If you follow my watchlists on Twitter, **I always trade with the direction of the gap**. If I notate, \"Long Watches\" that means I will only trade it IF (and only IF) I see a long biased pattern. Likewise I will only be looking to short my \"Short Watches\". Plenty of times I'll call out a ticker and it immediately goes the other way. No harm no foul because there was no long biased pattern to confirm my thesis.\n\nOn 10-17-2019, [I went against my plan and it worked..](https://imgur.com/a/OcC8AV7) NFLX gapped up to resistance and I went short when it tanked off of a short pattern.[(This is known as fading)](https://imgur.com/a/9i2cdmi). The market gave me a free lunch and then some. So now I'm walking on air in my mind:\n\n*\"I'm an absolute unit\"*\n\n*\"I'll do it again and clear another $500 to make it a 4 figure day before 9:30AM Central\"*\n\n*\"Should have quit my job way earlier being this good.\"*\n\nWithin 30 minutes of the open. I gave all $500 back. Yes I wanted to trade it back. Never have I had the desire to smash anything but I do understand those who do! Yes I stood there and felt like each passing second was wasted opportunity. **The next 24 hours were long!**\n\n&amp;#x200B;\n\n**ProTip #5:** *It's circumstances like that that help you in the long run. FunFact: I never once deviated from my plan since. Not ever again.*\n\n&amp;#x200B;\n\n\"I could have paid for my groceries and electric for the month after 4 minutes of trading if I just took the free pass the market gave me\" I felt dumb but in hindsight, I'm glad at what happened. It was this exact instance that married me to my strategy/business plan. The next day and the **7** trading days following. I didn't make 1 profiting trade. My longest ever drawdown - **11 straight trades.** While researching I found out this was **Decision Fatigue** (I'll go over this shortly below)\n\n&amp;#x200B;\n\n**Put yourself in that situation...**\n\nYou have bills and your income is strictly trading. I don't care how much a robot you think you are or how strongly you believe in probabilities, when you were in an office less than a month ago making almost 6 figures sitting in an air conditioned office knowing direct deposit is on its way every other Friday no matter how well or poorly you performed at work.. Now you're in the hot seat. Its a bottomless feeling. Now all of your friends and families words are ringing in your head.\n\nBut just like a boxing match.. you gotta take a hit to get a hit. Win some, lose some, shake hands and get back to normal life. Water under the bridge.\n\nMind you:\n\n•No guaranteed direct deposit every 2 weeks.\n\n•No more medical/dental insurance.\n\n•401K retirement is no longer being matched.\n\n&amp;#x200B;\n\n11 trades is nothing. You only require \\~5.5 trades at 2:1RRR to make it back OR 3.5 trades at 3:1RRR. It's nothing especially in your research because [you can easily just scroll a little more and see, \"Oh that's just a drawdown. No big deal\".](https://imgur.com/a/2CYrFhP) How will you react in real time? Will you buckle or choke? But the thing is, I was skipping trades out of fear and JUST so happened to be picking all of the unsuccessful ones. *(Decision Fatigue)*\n\nThink about those 2 weeks of being in a drawdown. Half of the month. You're not just stagnant, your account is bleeding slowly but surely. Next time you're looking at your spreadsheet/backtest/predictive model/research.. try to put yourself in those days of drawdown. **It's not just 11 boxes of red with \"-1R\" or \"Loss\" in them**. The screenshot above on Imgur is just a recent example.\n\nThink about your daily routine, going to the gym, hanging with friends, grocery shopping, cooking, going to bed, waking up, doing a routine, then losing again.. and again.. and again. **Try to think of life during those 300+ hours (Weekends too) of, \"I haven't made money. I've lost money. And I still have bills. After paying them, I'll be closer to my set Risk of Ruin\".**\n\nHere's a lesson you won't learn before going fulltime but I'll do my best to emphasize it here:\n\nPick a strategy. And stick with it. It can literally be anything. Don't spread yourself thin watching 20+ tickers and be a jack of all patterns/tickers. **Be a master of 1 pattern and master of 1 circumstance.** There's this real thing called [\"Decision Fatigue\"](https://imgur.com/a/MhWncCz) which explains exactly why what happened.. happened. The article explains that the 2 outcomes of this mental strain known as **\"Decision Fatigue\"** is:\n\n1. **Risky Decision-Making**\n2. **Decision Avoidance**\n\nSound familiar? Does it kind of make sense now? As a new trader you have YouTube, Facebook, StockTwits, Twitter, \"gurus\", books recommended on Amazon, all throwing their ideas/strategies around, the market has opportunities littered all over.. Decision Fatigue is inevitable for the unprepared. Decision Fatigue happens in every profession. If you mess up at your 9-5, its just a blunder, your paycheck will remain the same. Just a slap on the wrist and move on. With trading, you make a mistake.. it's less food on your table, lights don't stay on, and/or water isn't running. That pressure adds up. **No wonder so many fail...**\n\nThe signs of Decision Fatigue:\n\n•Procrastination.\n\n•Impulsivity.\n\n•Avoidance.\n\n•Indecision.\n\nWhen you find what clicks with you AND its either statistically or performance proven, have the courage to risk a healthy sum of your capital into it. There are strategies/patterns/styles of trading littered all over the internet:\n\nVery broad example:\n\n\"**IF** *circumstance happens* **THEN** *\"Execution\"*. *Stoploss is XYZ*. *Target is XYZ.* **BECAUSE** *over a series of Y trades, I will make $X,XXX.xx\".*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ProTip #6 :** *Strategies are all over the internet. It's your account/money, backtest it. People share their strategies here all the time and although I don't agree with them because I know what works for me, it's something to chew off of for you newer traders. YouTube is a harbor with people who give just enough info to figure their style out.* ***You will lose trades. Sit for some screen-time and pay homage to the edge that you discover. All in due time.***\n\n&amp;#x200B;\n\nInsert key metrics and find correlations. This is how you create checks and balances to create/formulate a black and white trading plan. When I first started doing this, my spreadsheet(s) had so many columns it was annoying and would kill my desire to continue working. You'll find things that are imperative and some that are unimportant. For a lack of more colorful terms: *\"Throw stuff at the wall and see what sticks\"* **Trim the fat. Rinse and repeat.**\n\n&amp;#x200B;\n\n# Here's some things I used to remind myself of and perhaps it'll ring some bells for you:\n\n•**Surrender your capital to your edge**. If you truly accept the risk and trust your **proven** edge, losses don't feel like anything nor do profits. Although we're not here to put on losing trades and yes it does feel nice to profit. I still from time to time will excited when I hit target after a series of multiple profiting trades depending on my mood.\n\n•**If you're nervous** or your heart starts beating quicker when you hear the sound effect of a trade getting entered/filled. Be honest with yourself and ask yourself if you're truly accepting the risk.\n\n•**Things you can't take to the bank:**\n\n1. RRR.\n2. Win-Rate\n3. Number of trades.\n4. \"This one great trade that I hit target in less than 30 seconds and I got filled better than expected\"\n\nAll of these are integral metrics. But you're trading to make money. **It's up or down, green or red, profit or loss, TRUE or FALSE**. So with that said, find what works flawlessly and is easy to follow. Checks and Balances. Then allocate a good sum of risk into it. I read it here all the time, \"Don't risk too much\" and that's great and true for new traders. But don't sell yourself short. Push yourself over the edge and admit that you know your stuff. Think of **Trader A** and **Trader B**. If you've put the time in.. don't sell yourself short. You've built enough courage to learn a business so many fail at. This business has such a negative connotation. But remember that not everybody can handle meritocracies and that's exactly what the market is. Don't try to be the best, just work harder than everyone else and the output of your input will be relative.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ProTip #7:** ***YouTube trading ads from gurus... they're subconsciously making you think you're a novice trader.*** *It's in their marketing. They study marketing psychology. The EASIEST things to sell:*\n\n1. Health\n2. Wealth\n3. Happiness\n\nPeople that are desperate for those things are the most vulnerable and these ~~\"Traders\"~~ marketers are fantastic at portraying all 3 of those things at once.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n•**ProTip #8** (***Broken record alert***) **:** *Write a business plan. Your strategy shouldn't take longer than 4 sentences to explain to another trader. When you have a plan that's proven through a statistic and WAIT for it to happen, you feel* ***100X*** *better taking the trade. You don't even care too much when it results in a loss. Because that was your plan, you accept it much better, and you know it was just an expense for a winning trade.*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWant my strategy? *\"I scan for stocks with a market cap of over 250M, 10k shares premarket, gapping to support or resistance, priced over $10, and I look for a pattern biased to the direction of the overnight gap.* It isn't rocket science. Check my Twitter, look at the dates I posted, and you'll notice the gist. Yes this is an edge but not the entire edge. How fast can you sift through 15 time frames? How long does it take you to fill out your order ticket? Your Fibonacci time extensions with 5 EMA's and Bollinger Bands aren't helping you. They're lagging. If they work for you, great. In my experience, they hindered my visibility.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Pro Tip #9**: *Yes statistics are highly applicable to trading. Patterns* ***do*** *work. All patterns do is tell you WHEN to enter/exit, and how many shares. Humans will never think differently of money. Be the frontrunner of the market's emotions. Nobody remembers the indecisive leader. Risk taking is a commonality amongst leaders. Trading requires courage and it's O.K. to show a bit of confidence as long as you also have the humility  to admit when you're in a bad trade.* ***(Notice how I didn't put, \"wrong\". You're only \"wrong\" when you deviate from a proven strategy.)***\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ProTip #10:** *Risk management is 24/7. I've never heard anyone mention this but think about it a little bit. Having financial obligations can become stressful regardless of how you earn your income but its far more stressful while running a business. Not just any business, but a business where you can go to work on your A-game, do every single last thing right, trade without emotion etc... and still walk away with less money than what you came to work with. Meanwhile somebody who JUST started trading made a 4 figure profit not knowing what the heck the difference between* [ETB, HTB, or NTB](https://imgur.com/a/L0BO9oC)*. Think of it like this, a JV high school baseball player can hit a homerun off of an MLB pitcher once.. but how will he fare at the end of the season? Traders don't predict stock prices, traders predict the outcome over hundreds of trades. People chat me asking what TO do rather than what NOT to do. You don't learn labor intensive jobs or how to fly a plane by what to do.. you learn what NOT to do to stay alive.*\n\n&amp;#x200B;\n\nThat's all I have. Once you have a trading plan underway and you're executing it, you don't have much time when your hobbies are cheap but I still do respond to chats/messages. I do get asked from a previous post when I'll build a website and to answer that: I'm learning how to build a site on rainy days. Can't put a definitive date on it. I will say that its coming, if you don't give up on this business in the next year or so, you'll see it. What I plan on putting on there:\n\n1. RiskReward Calculators\n2. Position size Calculators\n3. EV Calculator\n4. Dictionary with examples\n\nI just don't want some generic WordPress site. I want my website to be stellar and a great resource for aspiring traders. Something I didn't have learning this business. I want it to be something I'd consider a staple in a trader's resources. Perhaps one day it will be referenced on this sub frequently.\n\nFAQ:\n\n1. **\"How do you prepare for a trading day?\"** I get behind the computer about 20 minutes before the bell. Reason being: *\"If you study long. You'll study wrong\"*. If the chart isn't grabbing my attention and gets me excited, then I flick to the next ticker. I don't even know the companies I trade half the time nor do I care about a news report some journalist wrote. Also there is no magic news outlet that lets you know about \"Major events that affect stock prices\". If there was, I wouldn't be here because we're all subscribed to the same edge nor would I be trading my style.\n2. **\"What would you go back to tell yourself?\"** Get more data. Save a little more, your hairline and sleep schedule will thank you. Take only perfect trades and don't feel forced to trade. There will be days you don't touch an order ticket. And days where you are busy and have tunnel vision. Next thing you know its time to shut it down for the day.\n3. **\"Books?\" -** I try to humble myself when answering this but off the cuff, they're all mediocre. Andrew Aziz's was ok, definitely get it, it's only a few bucks on Kindle. Just don't expect it to give you strategies BUT it will give you ideas. If you're brand new, it is good as it will teach you the common vernacular of a day trader. Mark Douglas was interesting but his YouTube seminar recordings are much better. No book, Facebook group, YouTube channel is going to be the end all be all perfect strategy. Expect losses. Don't be a one hitter quitter after suffering a few tiny losses/paper cuts. Stick to it. Most books will help you familiarize yourself with the common vocabulary amongst traders and will hint ideas. It's your job to formulate the strategy and template for research.\n4. **\"What is your background?\"** I was a logistics planner for a major oilfield services company. Later I then became a data/buyer analyst so yes, data analytics/research was a **2nd** language for me entering trading. I did have that upper hand and did shave off months if not years for me.\n5. **\"What is a normal day for you?\"** I'm always done trading after **10:30AM** Central. I will hold onto a trade until right before the bell if it hasn't hit either target or StopLoss by the time I leave the house but it is absolutely closed in entirety by **2:55PM** Central. After I trade, I enjoy the day. No I'm not riding around in my Lambos posting IG/Snapchat (I have neither) stories of my profits with my private jet waiting on a runway trying to sell an **$7** eBook or a **$100** membership (HINT HINT). I grill/cook, read, workout, ride my motorcycle, attack my other sources of income (small businesses I'm building), hit the driving range, shoot guns, etc. I live in Texas. Life is cheap and fun here.\n6. **\"How did you discover your strategy?\"** I bought TradeIdeas premium, went through all of their computerized backtesting patterns, tested them. Then did what I mentioned earlier... Tried to find correlations in metrics. It distilled the trades to a strict criteria and here I am. I post on average 4-5 tickers on my watchlist. 7 max. I do not like spreading my attention thin across multiple tickers. I do not recommend buying TradeIdeas, it does have lots of bugs.\n7. **\"What did you do/How did you get started?\"** Was a data analyst, was good at research and applied it to trading. My incentive was, \"I could have made more money trading rather than sitting in 2+ hours of roundtrip traffic and 9 hours in an office. The data is there. Everybody sees the same charts all over the world. There are ways to make this possible\"\n8. **\"What is your % return?\"** *(Not a fun question since a trading account is not an index or investment account. Intraday traders do not measure performance in %)* I trade to make money AND pay myself, so my equity curve will look like a small loss or small gain after I pay myself. **% return?** I measure my account's performance in [Sharpe Ratio](https://imgur.com/a/3ZWOpx0) and Risk Units. My Sharpe Ratio is **\\~1.85**. While I yield roughly **.8 - 1 R** per trading day. Some weeks I make **10R**. Some weeks **I lose 2R**. Yeah one week I might make $2,500. But the next week I might lose $300. The following week my strategy will yield $0 and the last week I might make $1,000. Some weeks suck. Some weeks are great. But overall. Just shy of 1R per trading day. Some days I'm super busy taking trade after trade. Some days I'll shut it down after 5 minutes without even filling out an order ticket. Some days I won't even see the open because there is no edge for me.. **Keywords... \"For me\".**\n9. **\"Is &lt;insert sum of money here&gt; enough to start trading?\"** Depends on where you live. Are you restricted to PDT? If not then how much are you obligated to expenses? **I live in Texas. Things are cheap here.** If you live in NYC or The Bay Area your expenses will be astronomical compared to mine. **A $30,000 account is totally doable for a single Texan with low monthly expenses.** Now if you're in California or New York? I'm sure you'll fall below 25k if you have 1 bad month. Also depends on if you have other sources of income or a full/part time job. I encourage every trader and aspiring trader to have multiple sources of income, don't rely solely on trading. Not just for the sake of mitigating pressure but also for sanity. If you have a family to provide for, I don't know what that's like, you never know when Little Johnny is going to randomly pick up Trombone lessons for a school program/play while little Suzie needs transmission work in her car because a simple solenoid went out. $1,700 later.\n10. **\"Why do you need so many monitors?\"** **I use 3 for trading**. The 4th is for music. The other 2 are useless while trading. That's for trading though. When I made the decision to go full time, I knew I was about to go off the chain with research. And sifting between spreadsheets, a platform to see multiple timeframes for a pattern to backtest. My attention span is short, I'll lose my train of thought before I open the other tab to input data. But the main reason was for research. It's such a time saver and is a headache repellant when doing research while everything is laid out in front of you. Now that I have a system. I'll most likely be treating myself to 2 ultrawides for Christmas.\n\nAs always, thank you to everybody who takes time out to message me and letting me know some people read these and show appreciation. I would say, \"Good luck\" but there is no luck in trading. Just statistics. Remember that!\n\n**In conclusion:** Yes. Full time trading is possible, depending where you live/monthly expenses and obligations. You're more likely to become a profitable trader than a professional athlete. There is a level of uncertainty each day, perhaps each week, doubtful each month, and definitely not each year. If I ever want a raise, I just consult my business plan and financials, then decide if I can handle it mentally. If you have medical issues, get a part time job for the benefits. If you're healthy, just be careful.\n\n&amp;#x200B;\n\nAll the best!\n\n\\-CJT2013",
                    "author_fullname": "t2_dk7xu88",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 4,
                    "clicked": false,
                    "title": "My 1 Year Anniversary of Full Time Day Trading. 3 Years In The Business. What I Wish I Could Tell Myself Years Ago.",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_j3zlqi",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.99,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1579,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": "b2b343ae-b2af-11e9-ae64-0e9bd2c0a03a",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1579,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1617175802.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [
                        {
                            "e": "text",
                            "t": "mod"
                        }
                    ],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1601661875.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "richtext",
                    "domain": "self.Daytrading",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Part 1: &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/\"&gt;https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Part 3: &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/\"&gt;https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;This industry has a lack of transparency so I&amp;#39;m more than happy to say I will provide lots of that throughout this post with screenshots. There are LOTS of imgur links to back what I say so it&amp;#39;s not just words on a post expecting you to just believe what I&amp;#39;m typing.&lt;/p&gt;\n\n&lt;p&gt;This post I suppose is &amp;quot;Part 2&amp;quot; my post back in April, &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/\"&gt;&amp;quot;After 2 years of Daytrading. 7 months full time. Here&amp;#39;s my advice&amp;quot;&lt;/a&gt;. I&amp;#39;m doing this to update everyone who came/comes across this in the future. Yes, it is possible. No, it won&amp;#39;t be easy. You will pay homage to the rite of passage into this career. I&amp;#39;ll also provide some examples of styles of trading so for the newer aspiring traders, there will be some things I rarely see discussed on forums. So here&amp;#39;s to 1 year of &lt;a href=\"https://imgur.com/a/wG4UQBO\"&gt;Full Time Day Trading&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; - You&amp;#39;ll become desensitized to trading. Stubborn to other strategies (There are bigger/badder/more lucrative strategies. Don&amp;#39;t chase them. Why fix what&amp;#39;s not broken? I know what works for me and I&amp;#39;m content with it. No strategy is better than another. It&amp;#39;s a personal choice. ). Losing individual trades won&amp;#39;t faze you, they&amp;#39;re inevitable. Profiting certainly feels better. After a while, you won&amp;#39;t be as enthralled to trade every morning, it&amp;#39;ll become just another part of your day). Trading is just managing your money through a statistic and the medium to execute it is trading on your platform. &lt;strong&gt;Think: &amp;quot;If. Then. Because&amp;quot;.&lt;/strong&gt; Your trading plan should be that black and white. &lt;strong&gt;Ask &amp;quot;Why&amp;quot; for everything you do and use. If you can&amp;#39;t answer it with documented results, drop it.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;del&gt;I get a bunch of messages all the time from people asking -&lt;/del&gt; . &lt;a href=\"https://imgur.com/a/W58BFbe\"&gt;Out of those who follow&lt;/a&gt; me and &lt;a href=\"https://imgur.com/a/3DUYbwg\"&gt;chat me seeking further tips&lt;/a&gt; through my previous posts. I&amp;#39;ll be answering the FAQ&amp;#39;s and addressing things I see frequently in this sub as far as trading axioms&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;: I won&amp;#39;t sugarcoat anything. I&amp;#39;ll share my experiences and add pieces of advice I&amp;#39;d give to those who are currently experiencing the same thing becoming a full time day trader and what day to day life is like, the occasional distress, (&lt;em&gt;DRAWDOWNS&lt;/em&gt;). Some of you follow my Twitter for the past few months where I post my daily watchlists with a snippet that reveals my DayTradingBuyingPower. I do this not to brag but to demonstrate that the account does yield growth, I pay myself, and there are days where the balance does not move because there was no edge. I also do this since nobody else shows their account performance. (Yes. You, Mr. YouTube gurus and wannabe gurus).&lt;/p&gt;\n\n&lt;p&gt;We do this for income, the numbers on our accounts are real. Treat it as such. Get your initial capital out of your account THEN try to &amp;quot;&lt;em&gt;Scale your account&lt;/em&gt;&amp;quot; with your profits &lt;strong&gt;AKA The Market&amp;#39;s Money.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I&amp;#39;ll go over:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;•FAQ&amp;#39;s that I get in my inbox &lt;em&gt;(I&amp;#39;m still welcome to further questions if I don&amp;#39;t answer here)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;•Decision Fatigue &lt;em&gt;(You will experience this)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;•The previous year (2019-2020) of ups and downs&lt;/p&gt;\n\n&lt;p&gt;•How to use my watchlists that I post on Twitter in the morning to your advantage&lt;/p&gt;\n\n&lt;p&gt;•The pivotal moment that changed my trading career &lt;em&gt;(NFLX 10-17-19)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;•The road to becoming a full time trader. &lt;em&gt;(It won&amp;#39;t be fun unless you&amp;#39;re handed the money)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;•You&amp;#39;ll have a better grasp of my strategy (Between ProTip 4 and 5. ProTip 8.)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;There are 10 &amp;quot;ProTips&amp;quot; throughout the post that I wish I could tell myself years back&lt;/strong&gt; and I&amp;#39;ll periodically throw them in here as the post goes on. I make posts long in order to segregate those serious about this business and those who will just become another statistic in the failure rate of this business.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;At the end of this post, I&amp;#39;ll go over the frequent questions I receive such as&lt;/strong&gt;: (Answers to FAQ at bottom of post.)&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&amp;quot;How do you prepare for a trading day?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;What would you go back to tell yourself?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;Books?&amp;quot; (&lt;em&gt;The most abused question, but I get it. I could start a public library with just trading books I bought over the years&lt;/em&gt;)&lt;/li&gt;\n&lt;li&gt;&amp;quot;What is your background?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;What is a normal day for you?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;How did you discover your strategy?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;What did you do/How did you get started?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;What is your % return?&amp;quot; (Not a fun question since a trading account is not an index or investment account. Intraday traders do not measure performance in %. Most are measured in &amp;quot;R&amp;quot;.)&lt;/li&gt;\n&lt;li&gt;&amp;quot;Is &amp;lt;insert sum of money here&amp;gt; enough to start trading?&amp;quot;&lt;/li&gt;\n&lt;li&gt;&amp;quot;Why do you need so many monitors&amp;quot;? (This one is rarely asked but I do see it discussed on platforms and people trading on mobile phones love giving flack to anybody who trades on multiple monitors. Hint: Everyone&amp;#39;s different. Whatever works for the individual. &lt;strong&gt;There are no rules in trading. The only rule is that it works&lt;/strong&gt;.)&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;My story:&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Background:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I heard about daytrading during the &lt;strong&gt;2008&lt;/strong&gt; crash while in high school. We all want to make more while working less. I entertained day trading from time to time but always realized I never had enough money. Horrible mindset because I could have still researched WHILE saving money to put into my trading business.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2015 -&lt;/strong&gt; &lt;a href=\"https://imgur.com/a/Vxcq07g\"&gt;I opened my first trading account with Scottrade&lt;/a&gt; while in the Marines. Apparently if you have a net worth of over $1,000,000 you can get out early (Biggest rumor ever).&lt;/p&gt;\n\n&lt;p&gt;I frivolously bought crap penny stocks. In short - I was a hair away from gambling. What made it NOT gambling was the fact that at least I owned something tangible (Securities of a company) and anything can happen. Buy low sell high was my strategy. Didn&amp;#39;t work obviously. No idea what I was doing. I&amp;#39;d buy and hold hoping to wake up to the stock price being way higher and it never happened.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;ProTip #1&lt;/strong&gt; : &lt;em&gt;If you hold a trade overnight... It is not daytrading. Stop turning into an investor because you can&amp;#39;t admit a minor defeat.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2017 -&lt;/strong&gt; I started taking this business seriously while working in the oilfield as a Logistics Planner (If you&amp;#39;re wondering what company since I am asked this from time to time, Google: &amp;quot;World&amp;#39;s largest oilfield services company&amp;quot;).&lt;/p&gt;\n\n&lt;p&gt;No kids, girlfriend/wife or financial obligations. I worked 10AM - 7PM CST and would trade the open from home for roughly 1 hour. Later I was offered to be a Data Analyst... Only downside was... I couldn&amp;#39;t trade since I had to be at work now at 8AM CST during the market open. In the moment of signing the offer letter, I was bummed thinking, &amp;quot;No more trading,&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That wasn&amp;#39;t the case though. You can still build your trading business with a 9-5 and while never making one trade. The data is there.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;ProTip #2 :&lt;/strong&gt; &lt;em&gt;We all see the same data. It&amp;#39;s there forever. Many strategies show their edge both live and in hindsight the same. (Especially if you trade patterns). You CAN build your business as a trader without even taking a trade. You CAN build your strategy while working a 9-5. Just because you&amp;#39;re not trading, does not mean you can&amp;#39;t build your business through research. You won&amp;#39;t know how you&amp;#39;ll react to the losses but at least you can diagnose the raw data with a large enough sample size for assurance and confidence.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;If you have a 9-5 and want to go fulltime into this business. Stay for a bit, save, live so far beneath your means that it is &lt;em&gt;almost&lt;/em&gt; miserable, (depending on your expenses, area you live, family etc) and get a few hundred sample sizes of your strategy! And for your PTO/days off... trade the open. I sacrificed my vacation days to trade.&lt;/p&gt;\n\n&lt;p&gt;After &lt;strong&gt;2&lt;/strong&gt; years in corporate America, eating cheap food, never going out, saving relentlessly, I made the decision to just do it and resigned. I went straight into the ring of fire known as trading. That was on: &lt;strong&gt;September 23rd, 2019&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;&amp;lt;insert a bunch of negative comments from family and friends of how bad of an idea it is to go resign from an easy 9-5.&amp;gt;&amp;quot;&lt;/em&gt; &lt;sup&gt;(Sound familiar?&lt;/sup&gt;)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;When you hear these types of comments.. your response should be&lt;/strong&gt;: &lt;em&gt;&amp;quot;Nobody put the time I put into this. The 90%+ who fail, don&amp;#39;t have it all written out, computerized backtests, manual backtests, statistics, SOP manuals, JUST like the job I have which is a business, I&amp;#39;m just another cog in their wheel. I&amp;#39;ll just be wearing all the hats in my trading business. Instead of Oil&amp;amp;Gas, it&amp;#39;s just for trading&amp;quot;&lt;/em&gt;. One thing I see here a lot is people saying to trade X amount of months/years or make X.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;ProTip #3 -&lt;/strong&gt; &lt;em&gt;Think in man hours, not calendar. Example:&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Trader A&lt;/strong&gt; puts in 1 hour of study/work/research everyday for 1 year. (&lt;strong&gt;365&lt;/strong&gt; Hours)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Trader B&lt;/strong&gt; puts in 12 hours of work &lt;strong&gt;every day&lt;/strong&gt; for 4 months. (~&lt;strong&gt;1,450&lt;/strong&gt; Hours)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Trader A&lt;/strong&gt; lives in a major city while &lt;strong&gt;Trader B&lt;/strong&gt; lives in the middle of nowhere. (Think cost of living)&lt;/p&gt;\n\n&lt;p&gt;2 totally different living expenses and 2 different calibers of dedication. I&amp;#39;d put my money on &lt;strong&gt;Trader B&lt;/strong&gt; because he put in more man hours. (&lt;strong&gt;~1,000 more hours&lt;/strong&gt; on the clock to be more exact).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ProTip #4&lt;/strong&gt; - &lt;em&gt;Have a cushion in your account AND your personal bank account. Having a strategy is great but you won&amp;#39;t know entirely if you can fulfill and execute your plan until you experience the ups and downs both short and long term. A strategy is constant over long periods of time... there will be days, weeks, and perhaps a month here and there where you aren&amp;#39;t making much money. We hear all the time, &amp;quot;Trade like a casino&amp;quot;. Casinos don&amp;#39;t make money day after day but the odds are in there favor over the long haul.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Month 1 of full time trading was great:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Immediately after going full time, the first month &lt;strong&gt;(September 2019 to October 2019&lt;/strong&gt;), I did super well. Business as usual. No stress. Everything going as planned. No turbulence. At least not like I had ever experienced...&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The 2 prerequisites I had before resigning was:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Show consistency in returns. Consistent Sharpe Ratio.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://imgur.com/a/4O35MR2\"&gt;Make a 4 figure trade&lt;/a&gt; (I achieved this while short 100 shares on ROKU September 20th, 2019 and even made a victory post if you scroll down my profile&amp;#39;s posts.)&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;First life-changing trading lesson learned as a full time trader:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;That money printing spree ended on &lt;strong&gt;NFLX October 17th, 2019&lt;/strong&gt;. Less than 1 month of being a full time trader. Deviating and going against my plan I actually made &lt;a href=\"https://imgur.com/a/uLB7hsx\"&gt;$500 in a matter of 4 minutes&lt;/a&gt;. If you follow my watchlists on Twitter, &lt;strong&gt;I always trade with the direction of the gap&lt;/strong&gt;. If I notate, &amp;quot;Long Watches&amp;quot; that means I will only trade it IF (and only IF) I see a long biased pattern. Likewise I will only be looking to short my &amp;quot;Short Watches&amp;quot;. Plenty of times I&amp;#39;ll call out a ticker and it immediately goes the other way. No harm no foul because there was no long biased pattern to confirm my thesis.&lt;/p&gt;\n\n&lt;p&gt;On 10-17-2019, &lt;a href=\"https://imgur.com/a/OcC8AV7\"&gt;I went against my plan and it worked..&lt;/a&gt; NFLX gapped up to resistance and I went short when it tanked off of a short pattern.&lt;a href=\"https://imgur.com/a/9i2cdmi\"&gt;(This is known as fading)&lt;/a&gt;. The market gave me a free lunch and then some. So now I&amp;#39;m walking on air in my mind:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;I&amp;#39;m an absolute unit&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;I&amp;#39;ll do it again and clear another $500 to make it a 4 figure day before 9:30AM Central&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Should have quit my job way earlier being this good.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Within 30 minutes of the open. I gave all $500 back. Yes I wanted to trade it back. Never have I had the desire to smash anything but I do understand those who do! Yes I stood there and felt like each passing second was wasted opportunity. &lt;strong&gt;The next 24 hours were long!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ProTip #5:&lt;/strong&gt; &lt;em&gt;It&amp;#39;s circumstances like that that help you in the long run. FunFact: I never once deviated from my plan since. Not ever again.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I could have paid for my groceries and electric for the month after 4 minutes of trading if I just took the free pass the market gave me&amp;quot; I felt dumb but in hindsight, I&amp;#39;m glad at what happened. It was this exact instance that married me to my strategy/business plan. The next day and the &lt;strong&gt;7&lt;/strong&gt; trading days following. I didn&amp;#39;t make 1 profiting trade. My longest ever drawdown - &lt;strong&gt;11 straight trades.&lt;/strong&gt; While researching I found out this was &lt;strong&gt;Decision Fatigue&lt;/strong&gt; (I&amp;#39;ll go over this shortly below)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Put yourself in that situation...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You have bills and your income is strictly trading. I don&amp;#39;t care how much a robot you think you are or how strongly you believe in probabilities, when you were in an office less than a month ago making almost 6 figures sitting in an air conditioned office knowing direct deposit is on its way every other Friday no matter how well or poorly you performed at work.. Now you&amp;#39;re in the hot seat. Its a bottomless feeling. Now all of your friends and families words are ringing in your head.&lt;/p&gt;\n\n&lt;p&gt;But just like a boxing match.. you gotta take a hit to get a hit. Win some, lose some, shake hands and get back to normal life. Water under the bridge.&lt;/p&gt;\n\n&lt;p&gt;Mind you:&lt;/p&gt;\n\n&lt;p&gt;•No guaranteed direct deposit every 2 weeks.&lt;/p&gt;\n\n&lt;p&gt;•No more medical/dental insurance.&lt;/p&gt;\n\n&lt;p&gt;•401K retirement is no longer being matched.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;11 trades is nothing. You only require ~5.5 trades at 2:1RRR to make it back OR 3.5 trades at 3:1RRR. It&amp;#39;s nothing especially in your research because &lt;a href=\"https://imgur.com/a/2CYrFhP\"&gt;you can easily just scroll a little more and see, &amp;quot;Oh that&amp;#39;s just a drawdown. No big deal&amp;quot;.&lt;/a&gt; How will you react in real time? Will you buckle or choke? But the thing is, I was skipping trades out of fear and JUST so happened to be picking all of the unsuccessful ones. &lt;em&gt;(Decision Fatigue)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Think about those 2 weeks of being in a drawdown. Half of the month. You&amp;#39;re not just stagnant, your account is bleeding slowly but surely. Next time you&amp;#39;re looking at your spreadsheet/backtest/predictive model/research.. try to put yourself in those days of drawdown. &lt;strong&gt;It&amp;#39;s not just 11 boxes of red with &amp;quot;-1R&amp;quot; or &amp;quot;Loss&amp;quot; in them&lt;/strong&gt;. The screenshot above on Imgur is just a recent example.&lt;/p&gt;\n\n&lt;p&gt;Think about your daily routine, going to the gym, hanging with friends, grocery shopping, cooking, going to bed, waking up, doing a routine, then losing again.. and again.. and again. &lt;strong&gt;Try to think of life during those 300+ hours (Weekends too) of, &amp;quot;I haven&amp;#39;t made money. I&amp;#39;ve lost money. And I still have bills. After paying them, I&amp;#39;ll be closer to my set Risk of Ruin&amp;quot;.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a lesson you won&amp;#39;t learn before going fulltime but I&amp;#39;ll do my best to emphasize it here:&lt;/p&gt;\n\n&lt;p&gt;Pick a strategy. And stick with it. It can literally be anything. Don&amp;#39;t spread yourself thin watching 20+ tickers and be a jack of all patterns/tickers. &lt;strong&gt;Be a master of 1 pattern and master of 1 circumstance.&lt;/strong&gt; There&amp;#39;s this real thing called &lt;a href=\"https://imgur.com/a/MhWncCz\"&gt;&amp;quot;Decision Fatigue&amp;quot;&lt;/a&gt; which explains exactly why what happened.. happened. The article explains that the 2 outcomes of this mental strain known as &lt;strong&gt;&amp;quot;Decision Fatigue&amp;quot;&lt;/strong&gt; is:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Risky Decision-Making&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Decision Avoidance&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Sound familiar? Does it kind of make sense now? As a new trader you have YouTube, Facebook, StockTwits, Twitter, &amp;quot;gurus&amp;quot;, books recommended on Amazon, all throwing their ideas/strategies around, the market has opportunities littered all over.. Decision Fatigue is inevitable for the unprepared. Decision Fatigue happens in every profession. If you mess up at your 9-5, its just a blunder, your paycheck will remain the same. Just a slap on the wrist and move on. With trading, you make a mistake.. it&amp;#39;s less food on your table, lights don&amp;#39;t stay on, and/or water isn&amp;#39;t running. That pressure adds up. &lt;strong&gt;No wonder so many fail...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The signs of Decision Fatigue:&lt;/p&gt;\n\n&lt;p&gt;•Procrastination.&lt;/p&gt;\n\n&lt;p&gt;•Impulsivity.&lt;/p&gt;\n\n&lt;p&gt;•Avoidance.&lt;/p&gt;\n\n&lt;p&gt;•Indecision.&lt;/p&gt;\n\n&lt;p&gt;When you find what clicks with you AND its either statistically or performance proven, have the courage to risk a healthy sum of your capital into it. There are strategies/patterns/styles of trading littered all over the internet:&lt;/p&gt;\n\n&lt;p&gt;Very broad example:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;strong&gt;IF&lt;/strong&gt; &lt;em&gt;circumstance happens&lt;/em&gt; &lt;strong&gt;THEN&lt;/strong&gt; &lt;em&gt;&amp;quot;Execution&amp;quot;&lt;/em&gt;. &lt;em&gt;Stoploss is XYZ&lt;/em&gt;. &lt;em&gt;Target is XYZ.&lt;/em&gt; &lt;strong&gt;BECAUSE&lt;/strong&gt; &lt;em&gt;over a series of Y trades, I will make $X,XXX.xx&amp;quot;.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ProTip #6 :&lt;/strong&gt; &lt;em&gt;Strategies are all over the internet. It&amp;#39;s your account/money, backtest it. People share their strategies here all the time and although I don&amp;#39;t agree with them because I know what works for me, it&amp;#39;s something to chew off of for you newer traders. YouTube is a harbor with people who give just enough info to figure their style out.&lt;/em&gt; &lt;strong&gt;&lt;em&gt;You will lose trades. Sit for some screen-time and pay homage to the edge that you discover. All in due time.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Insert key metrics and find correlations. This is how you create checks and balances to create/formulate a black and white trading plan. When I first started doing this, my spreadsheet(s) had so many columns it was annoying and would kill my desire to continue working. You&amp;#39;ll find things that are imperative and some that are unimportant. For a lack of more colorful terms: &lt;em&gt;&amp;quot;Throw stuff at the wall and see what sticks&amp;quot;&lt;/em&gt; &lt;strong&gt;Trim the fat. Rinse and repeat.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Here&amp;#39;s some things I used to remind myself of and perhaps it&amp;#39;ll ring some bells for you:&lt;/h1&gt;\n\n&lt;p&gt;•&lt;strong&gt;Surrender your capital to your edge&lt;/strong&gt;. If you truly accept the risk and trust your &lt;strong&gt;proven&lt;/strong&gt; edge, losses don&amp;#39;t feel like anything nor do profits. Although we&amp;#39;re not here to put on losing trades and yes it does feel nice to profit. I still from time to time will excited when I hit target after a series of multiple profiting trades depending on my mood.&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;If you&amp;#39;re nervous&lt;/strong&gt; or your heart starts beating quicker when you hear the sound effect of a trade getting entered/filled. Be honest with yourself and ask yourself if you&amp;#39;re truly accepting the risk.&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;Things you can&amp;#39;t take to the bank:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;RRR.&lt;/li&gt;\n&lt;li&gt;Win-Rate&lt;/li&gt;\n&lt;li&gt;Number of trades.&lt;/li&gt;\n&lt;li&gt;&amp;quot;This one great trade that I hit target in less than 30 seconds and I got filled better than expected&amp;quot;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;All of these are integral metrics. But you&amp;#39;re trading to make money. &lt;strong&gt;It&amp;#39;s up or down, green or red, profit or loss, TRUE or FALSE&lt;/strong&gt;. So with that said, find what works flawlessly and is easy to follow. Checks and Balances. Then allocate a good sum of risk into it. I read it here all the time, &amp;quot;Don&amp;#39;t risk too much&amp;quot; and that&amp;#39;s great and true for new traders. But don&amp;#39;t sell yourself short. Push yourself over the edge and admit that you know your stuff. Think of &lt;strong&gt;Trader A&lt;/strong&gt; and &lt;strong&gt;Trader B&lt;/strong&gt;. If you&amp;#39;ve put the time in.. don&amp;#39;t sell yourself short. You&amp;#39;ve built enough courage to learn a business so many fail at. This business has such a negative connotation. But remember that not everybody can handle meritocracies and that&amp;#39;s exactly what the market is. Don&amp;#39;t try to be the best, just work harder than everyone else and the output of your input will be relative.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ProTip #7:&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;YouTube trading ads from gurus... they&amp;#39;re subconsciously making you think you&amp;#39;re a novice trader.&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;It&amp;#39;s in their marketing. They study marketing psychology. The EASIEST things to sell:&lt;/em&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Health&lt;/li&gt;\n&lt;li&gt;Wealth&lt;/li&gt;\n&lt;li&gt;Happiness&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;People that are desperate for those things are the most vulnerable and these &lt;del&gt;&amp;quot;Traders&amp;quot;&lt;/del&gt; marketers are fantastic at portraying all 3 of those things at once.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;ProTip #8&lt;/strong&gt; (&lt;strong&gt;&lt;em&gt;Broken record alert&lt;/em&gt;&lt;/strong&gt;) &lt;strong&gt;:&lt;/strong&gt; &lt;em&gt;Write a business plan. Your strategy shouldn&amp;#39;t take longer than 4 sentences to explain to another trader. When you have a plan that&amp;#39;s proven through a statistic and WAIT for it to happen, you feel&lt;/em&gt; &lt;strong&gt;&lt;em&gt;100X&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;better taking the trade. You don&amp;#39;t even care too much when it results in a loss. Because that was your plan, you accept it much better, and you know it was just an expense for a winning trade.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Want my strategy? &lt;em&gt;&amp;quot;I scan for stocks with a market cap of over 250M, 10k shares premarket, gapping to support or resistance, priced over $10, and I look for a pattern biased to the direction of the overnight gap.&lt;/em&gt; It isn&amp;#39;t rocket science. Check my Twitter, look at the dates I posted, and you&amp;#39;ll notice the gist. Yes this is an edge but not the entire edge. How fast can you sift through 15 time frames? How long does it take you to fill out your order ticket? Your Fibonacci time extensions with 5 EMA&amp;#39;s and Bollinger Bands aren&amp;#39;t helping you. They&amp;#39;re lagging. If they work for you, great. In my experience, they hindered my visibility.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Pro Tip #9&lt;/strong&gt;: &lt;em&gt;Yes statistics are highly applicable to trading. Patterns&lt;/em&gt; &lt;strong&gt;&lt;em&gt;do&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;work. All patterns do is tell you WHEN to enter/exit, and how many shares. Humans will never think differently of money. Be the frontrunner of the market&amp;#39;s emotions. Nobody remembers the indecisive leader. Risk taking is a commonality amongst leaders. Trading requires courage and it&amp;#39;s O.K. to show a bit of confidence as long as you also have the humility  to admit when you&amp;#39;re in a bad trade.&lt;/em&gt; &lt;strong&gt;&lt;em&gt;(Notice how I didn&amp;#39;t put, &amp;quot;wrong&amp;quot;. You&amp;#39;re only &amp;quot;wrong&amp;quot; when you deviate from a proven strategy.)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ProTip #10:&lt;/strong&gt; &lt;em&gt;Risk management is 24/7. I&amp;#39;ve never heard anyone mention this but think about it a little bit. Having financial obligations can become stressful regardless of how you earn your income but its far more stressful while running a business. Not just any business, but a business where you can go to work on your A-game, do every single last thing right, trade without emotion etc... and still walk away with less money than what you came to work with. Meanwhile somebody who JUST started trading made a 4 figure profit not knowing what the heck the difference between&lt;/em&gt; &lt;a href=\"https://imgur.com/a/L0BO9oC\"&gt;ETB, HTB, or NTB&lt;/a&gt;&lt;em&gt;. Think of it like this, a JV high school baseball player can hit a homerun off of an MLB pitcher once.. but how will he fare at the end of the season? Traders don&amp;#39;t predict stock prices, traders predict the outcome over hundreds of trades. People chat me asking what TO do rather than what NOT to do. You don&amp;#39;t learn labor intensive jobs or how to fly a plane by what to do.. you learn what NOT to do to stay alive.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all I have. Once you have a trading plan underway and you&amp;#39;re executing it, you don&amp;#39;t have much time when your hobbies are cheap but I still do respond to chats/messages. I do get asked from a previous post when I&amp;#39;ll build a website and to answer that: I&amp;#39;m learning how to build a site on rainy days. Can&amp;#39;t put a definitive date on it. I will say that its coming, if you don&amp;#39;t give up on this business in the next year or so, you&amp;#39;ll see it. What I plan on putting on there:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;RiskReward Calculators&lt;/li&gt;\n&lt;li&gt;Position size Calculators&lt;/li&gt;\n&lt;li&gt;EV Calculator&lt;/li&gt;\n&lt;li&gt;Dictionary with examples&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I just don&amp;#39;t want some generic WordPress site. I want my website to be stellar and a great resource for aspiring traders. Something I didn&amp;#39;t have learning this business. I want it to be something I&amp;#39;d consider a staple in a trader&amp;#39;s resources. Perhaps one day it will be referenced on this sub frequently.&lt;/p&gt;\n\n&lt;p&gt;FAQ:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;How do you prepare for a trading day?&amp;quot;&lt;/strong&gt; I get behind the computer about 20 minutes before the bell. Reason being: &lt;em&gt;&amp;quot;If you study long. You&amp;#39;ll study wrong&amp;quot;&lt;/em&gt;. If the chart isn&amp;#39;t grabbing my attention and gets me excited, then I flick to the next ticker. I don&amp;#39;t even know the companies I trade half the time nor do I care about a news report some journalist wrote. Also there is no magic news outlet that lets you know about &amp;quot;Major events that affect stock prices&amp;quot;. If there was, I wouldn&amp;#39;t be here because we&amp;#39;re all subscribed to the same edge nor would I be trading my style.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;What would you go back to tell yourself?&amp;quot;&lt;/strong&gt; Get more data. Save a little more, your hairline and sleep schedule will thank you. Take only perfect trades and don&amp;#39;t feel forced to trade. There will be days you don&amp;#39;t touch an order ticket. And days where you are busy and have tunnel vision. Next thing you know its time to shut it down for the day.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;Books?&amp;quot; -&lt;/strong&gt; I try to humble myself when answering this but off the cuff, they&amp;#39;re all mediocre. Andrew Aziz&amp;#39;s was ok, definitely get it, it&amp;#39;s only a few bucks on Kindle. Just don&amp;#39;t expect it to give you strategies BUT it will give you ideas. If you&amp;#39;re brand new, it is good as it will teach you the common vernacular of a day trader. Mark Douglas was interesting but his YouTube seminar recordings are much better. No book, Facebook group, YouTube channel is going to be the end all be all perfect strategy. Expect losses. Don&amp;#39;t be a one hitter quitter after suffering a few tiny losses/paper cuts. Stick to it. Most books will help you familiarize yourself with the common vocabulary amongst traders and will hint ideas. It&amp;#39;s your job to formulate the strategy and template for research.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;What is your background?&amp;quot;&lt;/strong&gt; I was a logistics planner for a major oilfield services company. Later I then became a data/buyer analyst so yes, data analytics/research was a &lt;strong&gt;2nd&lt;/strong&gt; language for me entering trading. I did have that upper hand and did shave off months if not years for me.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;What is a normal day for you?&amp;quot;&lt;/strong&gt; I&amp;#39;m always done trading after &lt;strong&gt;10:30AM&lt;/strong&gt; Central. I will hold onto a trade until right before the bell if it hasn&amp;#39;t hit either target or StopLoss by the time I leave the house but it is absolutely closed in entirety by &lt;strong&gt;2:55PM&lt;/strong&gt; Central. After I trade, I enjoy the day. No I&amp;#39;m not riding around in my Lambos posting IG/Snapchat (I have neither) stories of my profits with my private jet waiting on a runway trying to sell an &lt;strong&gt;$7&lt;/strong&gt; eBook or a &lt;strong&gt;$100&lt;/strong&gt; membership (HINT HINT). I grill/cook, read, workout, ride my motorcycle, attack my other sources of income (small businesses I&amp;#39;m building), hit the driving range, shoot guns, etc. I live in Texas. Life is cheap and fun here.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;How did you discover your strategy?&amp;quot;&lt;/strong&gt; I bought TradeIdeas premium, went through all of their computerized backtesting patterns, tested them. Then did what I mentioned earlier... Tried to find correlations in metrics. It distilled the trades to a strict criteria and here I am. I post on average 4-5 tickers on my watchlist. 7 max. I do not like spreading my attention thin across multiple tickers. I do not recommend buying TradeIdeas, it does have lots of bugs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;What did you do/How did you get started?&amp;quot;&lt;/strong&gt; Was a data analyst, was good at research and applied it to trading. My incentive was, &amp;quot;I could have made more money trading rather than sitting in 2+ hours of roundtrip traffic and 9 hours in an office. The data is there. Everybody sees the same charts all over the world. There are ways to make this possible&amp;quot;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;What is your % return?&amp;quot;&lt;/strong&gt; &lt;em&gt;(Not a fun question since a trading account is not an index or investment account. Intraday traders do not measure performance in %)&lt;/em&gt; I trade to make money AND pay myself, so my equity curve will look like a small loss or small gain after I pay myself. &lt;strong&gt;% return?&lt;/strong&gt; I measure my account&amp;#39;s performance in &lt;a href=\"https://imgur.com/a/3ZWOpx0\"&gt;Sharpe Ratio&lt;/a&gt; and Risk Units. My Sharpe Ratio is &lt;strong&gt;~1.85&lt;/strong&gt;. While I yield roughly &lt;strong&gt;.8 - 1 R&lt;/strong&gt; per trading day. Some weeks I make &lt;strong&gt;10R&lt;/strong&gt;. Some weeks &lt;strong&gt;I lose 2R&lt;/strong&gt;. Yeah one week I might make $2,500. But the next week I might lose $300. The following week my strategy will yield $0 and the last week I might make $1,000. Some weeks suck. Some weeks are great. But overall. Just shy of 1R per trading day. Some days I&amp;#39;m super busy taking trade after trade. Some days I&amp;#39;ll shut it down after 5 minutes without even filling out an order ticket. Some days I won&amp;#39;t even see the open because there is no edge for me.. &lt;strong&gt;Keywords... &amp;quot;For me&amp;quot;.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;Is &amp;lt;insert sum of money here&amp;gt; enough to start trading?&amp;quot;&lt;/strong&gt; Depends on where you live. Are you restricted to PDT? If not then how much are you obligated to expenses? &lt;strong&gt;I live in Texas. Things are cheap here.&lt;/strong&gt; If you live in NYC or The Bay Area your expenses will be astronomical compared to mine. &lt;strong&gt;A $30,000 account is totally doable for a single Texan with low monthly expenses.&lt;/strong&gt; Now if you&amp;#39;re in California or New York? I&amp;#39;m sure you&amp;#39;ll fall below 25k if you have 1 bad month. Also depends on if you have other sources of income or a full/part time job. I encourage every trader and aspiring trader to have multiple sources of income, don&amp;#39;t rely solely on trading. Not just for the sake of mitigating pressure but also for sanity. If you have a family to provide for, I don&amp;#39;t know what that&amp;#39;s like, you never know when Little Johnny is going to randomly pick up Trombone lessons for a school program/play while little Suzie needs transmission work in her car because a simple solenoid went out. $1,700 later.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&amp;quot;Why do you need so many monitors?&amp;quot;&lt;/strong&gt; &lt;strong&gt;I use 3 for trading&lt;/strong&gt;. The 4th is for music. The other 2 are useless while trading. That&amp;#39;s for trading though. When I made the decision to go full time, I knew I was about to go off the chain with research. And sifting between spreadsheets, a platform to see multiple timeframes for a pattern to backtest. My attention span is short, I&amp;#39;ll lose my train of thought before I open the other tab to input data. But the main reason was for research. It&amp;#39;s such a time saver and is a headache repellant when doing research while everything is laid out in front of you. Now that I have a system. I&amp;#39;ll most likely be treating myself to 2 ultrawides for Christmas.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As always, thank you to everybody who takes time out to message me and letting me know some people read these and show appreciation. I would say, &amp;quot;Good luck&amp;quot; but there is no luck in trading. Just statistics. Remember that!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In conclusion:&lt;/strong&gt; Yes. Full time trading is possible, depending where you live/monthly expenses and obligations. You&amp;#39;re more likely to become a profitable trader than a professional athlete. There is a level of uncertainty each day, perhaps each week, doubtful each month, and definitely not each year. If I ever want a raise, I just consult my business plan and financials, then decide if I can handle it mentally. If you have medical issues, get a part time job for the benefits. If you&amp;#39;re healthy, just be careful.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;All the best!&lt;/p&gt;\n\n&lt;p&gt;-CJT2013&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "mod",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": "moderator",
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "j3zlqi",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "CJT2013",
                    "discussion_type": null,
                    "num_comments": 225,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Daytrading/comments/j3zlqi/my_1_year_anniversary_of_full_time_day_trading_3/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/j3zlqi/my_1_year_anniversary_of_full_time_day_trading_3/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1601661875.0,
                    "num_crossposts": 1,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": "I [recorded it all](https://youtu.be/JN-dfcoM7d8?si=W1wlDyCZRXTmIxcv) to stay accountable. But Fffffff. That hurts a lot. I made a \"tripwires\" document I am going to read before each and every trading day. My content of my trip wires document is below.\n\nI think reading this, along with [reading my trading guidelines](https://www.reddit.com/r/Daytrading/comments/1flmgox/my_trading_guidelines/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) before each trading day, will get me in the right headspace where I can avoid this type of behavior and stick to my single set up: a pullback/abc/flag.\n\nLet me know your constructive criticism.\n\nTRIPWIRES DOCUMENT:\n\n**Tripwires – Avoiding Tilt**\n\n“You are what you do. Not what you say you will do” – Carl Jung\n\nANY single day you have the potential to lose everything. These trip wires will help you avoid the\n\ncatastrophic mistakes. These black swan mistakes which are never planned for are what cause\n\nyou to be wiped out. These trip wires will prevent you from doing the bulk of the catastrophic\n\ndamage. You will always make mistakes, but if you can be self-aware enough to recognize and\n\nfollow these rules, you will be ok.\n\n**1. Two losses in a row? Done for rest of the day**\n\n2. **Taken 4 trades? Done for rest of the day**. You need to wait for the quality set ups. And\n\nyou need to stick with them. Hold for at least 2-3 15m bars, but often hold for 5-6. This\n\nrule is to make you more selective, focus on only taking the best set ups, and to keep you\n\nfrom over trading.\n\n3. **If you’re sizing up after losers, you are done.** Automatic stop for rest of day. You can\n\nsize up if the candle is smaller, but it must be within your plan.\n\n4. **If you notice you are a) erratically, b) compulsively, or c) impulsively trading**\n\n**against a trend, you are done. You have tilted. Take the rest of the day off and the**\n\n**following day.**\n\n**5. After a “tilt” day where you any break the above rules, take the next day off. You**\n\n**need to let your dopamine, your strong patience, decision fatigue, and your objectivity**\n\n**return to baseline.**\n\nYour blow-up losses and big losses ALL come from emotional decisions.\n\nYou cannot trade well when you are emotional, so you must cut yourself off.\n\nMake sure you are always following your guidelines and plan. Reminders:\n\n* Trading with the directional bias, and honest about what way it is going\n* Only joining the directional bias with confirmation candles and candles with good risk\n\n(expected value and not too large)\n\nBreaking these two reminders above is reasonable cause to be done.\n\nNote – if a “next day off” rule occurs on a Friday, you don’t have to take Monday off. Take the\n\nweekend to think about your mistake.",
                    "author_fullname": "t2_16bja4krik",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "First Tilt In A Long Time. What Now?",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Advice"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1flmg5q",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 0.93,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 26,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Advice",
                    "can_mod_post": false,
                    "score": 26,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1726866257.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1726865982.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Daytrading",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I &lt;a href=\"https://youtu.be/JN-dfcoM7d8?si=W1wlDyCZRXTmIxcv\"&gt;recorded it all&lt;/a&gt; to stay accountable. But Fffffff. That hurts a lot. I made a &amp;quot;tripwires&amp;quot; document I am going to read before each and every trading day. My content of my trip wires document is below.&lt;/p&gt;\n\n&lt;p&gt;I think reading this, along with &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/1flmgox/my_trading_guidelines/?utm_source=share&amp;amp;utm_medium=web3x&amp;amp;utm_name=web3xcss&amp;amp;utm_term=1&amp;amp;utm_content=share_button\"&gt;reading my trading guidelines&lt;/a&gt; before each trading day, will get me in the right headspace where I can avoid this type of behavior and stick to my single set up: a pullback/abc/flag.&lt;/p&gt;\n\n&lt;p&gt;Let me know your constructive criticism.&lt;/p&gt;\n\n&lt;p&gt;TRIPWIRES DOCUMENT:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Tripwires – Avoiding Tilt&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;“You are what you do. Not what you say you will do” – Carl Jung&lt;/p&gt;\n\n&lt;p&gt;ANY single day you have the potential to lose everything. These trip wires will help you avoid the&lt;/p&gt;\n\n&lt;p&gt;catastrophic mistakes. These black swan mistakes which are never planned for are what cause&lt;/p&gt;\n\n&lt;p&gt;you to be wiped out. These trip wires will prevent you from doing the bulk of the catastrophic&lt;/p&gt;\n\n&lt;p&gt;damage. You will always make mistakes, but if you can be self-aware enough to recognize and&lt;/p&gt;\n\n&lt;p&gt;follow these rules, you will be ok.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Two losses in a row? Done for rest of the day&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Taken 4 trades? Done for rest of the day&lt;/strong&gt;. You need to wait for the quality set ups. And&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;you need to stick with them. Hold for at least 2-3 15m bars, but often hold for 5-6. This&lt;/p&gt;\n\n&lt;p&gt;rule is to make you more selective, focus on only taking the best set ups, and to keep you&lt;/p&gt;\n\n&lt;p&gt;from over trading.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;If you’re sizing up after losers, you are done.&lt;/strong&gt; Automatic stop for rest of day. You can&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;size up if the candle is smaller, but it must be within your plan.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;If you notice you are a) erratically, b) compulsively, or c) impulsively trading&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;against a trend, you are done. You have tilted. Take the rest of the day off and the&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;following day.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5. After a “tilt” day where you any break the above rules, take the next day off. You&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;need to let your dopamine, your strong patience, decision fatigue, and your objectivity&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;return to baseline.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Your blow-up losses and big losses ALL come from emotional decisions.&lt;/p&gt;\n\n&lt;p&gt;You cannot trade well when you are emotional, so you must cut yourself off.&lt;/p&gt;\n\n&lt;p&gt;Make sure you are always following your guidelines and plan. Reminders:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Trading with the directional bias, and honest about what way it is going&lt;/li&gt;\n&lt;li&gt;Only joining the directional bias with confirmation candles and candles with good risk&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;(expected value and not too large)&lt;/p&gt;\n\n&lt;p&gt;Breaking these two reminders above is reasonable cause to be done.&lt;/p&gt;\n\n&lt;p&gt;Note – if a “next day off” rule occurs on a Friday, you don’t have to take Monday off. Take the&lt;/p&gt;\n\n&lt;p&gt;weekend to think about your mistake.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/hRUE9BlVvirZhl0u70_L1SZvXQb9iTOE48sfaXrlshY.jpg?auto=webp&amp;s=54c6b7c0ed6bc57aa8d9bf4dea088726c470467e",
                                    "width": 480,
                                    "height": 360
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/hRUE9BlVvirZhl0u70_L1SZvXQb9iTOE48sfaXrlshY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=1d1453609b79fb58b2295a5be398aebc6328546e",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/hRUE9BlVvirZhl0u70_L1SZvXQb9iTOE48sfaXrlshY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=f196eed9edfbfd66d40b711957371bdff534b808",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/hRUE9BlVvirZhl0u70_L1SZvXQb9iTOE48sfaXrlshY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=939a2a6a52e30727f0f807dcde6c8edd4f332a7b",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {},
                                "id": "ONP1Ay6e-yJ1qlY8xPtjSH7ll62Wnt2Iz5SlLWGCc78"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "60b87564-3190-11ea-812e-0e318b890fdd",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#ef7706",
                    "id": "1flmg5q",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "PeteTradez",
                    "discussion_type": null,
                    "num_comments": 31,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Daytrading/comments/1flmg5q/first_tilt_in_a_long_time_what_now/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/1flmg5q/first_tilt_in_a_long_time_what_now/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1726865982.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": "I've noticed newer day traders joining the subreddit and asking all sorts of questions, which is good! I wanted to use this growth as an opportunity to put in my 2 cents for the newbies coming in curious to try day trading. [This was my last post](https://www.reddit.com/r/Daytrading/comments/14o69ic/thinking_of_day_trading_know_the_risks/). For those who don't know, I like to do these kinda write-ups on weekends for when people have a break from the market and can read up a bit. \n\nSo today I wanted to talk about a few tips that helped become a more efficient day trader. Efficiency is one of the most important traits of a successful day trader. The word “efficient” is defined as: achieving maximum productivity with minimum wasted effort or expense. We know that time is money, so you obviously want to make the most of it. You want to make sure your trading activity makes the most of both your time and your money. If you like posts like these, feel free to follow my profile.\n\nIn trading, efficiency can entail a variety of ranging from a shift in focus to a change in behaviour. Your goal is to make the most money with the least amount of work (and stress). \n\n**1. Scan at Night**\n\nYou should come to market every day with a game plan. Don’t expect to flip on your computer screens at 9:30AM and have the trades come to you. You need to scan the night before, create a watch list, and prepare to execute your trading plan the next day.\n\n**2. Wake Up Early and Check Pre-Market Data**\n\nWaking up early serves two purposes. First, it gives you time to wake up and take care of your morning routine before you start trading. Second, it allows you to analyze pre-market trading activity. You can see how broader markets are performing, check for company news, and analyze pre-market trades. This will help you solidify and/or reformulate the plan you created the night before.\n\n**3. Keep your Watch Lists Short**\n\nIf you’re watching 20+ stocks, you’re going to get overwhelmed. Even the best multi-taskers can’t devote the proper attention to a large watch list. Focus on creating smaller watch lists of 5-10 stocks. As you analyze early morning trading activity, you may be able to narrow this list down to less than 5. This allows you to stay focused and give each trade the attention it deserves.\n\n**4. Use Multiple Watch Lists**\n\nMany traders create big watch lists because they don’t want to miss out on a trade. If this is the case, you can create multiple watch lists and flip through them. Better yet, you can create watch list scans to alert you of any significant activity from these stocks. You may create separate watch lists based on market cap, stock price, sector, etc. I like to have one watch list for each sector. \n\n**5. Limit Your Indicators**\n\nRelying on too many indicators will lead to information overload and, ultimately, decision fatigue. You should only be using the indicators that help you make decisions. For example, you may find that the VWAP indicator is helpful for gauging risk, but the 5, 10, and 20-period moving averages are not.\n\n**6. Create a Positive Environment**\n\nYour physical environment will have an impact on your mindset and, consequently, your trading. While you may not pay much attention to your environment, it can still have subconscious effects. Keep your desk clean, eliminate distractions, and do whatever is necessary to facilitate an environment that is conducive to your trading success.\n\n**7. Avoid Distractions**\n\nTrading is difficult enough as-is. The last thing you need is to be distracted. Do your best to eliminate distractions. For example, if you know that browsing social media distracts you, stay off of social media sites during trading hours. If you know you have an appointment during the middle of the trading day, consider avoiding trades that you’d need to hold through the appointment.\n\n**8. Don’t Overthink Your Trades**\n\nIt’s important to remember that there is a big difference between planning and overthinking. Planning represents diligence whereas overthinking represents indecision.\n\nCreate a plan and do what you said you were going to do. Don’t question your judgment after the fact and don’t try to account for every scenario. Any time you find yourself hesitating, it can usually be attributed to a lack of planning.\n\n**9. Take Away Lessons, Not Regrets**\n\nHere’s a little trading secret – NO trader has a 100% win rate. Every trader takes losses, regardless of their experience. It’s impossible to be right all of the time. Perfection is an aspiration, not a destination. Allow yourself room for failure.\n\nInstead of regretting your losses, learn to take away a lesson. Regret gets you nowhere, whereas lessons will help you improve your trading.\n\n**10. Get The Right Tools**\n\nMost traders can’t even imagine the thought of trading without their charts and level 2 screens. I'm one of them! If you want to give yourself the best shot at trading success, you need to be equipped with the proper tools. Luckily, in this new-age of technology, almost every tool you need is available.\n\nMake sure you have access to quality scanners, charting tools, level 2 platforms, etc.\n\n**11. Know Your Limits**\n\nWhen possible, trade within your comfort zone. Leaving your your comfort zone causes you to trade emotionally and irrationally. This isn’t to say you shouldn’t challenge yourself BUT if you constantly find yourself in uncomfortable positions, you need to learn your limits.\n\nYour limits may include certain position sizes, certain sectors, certain trade setups, etc. For example, if you’re not comfortable short selling, focus on long trades. If you are trying to expand your horizons, ease your way in so you can learn a new skill set.\n\n**12. Let the Trades Come to You**\n\nWhen you’re staring at a screen for 8+ hours a day, it can be tempting to place a trade just for the sake of remaining active. Considering every trade has the potential for losses, this isn’t your best move. Let the trades come to you. If there are no good setups on a given day, wait for the next day. It’s better to end the day flat than negative.\n\n**13. Avoid Averaging Down**\n\nOne of the worst ways to try to rectify a situation is by repeating the exact behaviour that got you into the mess. You can’t fight fire with fire.\n\nTraders often see “averaging down” as a way of hedging their risk and increasing their potential upside. In reality, this is a great way to stack your losses and cause unnecessary damage to your trading account. If a trade goes against you, take the loss and move on.\n\n**14. Disconnect from Your Capital**\n\nIf you want to stand a chance in the world of trading, you need to disconnect from your capital. Think of your capital as numbers instead of money. This helps you make intelligent, rational decisions instead of emotional ones. For example, if you realize that loss you just took was about the price of your rent, you might mishandle your position.\n\nOf course, you also shouldn’t trade with money you can’t afford to lose.\n\n**15. Get in the Habit of Doing Research**\n\nWe live in one of the best eras to be a day trader. The answers to 99% of your questions are at your fingertips. Don’ t know what the MACD indicator is? Google it. Don’t know what a trailing stop loss order is? Google it.\n\nGet in the habit of doing research whenever you are faced with the unknown. Over time, this habit will help you become a more educated and knowledgeable trader. If you learn five new things every week, imagine where you’ll be at the end of the year.\n\n**So that's it**\n\nI really hope this helps at least a few traders. I know there will be a few seasoned day traders that'll comment something trivial like \"ok\" but this post isn't for the 20-year veterans. I'm hoping we have fewer people coming in with $1000 and blowing up their accounts, and more money-makers. Good luck this week!",
                    "author_fullname": "t2_d9yqz93d9",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Tips that helped me become a more efficient day trader",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_14uv3jt",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.97,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 151,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 151,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1688898227.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Daytrading",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve noticed newer day traders joining the subreddit and asking all sorts of questions, which is good! I wanted to use this growth as an opportunity to put in my 2 cents for the newbies coming in curious to try day trading. &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/14o69ic/thinking_of_day_trading_know_the_risks/\"&gt;This was my last post&lt;/a&gt;. For those who don&amp;#39;t know, I like to do these kinda write-ups on weekends for when people have a break from the market and can read up a bit. &lt;/p&gt;\n\n&lt;p&gt;So today I wanted to talk about a few tips that helped become a more efficient day trader. Efficiency is one of the most important traits of a successful day trader. The word “efficient” is defined as: achieving maximum productivity with minimum wasted effort or expense. We know that time is money, so you obviously want to make the most of it. You want to make sure your trading activity makes the most of both your time and your money. If you like posts like these, feel free to follow my profile.&lt;/p&gt;\n\n&lt;p&gt;In trading, efficiency can entail a variety of ranging from a shift in focus to a change in behaviour. Your goal is to make the most money with the least amount of work (and stress). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Scan at Night&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You should come to market every day with a game plan. Don’t expect to flip on your computer screens at 9:30AM and have the trades come to you. You need to scan the night before, create a watch list, and prepare to execute your trading plan the next day.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Wake Up Early and Check Pre-Market Data&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Waking up early serves two purposes. First, it gives you time to wake up and take care of your morning routine before you start trading. Second, it allows you to analyze pre-market trading activity. You can see how broader markets are performing, check for company news, and analyze pre-market trades. This will help you solidify and/or reformulate the plan you created the night before.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Keep your Watch Lists Short&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you’re watching 20+ stocks, you’re going to get overwhelmed. Even the best multi-taskers can’t devote the proper attention to a large watch list. Focus on creating smaller watch lists of 5-10 stocks. As you analyze early morning trading activity, you may be able to narrow this list down to less than 5. This allows you to stay focused and give each trade the attention it deserves.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Use Multiple Watch Lists&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Many traders create big watch lists because they don’t want to miss out on a trade. If this is the case, you can create multiple watch lists and flip through them. Better yet, you can create watch list scans to alert you of any significant activity from these stocks. You may create separate watch lists based on market cap, stock price, sector, etc. I like to have one watch list for each sector. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5. Limit Your Indicators&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Relying on too many indicators will lead to information overload and, ultimately, decision fatigue. You should only be using the indicators that help you make decisions. For example, you may find that the VWAP indicator is helpful for gauging risk, but the 5, 10, and 20-period moving averages are not.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;6. Create a Positive Environment&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Your physical environment will have an impact on your mindset and, consequently, your trading. While you may not pay much attention to your environment, it can still have subconscious effects. Keep your desk clean, eliminate distractions, and do whatever is necessary to facilitate an environment that is conducive to your trading success.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;7. Avoid Distractions&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Trading is difficult enough as-is. The last thing you need is to be distracted. Do your best to eliminate distractions. For example, if you know that browsing social media distracts you, stay off of social media sites during trading hours. If you know you have an appointment during the middle of the trading day, consider avoiding trades that you’d need to hold through the appointment.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;8. Don’t Overthink Your Trades&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It’s important to remember that there is a big difference between planning and overthinking. Planning represents diligence whereas overthinking represents indecision.&lt;/p&gt;\n\n&lt;p&gt;Create a plan and do what you said you were going to do. Don’t question your judgment after the fact and don’t try to account for every scenario. Any time you find yourself hesitating, it can usually be attributed to a lack of planning.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;9. Take Away Lessons, Not Regrets&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here’s a little trading secret – NO trader has a 100% win rate. Every trader takes losses, regardless of their experience. It’s impossible to be right all of the time. Perfection is an aspiration, not a destination. Allow yourself room for failure.&lt;/p&gt;\n\n&lt;p&gt;Instead of regretting your losses, learn to take away a lesson. Regret gets you nowhere, whereas lessons will help you improve your trading.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;10. Get The Right Tools&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Most traders can’t even imagine the thought of trading without their charts and level 2 screens. I&amp;#39;m one of them! If you want to give yourself the best shot at trading success, you need to be equipped with the proper tools. Luckily, in this new-age of technology, almost every tool you need is available.&lt;/p&gt;\n\n&lt;p&gt;Make sure you have access to quality scanners, charting tools, level 2 platforms, etc.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;11. Know Your Limits&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When possible, trade within your comfort zone. Leaving your your comfort zone causes you to trade emotionally and irrationally. This isn’t to say you shouldn’t challenge yourself BUT if you constantly find yourself in uncomfortable positions, you need to learn your limits.&lt;/p&gt;\n\n&lt;p&gt;Your limits may include certain position sizes, certain sectors, certain trade setups, etc. For example, if you’re not comfortable short selling, focus on long trades. If you are trying to expand your horizons, ease your way in so you can learn a new skill set.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;12. Let the Trades Come to You&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you’re staring at a screen for 8+ hours a day, it can be tempting to place a trade just for the sake of remaining active. Considering every trade has the potential for losses, this isn’t your best move. Let the trades come to you. If there are no good setups on a given day, wait for the next day. It’s better to end the day flat than negative.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;13. Avoid Averaging Down&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the worst ways to try to rectify a situation is by repeating the exact behaviour that got you into the mess. You can’t fight fire with fire.&lt;/p&gt;\n\n&lt;p&gt;Traders often see “averaging down” as a way of hedging their risk and increasing their potential upside. In reality, this is a great way to stack your losses and cause unnecessary damage to your trading account. If a trade goes against you, take the loss and move on.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;14. Disconnect from Your Capital&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you want to stand a chance in the world of trading, you need to disconnect from your capital. Think of your capital as numbers instead of money. This helps you make intelligent, rational decisions instead of emotional ones. For example, if you realize that loss you just took was about the price of your rent, you might mishandle your position.&lt;/p&gt;\n\n&lt;p&gt;Of course, you also shouldn’t trade with money you can’t afford to lose.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;15. Get in the Habit of Doing Research&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We live in one of the best eras to be a day trader. The answers to 99% of your questions are at your fingertips. Don’ t know what the MACD indicator is? Google it. Don’t know what a trailing stop loss order is? Google it.&lt;/p&gt;\n\n&lt;p&gt;Get in the habit of doing research whenever you are faced with the unknown. Over time, this habit will help you become a more educated and knowledgeable trader. If you learn five new things every week, imagine where you’ll be at the end of the year.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So that&amp;#39;s it&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I really hope this helps at least a few traders. I know there will be a few seasoned day traders that&amp;#39;ll comment something trivial like &amp;quot;ok&amp;quot; but this post isn&amp;#39;t for the 20-year veterans. I&amp;#39;m hoping we have fewer people coming in with $1000 and blowing up their accounts, and more money-makers. Good luck this week!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "14uv3jt",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "AgressiveProfits",
                    "discussion_type": null,
                    "num_comments": 43,
                    "send_replies": false,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Daytrading/comments/14uv3jt/tips_that_helped_me_become_a_more_efficient_day/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/14uv3jt/tips_that_helped_me_become_a_more_efficient_day/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1688898227.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": " \n\nEvery 180 days I make another post to [thread it back to the original](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/) before it's archived. I do this to prevent a bunch of small posts every few days about trivial subjects.\n\n[Part 1](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/) (Same link as 'thread it back to the original.)\n\n[Part 2](https://www.reddit.com/r/Daytrading/comments/j3zlqi/my_1_year_anniversary_of_full_time_day_trading_3/)\n\n[Part 3](https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/)\n\n**This is Part 4,** and I'll go over life outside of trading. The previous 3 talked mostly about trading and the outline of my style is written in them. If you're just scrolling and want to know what it managing money when you're income is completely trading. Then so be it. Mind you this is my experience as a single, male, mid-20's, no debt (anymore), minimalist, full-time trader living in Texas.\n\n**TL;DR** \\- Full time trading has its pros and cons. The pros are obvious. The cons are what people don't talk about. The true cost of doing this as your source of income has the propensity to invite an extraordinary amount of stress. Trading is easy (very easy), it's the lifestyle that's not for the faint of heart because bills add up... And trading isn't gambling because statistics and risk management.\n\nHere's what I'll go over in this post:\n\n1. **The real cost of being full time** \\- *The main one I want to tackle because like I've said in the past, \"Risk management as a trader is 24/7.\" I touched up on this in Part 1 but I really want to break every single expense down and compare it to profits. Think about cost of living and what you're really giving up for this career such as health benefits, matching 401k, easy work, a consistent paycheck, and \\*job security\\*. This one will also answer the, \"****How much do I need to do this business full time?****\" Question.* ***It depends on your expenses.***\n2. **Psychology** \\- *Briefly. It's a simple subject/debate. Quick paragraph because that's really all there is to \"Psychology of trading\"*\n\nI thought about writing this in a, **\"Letter to myself 2 years ago\"** to potentially allow readers to read it vicariously like a letter to yourself written from yourself 2 years in the future but perhaps another time as a random post down the line.\n\nThere was consideration doing an **AMA** but [read The Wiki](https://www.reddit.com/r/Daytrading/wiki/getting-started-daytrading) if you want my patterns. *(I'm a mod here, I wouldn't mod a subreddit that suggests bad material. Everything to start you out is there. It's fantastic info)*. There's also a few videos on my Twitter from last year.\n\n**Before I begin:** Trading unfortunately has the propensity to attract gamblers. The entry barrier is so low you could start trading against the pros off a few apps on your phone. Allow that to digest before putting any risk out there. Yes, most lose. But redo that statistic with ONLY people that have a proven business plan backed by statistics then redact those who didn't follow the plan. If you have that with clear cut granular rules.. Fear is the only thing that will stop you from making this a healthy and respectable source of income. I would bet that the success rate would go north of 80%.\n\n***So we begin:***\n\n1) The Real Cost of Trading Full Time:\n\n**A)** I assume you know exactly what your expenses are *but for the sake of granularity.. let's tackle the meat of everyday people:*\n\n* **Mortgage (PITI) / Rent**\n* **Taxes on your house Home/Renters Insurance**\n* **Health Insurance -**\n* **Car Note (P&amp;I only)**\n* **Car Insurance**\n* **Car Preventative Maintenance (Oil, Transmission Fluid, Servicing, Registration/Inspection)**\n* **Gas**\n* **Utilities**\n* **Wifi**\n* **CellPhone Bill**\n* **Groceries**\n* **And don't dare forget about your retirement or kid's 529 savings plan. Just because you trade stocks doesn't mean you don't need to invest. I do it. And yes it feels weird shorting NVDA for a day trade when that's my heaviest allocation since 2018.**\n* (We'll get to the biggest bamboozlement of them all in a while...Income taxes)\n\nNow add some ancillary things in there like: Gym membership, haircut, night out with S/O, gifts for family and friends birthdays, Christmas/Hanukah gifts, and other services but we'll just calculate the necessities then play around with the numbers a bit:\n\nFor visuals: [https://imgur.com/a/2LMW8QI](https://imgur.com/a/2LMW8QI)\n\n&amp;#x200B;\n\nThese are absolute necessities not including ancillary expenses for homeowners. Of course if you're renting by yourself, with friends, or living at home, adjust for yourself. This isn't including the income taxes you'll pay at the end of the year.\n\n**So the grand total monthly expenses based on averages I found on Google based off of NerdWallet... $5,253. (Google it if you want. The article is from April 29th, 2021). Some consider savings and retirement to not be expenses but I'm not writing this to grasp at straws over trivial debates. This argument is, \"There's money that cannot be spent.. it's an expense to yourself\".**\n\nI'll take that number from above and round it to $5,000. That's way above mine given have the Texas Blue Title to my truck *(Chevy Runs Deep)*, rent my home, don't have health insurance.. [Got some controversial replies on that one](https://www.reddit.com/r/Daytrading/comments/ou2iws/full_time_traders_what_do_you_do_for_insurance/h70o062?utm_source=share&amp;utm_medium=web2x&amp;context=3) but hey, that's my risk. God Blessed me and I don't take it for granted.\n\nSo I'll tell you my monthly expenses although I feel its a little intrusive but I'm sure nobody I personally know reads my posts anyways. Just under $4,000/mo are my expenses for my necessities. Mind you... Single, Texas, Male, Minimalist, I loathe spending money, and I can have fun seeing if I can do more pushups than I did yesterday and throwing the baseball with my neighbor at the fields.\n\nLet's compare on a monthly basis. (When I say life of a trader isn't luxurious rather it is, \"Comfortable\", I mean it whole-heartedly.)\n\n**AVG Monthly Expenses (USA)**\n\n[https://imgur.com/a/sPnQMcX](https://imgur.com/a/sPnQMcX)\n\n**AVG Monthly Expenses (Me)**\n\n[https://imgur.com/a/1FeQhUi](https://imgur.com/a/1FeQhUi)\n\nAverage American Monthly Expenses. Of course this all varies from state to state. This could potentially be biased since I'm from Texas but it seemed decent to me. \\*\\*\\*\\*GRAND TOTAL:\\*\\*\\*\\* $5,085.\n\nNow we're starting to see the cutbacks I made to make a living from trading myself... No health insurance, I don't drive anything crazy, no matching in my retirement plan from my 9-5, I barely drive anywhere, cheap liability (don't give me a ticket) car insurance. \\*\\*\\*\\*GRAND TOTAL:\\*\\*\\*\\* $3,550 of necessities.\n\nHere's the psychology of all those numbers from above...\n\nI assume you know [what an R is](https://www.thebalance.com/risk-to-reward-ratio-1031350)...\n\nSo let's take the $5,000 number from earlier. Your monthly expenses that is. And we're talking theoretical backtesting. \\*\\*\\*\\*\\*\\*\\*NOT INCLUDING SLIPPAGE OR COMMISSIONS.\\*\\*\\*\\*\\*\\*\\*\n\n1. **At $500 risk.** You would need to make 10R per month **(EASY)** *(0.38R/day Avg. OR 1.9R/week)*\n2. **At $400 risk.** You would need to make 12.5R per month **(EASY)** *(0.59R/day Avg. OR 2.97R/week)*\n3. **At $250 risk.** You would need to make 20R per month **(Doable. Not guaranteed)** *(0.95R/day Avg. OR 4.76R/week)*\n4. **At $100 risk.** You would need to make 50R per month **(Not happening)** This is the risk amount I did when I resigned from my 9-5. Mind you I did personal training on the side.\n\n**I can make 10R in a month easily. It's happened in a day before**. [But can you also handle potentially losing $500? Or being up 1.8R then having the trade come back and stopping you out?](https://twitter.com/CJT2013/status/1366742864055664641) I can with $500 risk. Could I do that in 2019? **Absolutely not**. I'd have a blood pressure so high due to materializing my trades with what COULD happen and what bills that COULD have been paid as soon as the trade filled. Now in 2021? I do it almost everyday when my edge is shown but that's with years of statistics backing me. Have a look at my spreadsheet stats. I've had the same EV, Sharpe Ratio, Win Rate, key metrics, etc. for years.\n\n&lt;spreadsheet stats&gt;: [https://imgur.com/a/6AFzQVV](https://imgur.com/a/6AFzQVV)\n\nThis is what helps my \"Psychology\" and \"Headspace\" going into trades. This isn't something that can just be handed to you. It's years (months for some) of filling everything out then slicing and dicing data to make it work. \"It\" being your style of trading. It may not be the most profitable but it's something that you can manage mentally. It's years of, \"Why did I take that trade? What was I thinking? I don't want to even fill it out. I won't do it again.\" Fill out every trade and things will distill down into a strategy that's YOURS.\n\nI've built these over the years and they tell me the biggest run ups and drawdowns in a theoretical trading account. I know there will be months I make 5R after slippage and some months I make 35R... There will be days I'm up $2,750 in 5 minutes and other days I'm down $1,750 in less than 10 minutes... **There are ALSO DAYS that turn into WEEKS that I don't even touch an order ticket to put on a trade because you don't make money putting on trades. You make money in this business by putting large sums of calculated risk on high EV trades.**\n\n**Equity Curve Simulator I built:**\n\n[https://imgur.com/a/BBAyvuG](https://imgur.com/a/BBAyvuG)\n\n&amp;#x200B;\n\nVisualize your data. It helps make things seem more real resulting in you honoring your business plan. If you're a man of your word, prove it by following your rules from your mouth.\n\nI've gone over how to handle losses before. It's simple, it's an expense just like Mark Douglas says.\n\n**Let's drop the pessimistic scarcity mindset and forget how you handle losses. How do you handle profits?**\n\nAre you responsible with them? There's this thing called, **\"Reversion to the mean\".** And we can utter the words, \"Oh yeah I know there will be losses and good weeks\" But do you sulk over 2 measly trades that ALMOST hit target but stopped you out? Do these 2 or 5 or 10 trades change how you trade forever? It shouldn't but I see it on here all the time people pouting over such a small sample size of trades looking for advice. You do realize there will be times you get smacked around then the market goes quiet for a few weeks leaving you making zero deals for a while from time to time. Do you really care about those 2R or 5R or is it the money that was attached to it? That's the loss side of things. The profiting side of things is different. People start to get cocky. I make more R than my theoretical testing occasionally because of missing trades (rarely). Does that mean I'm better than my backtesting? (You'll never beat your backtesting. It's impossible UNLESS you just so happen \"miss\" every losing trade your backtesting would have picked up).\n\nWith your extra profits/good weeks do you increase risk and or buy things you don't need? *\"I made $2,750 this week. I'll cover your golf game/buy your lunch\" &lt;--Don't be this guy. (Not speaking from experience either srs)*\n\n•There will be weeks you make 13R\n\n•There will be weeks you lose 5R\n\n•There will be weeks you reach your limit down R\n\n•There will be times after you hit your limit down that there are no deals/trades to be made for WEEKS. Plural. Not just 1 week. Sometimes 2 and rarely 3 weeks. Almost an entire month of no trades.\n\n•There will be times where it seems like the market is handing you free money left and right to where you start to feel bad for people on the other side of your trades.\n\nTrading isn't a rose garden of free money, it will feel like that from time to time. It will also feel like an absolute money pit. But Central Limit Theorem / The Law of Large Numbers does its magic:\n\nActual vs Theory Performance &amp; Growth-\n\n[https://imgur.com/a/Px4PGaT](https://imgur.com/a/Px4PGaT)\n\nPeople have the propensity to look at their performance through a microscope rather than taking a step back to look at the big picture. That's why it amazes me how people use such a small sample size of data (20 - 100 trades) then put large sums of risk on it. Only to pout about later INEVITABLE results. They complain over 2 trades. You will have tough weeks. Businesses do go through hard times and times of euphoria. Think of how people who rent beach houses in the winter vs summer.\n\nThe above picture is looking at the big picture. So let's zoom in to the first 5 months:\n\n[https://imgur.com/a/EHILbyq](https://imgur.com/a/EHILbyq)\n\n&amp;#x200B;\n\nHow are you reacting when, \"The market is beating my performance. I'd have done better if I just put my money in the market or sold CC's. I'm only up $19,000 in 5 months when I should be up more than $30,000. I broke rules. I took more risk than I should have. I'll stop while I'm ahead\". How do you react in the other 23 hours in the day after trades result in losses day after day?\n\nThis is the magic/beauty of Central Limit Theorem / The Law of Large Numbers:\n\n[https://imgur.com/a/HYO51fu](https://imgur.com/a/HYO51fu)\n\n[https://imgur.com/a/GD1j79L](https://imgur.com/a/GD1j79L)\n\nI always say only 2 things can happen in a trade (hence its so EASY). Profit or loss. Heads or tails. This image is of 10 trials with 2 results. Think of the 10 trials like the 10 different times you start trading you strategy live. You might start with a hot streak or a streak of donations to Wall Street. Think of the 2 results as profit or loss. IN THE END. It all averages out, don't be pathetic and pout over 2 or 10 trades resulting in a less than desirable sum\n\n**So how do YOU decide how much you want to risk? Is it...**\n\n1. How much you want to make in a month divided by an R per month goal? NO.. The market doesn't know you. You can't force R's to happen. They come to you. There are entire 5 trading day weeks that I don't touch an order ticket. It's not everyday you make a deal.\n2. How much you think you can mentally handle? Not the best idea but it's a better idea.\n3. A cocktail of metrics such as how much buying power you have, Risk of Ruin, EV, and Sharpe Ratio. *(Notice how I don't care for Win-Rate? Win-Rate only tells/asks you 1 thing, \"Can you handle being right or wrong this percentage of the time?\")*\n\nIf I had to make a rule of thumb for somebody who wants to decide if they are ready to trade full time. It would have to be reverse engineered:\n\n**You need to find what your EV is and I'll show an example from a micro sample size of 10**\n\nYou really do require a large sum of data. I mean it when I say, \"1,000 trades minimum or a full year of backtesting\" (Full year because the market does shift but in the end does not effect a day trader's performance... in MY experience in the long run). Those who get a random 20 or 50 or even 100 and think they're ready to go up against professionals who have electricity bills higher than your yearly income because their computers are running algos and statistics 24/7...you'll learn fast.\n\n[https://imgur.com/a/ivfOxTo](https://imgur.com/a/ivfOxTo):\n\n6 trades that resulted in +2R. 4 trades that resulted in -1R. Average of all = 0.8.. \"Expected\" is just how statisticians say, \"Average\". What this is saying is you can EXPECT 80¢ for every dollar you risk on the amount of trades you're testing. This is why when I lose a trade OR profit on a trade. I don't think, \"Wow I made $958 after slippage.\" or \"Wow I lost $582 after slippage\". When I see my edge, I think to myself, \"Ok there's &lt;EV&gt; right there. I see income on every trade if it gets filled. Losing trades don't bother me. I have contingency plans... And don't ever say, \"I won that trade\". Businesses that sell &lt;something&gt; don't say, \"Oh cool we won\". You don't \"Win\" when you're assuming a risk. Trading isn't a game that you play.\n\n**2) Find how many trades on average you have. Let's say weeks 1-4. You have 20 trades on the first week, 1 on the second week, 0 on the third week, and 7 on the last week. (I'm using a micro-size sample here again. You really need A LOT more)**\n\n[https://imgur.com/a/PWYSqsH](https://imgur.com/a/PWYSqsH)\n\nI can EXPECT 7 trades per week (ETW). IF I can expect 7 trades per week and each trade will result in 80¢ for every dollar I risk... Is this enough to cover my expenses AND TAXES SO THE GOVERNMENT CAN WASTE IT ON CRAP THAT DOESN'T HELP THE PEOPLE WHO PAY THEM.. and a little more so I can have a life outside of home. 7 trades per week \\* $100 risk \\* 0.8 per trade = Gross Income of $560\n\nMaybe $560 (before taxes) is enough for you to survive. I don't know you or your personal finances, that's your business. For most.. it's not. So let's increase it to $250. For the sake of simplicity we know 250 ÷ 100 = 2.5. So $560 \\* 2.5 = $1,400 EXPECTED (not guaranteed) per week.. GROSS income. You'll have to determine how much you need to set aside for taxes when you have that year of data that tells you what you can EXPECT to make that year. This seems more like it... I like this.\n\n**3) Does your account size and margin parameters allow for this?:**\n\n&amp;#x200B;\n\nLet's say you have $37,500 in your account that has 4:1 leverage which allows for $150,000 in DayTrading Buying Power...and you're risking $250 a trade... Risk ÷ StopSize = Shares/Contracts to buy --&gt; Shares to buy \\* Price = Capital\n\n**Now let's visualize the data:**\n\n[https://imgur.com/a/FFEsLK3](https://imgur.com/a/FFEsLK3)\n\nThe 2nd position wouldn't have been able to be made. If you're running into buying power issues in your backtesting, either reduce your risk or find what's causing this. Perhaps it's the type of style you're trading or a certain pattern that has an inclination to exhaust buying power due to tight StopSizes (Tight StopSizes incur lots of slippage).\n\nNow most would say, \"Oh well I'll run into that if that ever happens. It's only 1 trade\". That's 100% wrong. Your goal is to be 100% efficient and copy your backtesting to a T. Trust me, it will happen, you will miss trades due to complacency when you haven't made a trade in over a week and you're a little rusty. So again in conclusion to the buying power metric, adjust accordingly.\n\n4) Risk of Ruin. Is it under 1%?\n\nThis is all discretionary. Me personally I want my RoR to be south of 0.25% but I've read many places that 1% is good. Probably just people repeating what everyone else says but that's just my opinion. How do you calculate it? There's a bunch of ways. [There](https://www.myfxbook.com/forex-calculators/risk-of-ruin-calculator) are a bunch of [different websites](https://2ndskiesforex.com/risk-of-ruin-calculator/) that do a pretty good job that tell it all for you. But if you want it for your spreadsheets so you can visualize it and see how it matures over time:\n\n[RoR formula.](https://imgur.com/a/95P9gy7)\n\nSo there it is! In conclusion. You take how much you need. Find your EV, see how many trades on average you get per day, week, month, quarter, etc., then see what's stopping you then assume that calculated risk by seeing what the odds of you failing are. That's the meat of it at least. There are a bunch others such as:\n\n•**Can you take that many trades and not miss any?** (It isn't smart to be firing off 30 trades a day. I know there are those who do it but like I've written before.. decision fatigue gets real. There's also a bunch of different ways to trade so I digress. Billions of dollars are exchanged between hands on NVDA on a daily basis. I might see 1 small edge on a 1' chart on 1 day out of the last 21 trading day month. Everyone sees fit trades all over the charts)\n\n•**Do you have an SOP for how you'll identify and enter your trades based on statistics?** For example I only allow for 10% of my R to be slipped on the entry because on average I get slipped on my stop outs 0.07R. So a losing trade could lose me 1.17R meanwhile the profiting trades achieve 1.9-1.99R depending on how bad I was filled according to my order tickets parameters.\n\nTake what info you got from your research and just pull the trigger. The market is liquid. A $50,000 position shouldn't faze you if you sized your position accordingly and set your StopLoss. Trading is a business. Take the leap if you're considering it. Just remember all the things you forfeit being independent from the normal job life. The market isn't going anywhere so you do have time and the time will never feel right.\n\n2) Psychology - ( 2 paragraphs is really all it is)\n\nAlthough I can summarize that subject in 4-5 sentences: \"Read a few trading books. Put the ideas on a spreadsheet and see the results. Now trust it, write a business plan, follow it, and trade it live if you like the backtest results.\" How much psychology does one need when:\n\n1. Price is Up or Down\n2. P/L is Green or Red\n3. Result is Profit or Loss\n4. A ticker is Showing Edge or No Edge\n5. It's Heads or Tails.\n\n**But here's the answer to your psychology of trading questions... You are crippling yourself when you trade money you CANNOT AFFORD to lose.** You're uncomfortable risking money you can't afford to lose and now want some tumblr quote to help you sleep better at night. We all become Steve Cohen/Paul Tudor Jones when it says, \"Simulated Paper Trading\" or when the screen has an orange trim around the perimeter. Trade live when you're risking money you couldn't care less about... Because that's how it should be.... *But make sure you can respect it at the same time &lt;- That's an important one (srs). Anybody can hit dingers in a batting cage, shoot 3's at an LA Fitness, or hit their 5iron 200+ yards at a driving range.. but when it becomes real, people fold.* Done with that subject but I'm sure in 48 hours there will be a psychology post. If you want to improve this subreddit, just reply to those questions, \"Trade with money you can afford to lose and not lose sleep over\".\n\n**All done. So I'll leave it with this:**\n\nThink of my timeline from my first day as a full time trader. September 2019.\n\n•That drawdown I had just 1 month in. No more cushion 9-5 income, no benefits, and the drawdowns happen. Just have a safety net and a StopLoss to start looking for a job if your account/savings go below a predetermined number.\n\n•When you've got politicians proposing a 0.2% Financial Transaction Tax on all stock trades. Doesn't sound like much to the average Joe but it would have destroyed any trading business. [Take this trade](https://twitter.com/CJT2013/status/1339254005223071746) for example if that FTT was put into effect:\n\n**DISH** \\- $33.30/share by 800 shares = $26,500 trade IN and \\~$26,500 OUT | $53,000 moved.\n\n**TDOC** \\- $186.00/share by 158 shares = $30,000 trade IN and \\~$30,000 OUT | $60,000 moved.\n\n**SQ** \\- $223.25/share by 220 shares = $49,000 trade IN and \\~$49,000 OUT | $98,000 moved.\n\nThat was a net slippage day meaning I hit break even losing 2R on 2 trades and gained 2R on 1 trade.. 0R but slippage caused me to lose roughly $100.. Now add that FTT... $211,000 \\* 0.002 = $422 with a 0.2% FTT. Politicians would have ended this business for me and I love what trading life has afforded me.. time.\n\n•When March 2020 happened and the world shut down (Which put me in a position to start this thread). I couldn't train in a gym anymore for extra cash. There goes a source of income for me. I learned fast needless to say. You never know what's going to happen tomorrow. Me personally I leave it to God because it's in His hands. That's what helps take off the edge for me so whatever works for you, let it do its thing. There's lots of uncertainty in this business (as with any business) so either take the leap or not, just do it right. Following a written plan and honoring it day after day feels like a marathon but you learn to trust it.\n\nUntil March 2022! *(I've got some more time in this business for me.)*\n\n\\-CJT2013",
                    "author_fullname": "t2_dk7xu88",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Part 4: After 4 Years Day Trading; 2 Years Full Time. Here's Some More Advice",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Trading for Income"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_pw7op3",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.98,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 481,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": "b2b343ae-b2af-11e9-ae64-0e9bd2c0a03a",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Trading for Income",
                    "can_mod_post": false,
                    "score": 481,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [
                        {
                            "e": "text",
                            "t": "mod"
                        }
                    ],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1632709025.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "richtext",
                    "domain": "self.Daytrading",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every 180 days I make another post to &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/\"&gt;thread it back to the original&lt;/a&gt; before it&amp;#39;s archived. I do this to prevent a bunch of small posts every few days about trivial subjects.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/\"&gt;Part 1&lt;/a&gt; (Same link as &amp;#39;thread it back to the original.)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Daytrading/comments/j3zlqi/my_1_year_anniversary_of_full_time_day_trading_3/\"&gt;Part 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/\"&gt;Part 3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;This is Part 4,&lt;/strong&gt; and I&amp;#39;ll go over life outside of trading. The previous 3 talked mostly about trading and the outline of my style is written in them. If you&amp;#39;re just scrolling and want to know what it managing money when you&amp;#39;re income is completely trading. Then so be it. Mind you this is my experience as a single, male, mid-20&amp;#39;s, no debt (anymore), minimalist, full-time trader living in Texas.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; - Full time trading has its pros and cons. The pros are obvious. The cons are what people don&amp;#39;t talk about. The true cost of doing this as your source of income has the propensity to invite an extraordinary amount of stress. Trading is easy (very easy), it&amp;#39;s the lifestyle that&amp;#39;s not for the faint of heart because bills add up... And trading isn&amp;#39;t gambling because statistics and risk management.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s what I&amp;#39;ll go over in this post:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;The real cost of being full time&lt;/strong&gt; - &lt;em&gt;The main one I want to tackle because like I&amp;#39;ve said in the past, &amp;quot;Risk management as a trader is 24/7.&amp;quot; I touched up on this in Part 1 but I really want to break every single expense down and compare it to profits. Think about cost of living and what you&amp;#39;re really giving up for this career such as health benefits, matching 401k, easy work, a consistent paycheck, and \\&lt;/em&gt;job security*. This one will also answer the, &amp;quot;*&lt;strong&gt;&lt;em&gt;How much do I need to do this business full time?&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&amp;quot; Question.&lt;/em&gt; &lt;strong&gt;&lt;em&gt;It depends on your expenses.&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Psychology&lt;/strong&gt; - &lt;em&gt;Briefly. It&amp;#39;s a simple subject/debate. Quick paragraph because that&amp;#39;s really all there is to &amp;quot;Psychology of trading&amp;quot;&lt;/em&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I thought about writing this in a, &lt;strong&gt;&amp;quot;Letter to myself 2 years ago&amp;quot;&lt;/strong&gt; to potentially allow readers to read it vicariously like a letter to yourself written from yourself 2 years in the future but perhaps another time as a random post down the line.&lt;/p&gt;\n\n&lt;p&gt;There was consideration doing an &lt;strong&gt;AMA&lt;/strong&gt; but &lt;a href=\"https://www.reddit.com/r/Daytrading/wiki/getting-started-daytrading\"&gt;read The Wiki&lt;/a&gt; if you want my patterns. &lt;em&gt;(I&amp;#39;m a mod here, I wouldn&amp;#39;t mod a subreddit that suggests bad material. Everything to start you out is there. It&amp;#39;s fantastic info)&lt;/em&gt;. There&amp;#39;s also a few videos on my Twitter from last year.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Before I begin:&lt;/strong&gt; Trading unfortunately has the propensity to attract gamblers. The entry barrier is so low you could start trading against the pros off a few apps on your phone. Allow that to digest before putting any risk out there. Yes, most lose. But redo that statistic with ONLY people that have a proven business plan backed by statistics then redact those who didn&amp;#39;t follow the plan. If you have that with clear cut granular rules.. Fear is the only thing that will stop you from making this a healthy and respectable source of income. I would bet that the success rate would go north of 80%.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So we begin:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1) The Real Cost of Trading Full Time:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A)&lt;/strong&gt; I assume you know exactly what your expenses are &lt;em&gt;but for the sake of granularity.. let&amp;#39;s tackle the meat of everyday people:&lt;/em&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mortgage (PITI) / Rent&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Taxes on your house Home/Renters Insurance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health Insurance -&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car Note (P&amp;amp;I only)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car Insurance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car Preventative Maintenance (Oil, Transmission Fluid, Servicing, Registration/Inspection)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Gas&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Utilities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wifi&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;CellPhone Bill&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Groceries&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;And don&amp;#39;t dare forget about your retirement or kid&amp;#39;s 529 savings plan. Just because you trade stocks doesn&amp;#39;t mean you don&amp;#39;t need to invest. I do it. And yes it feels weird shorting NVDA for a day trade when that&amp;#39;s my heaviest allocation since 2018.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;(We&amp;#39;ll get to the biggest bamboozlement of them all in a while...Income taxes)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now add some ancillary things in there like: Gym membership, haircut, night out with S/O, gifts for family and friends birthdays, Christmas/Hanukah gifts, and other services but we&amp;#39;ll just calculate the necessities then play around with the numbers a bit:&lt;/p&gt;\n\n&lt;p&gt;For visuals: &lt;a href=\"https://imgur.com/a/2LMW8QI\"&gt;https://imgur.com/a/2LMW8QI&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;These are absolute necessities not including ancillary expenses for homeowners. Of course if you&amp;#39;re renting by yourself, with friends, or living at home, adjust for yourself. This isn&amp;#39;t including the income taxes you&amp;#39;ll pay at the end of the year.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So the grand total monthly expenses based on averages I found on Google based off of NerdWallet... $5,253. (Google it if you want. The article is from April 29th, 2021). Some consider savings and retirement to not be expenses but I&amp;#39;m not writing this to grasp at straws over trivial debates. This argument is, &amp;quot;There&amp;#39;s money that cannot be spent.. it&amp;#39;s an expense to yourself&amp;quot;.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll take that number from above and round it to $5,000. That&amp;#39;s way above mine given have the Texas Blue Title to my truck &lt;em&gt;(Chevy Runs Deep)&lt;/em&gt;, rent my home, don&amp;#39;t have health insurance.. &lt;a href=\"https://www.reddit.com/r/Daytrading/comments/ou2iws/full_time_traders_what_do_you_do_for_insurance/h70o062?utm_source=share&amp;amp;utm_medium=web2x&amp;amp;context=3\"&gt;Got some controversial replies on that one&lt;/a&gt; but hey, that&amp;#39;s my risk. God Blessed me and I don&amp;#39;t take it for granted.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ll tell you my monthly expenses although I feel its a little intrusive but I&amp;#39;m sure nobody I personally know reads my posts anyways. Just under $4,000/mo are my expenses for my necessities. Mind you... Single, Texas, Male, Minimalist, I loathe spending money, and I can have fun seeing if I can do more pushups than I did yesterday and throwing the baseball with my neighbor at the fields.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s compare on a monthly basis. (When I say life of a trader isn&amp;#39;t luxurious rather it is, &amp;quot;Comfortable&amp;quot;, I mean it whole-heartedly.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;AVG Monthly Expenses (USA)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/sPnQMcX\"&gt;https://imgur.com/a/sPnQMcX&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;AVG Monthly Expenses (Me)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/1FeQhUi\"&gt;https://imgur.com/a/1FeQhUi&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Average American Monthly Expenses. Of course this all varies from state to state. This could potentially be biased since I&amp;#39;m from Texas but it seemed decent to me. ****GRAND TOTAL:**** $5,085.&lt;/p&gt;\n\n&lt;p&gt;Now we&amp;#39;re starting to see the cutbacks I made to make a living from trading myself... No health insurance, I don&amp;#39;t drive anything crazy, no matching in my retirement plan from my 9-5, I barely drive anywhere, cheap liability (don&amp;#39;t give me a ticket) car insurance. ****GRAND TOTAL:**** $3,550 of necessities.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the psychology of all those numbers from above...&lt;/p&gt;\n\n&lt;p&gt;I assume you know &lt;a href=\"https://www.thebalance.com/risk-to-reward-ratio-1031350\"&gt;what an R is&lt;/a&gt;...&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s take the $5,000 number from earlier. Your monthly expenses that is. And we&amp;#39;re talking theoretical backtesting. *******NOT INCLUDING SLIPPAGE OR COMMISSIONS.*******&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;At $500 risk.&lt;/strong&gt; You would need to make 10R per month &lt;strong&gt;(EASY)&lt;/strong&gt; &lt;em&gt;(0.38R/day Avg. OR 1.9R/week)&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;At $400 risk.&lt;/strong&gt; You would need to make 12.5R per month &lt;strong&gt;(EASY)&lt;/strong&gt; &lt;em&gt;(0.59R/day Avg. OR 2.97R/week)&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;At $250 risk.&lt;/strong&gt; You would need to make 20R per month &lt;strong&gt;(Doable. Not guaranteed)&lt;/strong&gt; &lt;em&gt;(0.95R/day Avg. OR 4.76R/week)&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;At $100 risk.&lt;/strong&gt; You would need to make 50R per month &lt;strong&gt;(Not happening)&lt;/strong&gt; This is the risk amount I did when I resigned from my 9-5. Mind you I did personal training on the side.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;I can make 10R in a month easily. It&amp;#39;s happened in a day before&lt;/strong&gt;. &lt;a href=\"https://twitter.com/CJT2013/status/1366742864055664641\"&gt;But can you also handle potentially losing $500? Or being up 1.8R then having the trade come back and stopping you out?&lt;/a&gt; I can with $500 risk. Could I do that in 2019? &lt;strong&gt;Absolutely not&lt;/strong&gt;. I&amp;#39;d have a blood pressure so high due to materializing my trades with what COULD happen and what bills that COULD have been paid as soon as the trade filled. Now in 2021? I do it almost everyday when my edge is shown but that&amp;#39;s with years of statistics backing me. Have a look at my spreadsheet stats. I&amp;#39;ve had the same EV, Sharpe Ratio, Win Rate, key metrics, etc. for years.&lt;/p&gt;\n\n&lt;p&gt;&amp;lt;spreadsheet stats&amp;gt;: &lt;a href=\"https://imgur.com/a/6AFzQVV\"&gt;https://imgur.com/a/6AFzQVV&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is what helps my &amp;quot;Psychology&amp;quot; and &amp;quot;Headspace&amp;quot; going into trades. This isn&amp;#39;t something that can just be handed to you. It&amp;#39;s years (months for some) of filling everything out then slicing and dicing data to make it work. &amp;quot;It&amp;quot; being your style of trading. It may not be the most profitable but it&amp;#39;s something that you can manage mentally. It&amp;#39;s years of, &amp;quot;Why did I take that trade? What was I thinking? I don&amp;#39;t want to even fill it out. I won&amp;#39;t do it again.&amp;quot; Fill out every trade and things will distill down into a strategy that&amp;#39;s YOURS.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve built these over the years and they tell me the biggest run ups and drawdowns in a theoretical trading account. I know there will be months I make 5R after slippage and some months I make 35R... There will be days I&amp;#39;m up $2,750 in 5 minutes and other days I&amp;#39;m down $1,750 in less than 10 minutes... &lt;strong&gt;There are ALSO DAYS that turn into WEEKS that I don&amp;#39;t even touch an order ticket to put on a trade because you don&amp;#39;t make money putting on trades. You make money in this business by putting large sums of calculated risk on high EV trades.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Equity Curve Simulator I built:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/BBAyvuG\"&gt;https://imgur.com/a/BBAyvuG&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Visualize your data. It helps make things seem more real resulting in you honoring your business plan. If you&amp;#39;re a man of your word, prove it by following your rules from your mouth.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gone over how to handle losses before. It&amp;#39;s simple, it&amp;#39;s an expense just like Mark Douglas says.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Let&amp;#39;s drop the pessimistic scarcity mindset and forget how you handle losses. How do you handle profits?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Are you responsible with them? There&amp;#39;s this thing called, &lt;strong&gt;&amp;quot;Reversion to the mean&amp;quot;.&lt;/strong&gt; And we can utter the words, &amp;quot;Oh yeah I know there will be losses and good weeks&amp;quot; But do you sulk over 2 measly trades that ALMOST hit target but stopped you out? Do these 2 or 5 or 10 trades change how you trade forever? It shouldn&amp;#39;t but I see it on here all the time people pouting over such a small sample size of trades looking for advice. You do realize there will be times you get smacked around then the market goes quiet for a few weeks leaving you making zero deals for a while from time to time. Do you really care about those 2R or 5R or is it the money that was attached to it? That&amp;#39;s the loss side of things. The profiting side of things is different. People start to get cocky. I make more R than my theoretical testing occasionally because of missing trades (rarely). Does that mean I&amp;#39;m better than my backtesting? (You&amp;#39;ll never beat your backtesting. It&amp;#39;s impossible UNLESS you just so happen &amp;quot;miss&amp;quot; every losing trade your backtesting would have picked up).&lt;/p&gt;\n\n&lt;p&gt;With your extra profits/good weeks do you increase risk and or buy things you don&amp;#39;t need? &lt;em&gt;&amp;quot;I made $2,750 this week. I&amp;#39;ll cover your golf game/buy your lunch&amp;quot; &amp;lt;--Don&amp;#39;t be this guy. (Not speaking from experience either srs)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;•There will be weeks you make 13R&lt;/p&gt;\n\n&lt;p&gt;•There will be weeks you lose 5R&lt;/p&gt;\n\n&lt;p&gt;•There will be weeks you reach your limit down R&lt;/p&gt;\n\n&lt;p&gt;•There will be times after you hit your limit down that there are no deals/trades to be made for WEEKS. Plural. Not just 1 week. Sometimes 2 and rarely 3 weeks. Almost an entire month of no trades.&lt;/p&gt;\n\n&lt;p&gt;•There will be times where it seems like the market is handing you free money left and right to where you start to feel bad for people on the other side of your trades.&lt;/p&gt;\n\n&lt;p&gt;Trading isn&amp;#39;t a rose garden of free money, it will feel like that from time to time. It will also feel like an absolute money pit. But Central Limit Theorem / The Law of Large Numbers does its magic:&lt;/p&gt;\n\n&lt;p&gt;Actual vs Theory Performance &amp;amp; Growth-&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/Px4PGaT\"&gt;https://imgur.com/a/Px4PGaT&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;People have the propensity to look at their performance through a microscope rather than taking a step back to look at the big picture. That&amp;#39;s why it amazes me how people use such a small sample size of data (20 - 100 trades) then put large sums of risk on it. Only to pout about later INEVITABLE results. They complain over 2 trades. You will have tough weeks. Businesses do go through hard times and times of euphoria. Think of how people who rent beach houses in the winter vs summer.&lt;/p&gt;\n\n&lt;p&gt;The above picture is looking at the big picture. So let&amp;#39;s zoom in to the first 5 months:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/EHILbyq\"&gt;https://imgur.com/a/EHILbyq&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;How are you reacting when, &amp;quot;The market is beating my performance. I&amp;#39;d have done better if I just put my money in the market or sold CC&amp;#39;s. I&amp;#39;m only up $19,000 in 5 months when I should be up more than $30,000. I broke rules. I took more risk than I should have. I&amp;#39;ll stop while I&amp;#39;m ahead&amp;quot;. How do you react in the other 23 hours in the day after trades result in losses day after day?&lt;/p&gt;\n\n&lt;p&gt;This is the magic/beauty of Central Limit Theorem / The Law of Large Numbers:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/HYO51fu\"&gt;https://imgur.com/a/HYO51fu&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/GD1j79L\"&gt;https://imgur.com/a/GD1j79L&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I always say only 2 things can happen in a trade (hence its so EASY). Profit or loss. Heads or tails. This image is of 10 trials with 2 results. Think of the 10 trials like the 10 different times you start trading you strategy live. You might start with a hot streak or a streak of donations to Wall Street. Think of the 2 results as profit or loss. IN THE END. It all averages out, don&amp;#39;t be pathetic and pout over 2 or 10 trades resulting in a less than desirable sum&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So how do YOU decide how much you want to risk? Is it...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;How much you want to make in a month divided by an R per month goal? NO.. The market doesn&amp;#39;t know you. You can&amp;#39;t force R&amp;#39;s to happen. They come to you. There are entire 5 trading day weeks that I don&amp;#39;t touch an order ticket. It&amp;#39;s not everyday you make a deal.&lt;/li&gt;\n&lt;li&gt;How much you think you can mentally handle? Not the best idea but it&amp;#39;s a better idea.&lt;/li&gt;\n&lt;li&gt;A cocktail of metrics such as how much buying power you have, Risk of Ruin, EV, and Sharpe Ratio. &lt;em&gt;(Notice how I don&amp;#39;t care for Win-Rate? Win-Rate only tells/asks you 1 thing, &amp;quot;Can you handle being right or wrong this percentage of the time?&amp;quot;)&lt;/em&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If I had to make a rule of thumb for somebody who wants to decide if they are ready to trade full time. It would have to be reverse engineered:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You need to find what your EV is and I&amp;#39;ll show an example from a micro sample size of 10&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You really do require a large sum of data. I mean it when I say, &amp;quot;1,000 trades minimum or a full year of backtesting&amp;quot; (Full year because the market does shift but in the end does not effect a day trader&amp;#39;s performance... in MY experience in the long run). Those who get a random 20 or 50 or even 100 and think they&amp;#39;re ready to go up against professionals who have electricity bills higher than your yearly income because their computers are running algos and statistics 24/7...you&amp;#39;ll learn fast.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/ivfOxTo\"&gt;https://imgur.com/a/ivfOxTo&lt;/a&gt;:&lt;/p&gt;\n\n&lt;p&gt;6 trades that resulted in +2R. 4 trades that resulted in -1R. Average of all = 0.8.. &amp;quot;Expected&amp;quot; is just how statisticians say, &amp;quot;Average&amp;quot;. What this is saying is you can EXPECT 80¢ for every dollar you risk on the amount of trades you&amp;#39;re testing. This is why when I lose a trade OR profit on a trade. I don&amp;#39;t think, &amp;quot;Wow I made $958 after slippage.&amp;quot; or &amp;quot;Wow I lost $582 after slippage&amp;quot;. When I see my edge, I think to myself, &amp;quot;Ok there&amp;#39;s &amp;lt;EV&amp;gt; right there. I see income on every trade if it gets filled. Losing trades don&amp;#39;t bother me. I have contingency plans... And don&amp;#39;t ever say, &amp;quot;I won that trade&amp;quot;. Businesses that sell &amp;lt;something&amp;gt; don&amp;#39;t say, &amp;quot;Oh cool we won&amp;quot;. You don&amp;#39;t &amp;quot;Win&amp;quot; when you&amp;#39;re assuming a risk. Trading isn&amp;#39;t a game that you play.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2) Find how many trades on average you have. Let&amp;#39;s say weeks 1-4. You have 20 trades on the first week, 1 on the second week, 0 on the third week, and 7 on the last week. (I&amp;#39;m using a micro-size sample here again. You really need A LOT more)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/PWYSqsH\"&gt;https://imgur.com/a/PWYSqsH&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I can EXPECT 7 trades per week (ETW). IF I can expect 7 trades per week and each trade will result in 80¢ for every dollar I risk... Is this enough to cover my expenses AND TAXES SO THE GOVERNMENT CAN WASTE IT ON CRAP THAT DOESN&amp;#39;T HELP THE PEOPLE WHO PAY THEM.. and a little more so I can have a life outside of home. 7 trades per week * $100 risk * 0.8 per trade = Gross Income of $560&lt;/p&gt;\n\n&lt;p&gt;Maybe $560 (before taxes) is enough for you to survive. I don&amp;#39;t know you or your personal finances, that&amp;#39;s your business. For most.. it&amp;#39;s not. So let&amp;#39;s increase it to $250. For the sake of simplicity we know 250 ÷ 100 = 2.5. So $560 * 2.5 = $1,400 EXPECTED (not guaranteed) per week.. GROSS income. You&amp;#39;ll have to determine how much you need to set aside for taxes when you have that year of data that tells you what you can EXPECT to make that year. This seems more like it... I like this.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3) Does your account size and margin parameters allow for this?:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say you have $37,500 in your account that has 4:1 leverage which allows for $150,000 in DayTrading Buying Power...and you&amp;#39;re risking $250 a trade... Risk ÷ StopSize = Shares/Contracts to buy --&amp;gt; Shares to buy * Price = Capital&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Now let&amp;#39;s visualize the data:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/FFEsLK3\"&gt;https://imgur.com/a/FFEsLK3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The 2nd position wouldn&amp;#39;t have been able to be made. If you&amp;#39;re running into buying power issues in your backtesting, either reduce your risk or find what&amp;#39;s causing this. Perhaps it&amp;#39;s the type of style you&amp;#39;re trading or a certain pattern that has an inclination to exhaust buying power due to tight StopSizes (Tight StopSizes incur lots of slippage).&lt;/p&gt;\n\n&lt;p&gt;Now most would say, &amp;quot;Oh well I&amp;#39;ll run into that if that ever happens. It&amp;#39;s only 1 trade&amp;quot;. That&amp;#39;s 100% wrong. Your goal is to be 100% efficient and copy your backtesting to a T. Trust me, it will happen, you will miss trades due to complacency when you haven&amp;#39;t made a trade in over a week and you&amp;#39;re a little rusty. So again in conclusion to the buying power metric, adjust accordingly.&lt;/p&gt;\n\n&lt;p&gt;4) Risk of Ruin. Is it under 1%?&lt;/p&gt;\n\n&lt;p&gt;This is all discretionary. Me personally I want my RoR to be south of 0.25% but I&amp;#39;ve read many places that 1% is good. Probably just people repeating what everyone else says but that&amp;#39;s just my opinion. How do you calculate it? There&amp;#39;s a bunch of ways. &lt;a href=\"https://www.myfxbook.com/forex-calculators/risk-of-ruin-calculator\"&gt;There&lt;/a&gt; are a bunch of &lt;a href=\"https://2ndskiesforex.com/risk-of-ruin-calculator/\"&gt;different websites&lt;/a&gt; that do a pretty good job that tell it all for you. But if you want it for your spreadsheets so you can visualize it and see how it matures over time:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/95P9gy7\"&gt;RoR formula.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So there it is! In conclusion. You take how much you need. Find your EV, see how many trades on average you get per day, week, month, quarter, etc., then see what&amp;#39;s stopping you then assume that calculated risk by seeing what the odds of you failing are. That&amp;#39;s the meat of it at least. There are a bunch others such as:&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;Can you take that many trades and not miss any?&lt;/strong&gt; (It isn&amp;#39;t smart to be firing off 30 trades a day. I know there are those who do it but like I&amp;#39;ve written before.. decision fatigue gets real. There&amp;#39;s also a bunch of different ways to trade so I digress. Billions of dollars are exchanged between hands on NVDA on a daily basis. I might see 1 small edge on a 1&amp;#39; chart on 1 day out of the last 21 trading day month. Everyone sees fit trades all over the charts)&lt;/p&gt;\n\n&lt;p&gt;•&lt;strong&gt;Do you have an SOP for how you&amp;#39;ll identify and enter your trades based on statistics?&lt;/strong&gt; For example I only allow for 10% of my R to be slipped on the entry because on average I get slipped on my stop outs 0.07R. So a losing trade could lose me 1.17R meanwhile the profiting trades achieve 1.9-1.99R depending on how bad I was filled according to my order tickets parameters.&lt;/p&gt;\n\n&lt;p&gt;Take what info you got from your research and just pull the trigger. The market is liquid. A $50,000 position shouldn&amp;#39;t faze you if you sized your position accordingly and set your StopLoss. Trading is a business. Take the leap if you&amp;#39;re considering it. Just remember all the things you forfeit being independent from the normal job life. The market isn&amp;#39;t going anywhere so you do have time and the time will never feel right.&lt;/p&gt;\n\n&lt;p&gt;2) Psychology - ( 2 paragraphs is really all it is)&lt;/p&gt;\n\n&lt;p&gt;Although I can summarize that subject in 4-5 sentences: &amp;quot;Read a few trading books. Put the ideas on a spreadsheet and see the results. Now trust it, write a business plan, follow it, and trade it live if you like the backtest results.&amp;quot; How much psychology does one need when:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Price is Up or Down&lt;/li&gt;\n&lt;li&gt;P/L is Green or Red&lt;/li&gt;\n&lt;li&gt;Result is Profit or Loss&lt;/li&gt;\n&lt;li&gt;A ticker is Showing Edge or No Edge&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s Heads or Tails.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;But here&amp;#39;s the answer to your psychology of trading questions... You are crippling yourself when you trade money you CANNOT AFFORD to lose.&lt;/strong&gt; You&amp;#39;re uncomfortable risking money you can&amp;#39;t afford to lose and now want some tumblr quote to help you sleep better at night. We all become Steve Cohen/Paul Tudor Jones when it says, &amp;quot;Simulated Paper Trading&amp;quot; or when the screen has an orange trim around the perimeter. Trade live when you&amp;#39;re risking money you couldn&amp;#39;t care less about... Because that&amp;#39;s how it should be.... &lt;em&gt;But make sure you can respect it at the same time &amp;lt;- That&amp;#39;s an important one (srs). Anybody can hit dingers in a batting cage, shoot 3&amp;#39;s at an LA Fitness, or hit their 5iron 200+ yards at a driving range.. but when it becomes real, people fold.&lt;/em&gt; Done with that subject but I&amp;#39;m sure in 48 hours there will be a psychology post. If you want to improve this subreddit, just reply to those questions, &amp;quot;Trade with money you can afford to lose and not lose sleep over&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;All done. So I&amp;#39;ll leave it with this:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Think of my timeline from my first day as a full time trader. September 2019.&lt;/p&gt;\n\n&lt;p&gt;•That drawdown I had just 1 month in. No more cushion 9-5 income, no benefits, and the drawdowns happen. Just have a safety net and a StopLoss to start looking for a job if your account/savings go below a predetermined number.&lt;/p&gt;\n\n&lt;p&gt;•When you&amp;#39;ve got politicians proposing a 0.2% Financial Transaction Tax on all stock trades. Doesn&amp;#39;t sound like much to the average Joe but it would have destroyed any trading business. &lt;a href=\"https://twitter.com/CJT2013/status/1339254005223071746\"&gt;Take this trade&lt;/a&gt; for example if that FTT was put into effect:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DISH&lt;/strong&gt; - $33.30/share by 800 shares = $26,500 trade IN and ~$26,500 OUT | $53,000 moved.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TDOC&lt;/strong&gt; - $186.00/share by 158 shares = $30,000 trade IN and ~$30,000 OUT | $60,000 moved.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;SQ&lt;/strong&gt; - $223.25/share by 220 shares = $49,000 trade IN and ~$49,000 OUT | $98,000 moved.&lt;/p&gt;\n\n&lt;p&gt;That was a net slippage day meaning I hit break even losing 2R on 2 trades and gained 2R on 1 trade.. 0R but slippage caused me to lose roughly $100.. Now add that FTT... $211,000 * 0.002 = $422 with a 0.2% FTT. Politicians would have ended this business for me and I love what trading life has afforded me.. time.&lt;/p&gt;\n\n&lt;p&gt;•When March 2020 happened and the world shut down (Which put me in a position to start this thread). I couldn&amp;#39;t train in a gym anymore for extra cash. There goes a source of income for me. I learned fast needless to say. You never know what&amp;#39;s going to happen tomorrow. Me personally I leave it to God because it&amp;#39;s in His hands. That&amp;#39;s what helps take off the edge for me so whatever works for you, let it do its thing. There&amp;#39;s lots of uncertainty in this business (as with any business) so either take the leap or not, just do it right. Following a written plan and honoring it day after day feels like a marathon but you learn to trust it.&lt;/p&gt;\n\n&lt;p&gt;Until March 2022! &lt;em&gt;(I&amp;#39;ve got some more time in this business for me.)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;-CJT2013&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?auto=webp&amp;s=6e5a9868037085f8c89e6399712f4148c0dd7a97",
                                    "width": 1091,
                                    "height": 1159
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=2ac425c6ddd9a3f70e82f408c729dc1def32fe2b",
                                        "width": 108,
                                        "height": 114
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=297e4d803957e8562a1244795edc0f528c06cff0",
                                        "width": 216,
                                        "height": 229
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=cf8fde3839341618c26bedcfe85b35c8fca7f836",
                                        "width": 320,
                                        "height": 339
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=555a8655677f2702dd84dc55ae43735828101b9f",
                                        "width": 640,
                                        "height": 679
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=c49050e6dd4638af56eddd198459ae9439be59f0",
                                        "width": 960,
                                        "height": 1019
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4KxmwVn6-RSYRT1tDbfeAPo2ndk3JCnlnv3UWSs6Ubc.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=b037457bfa8abf10469fbb43df9ca5166ae180a9",
                                        "width": 1080,
                                        "height": 1147
                                    }
                                ],
                                "variants": {},
                                "id": "4AVw1X4nRcmtiA6GIQB8Z2DymQUAdcEkOFhEVaZhNr8"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "1bdc17c6-dd2a-11e9-a9f1-0ea1cbe31d64",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "mod",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": "moderator",
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#dadada",
                    "id": "pw7op3",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "CJT2013",
                    "discussion_type": null,
                    "num_comments": 47,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Daytrading/comments/pw7op3/part_4_after_4_years_day_trading_2_years_full/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/pw7op3/part_4_after_4_years_day_trading_2_years_full/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1632709025.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": "I have a good system for how to trade, and it's been pretty successful lately. But I am struggling with my execution sometimes, and I think it's due to decision fatigue. I want to eliminate some more of the unnecessary decisions and not have to think as much as I do right now. I hope some of you can share what's worked for you. I trade very fluidly, adapting to that morning and trend, so it involves a lot more decision making than something like \"take profit at $500 every time\". \n\nI imagine a good trading system to be a set of very detailed trade outlines, based on the several setups I trade. These outlines should clearly explain what makes a certain setup \"valid\", the way to take profits, problems that may be encountered (news or other outside circumstances that can affect the immediate move), and exceptional circumstances for each, because even identical setups have different results due to different context. Should I try with a notebook, index cards, or some use of software that makes it more visual, etc? I was considering a flow chart but it grew faster than I expected with the decisions involved. I might try it again but I paused that for now. Maybe there's another way or software I am not aware of.\n\nDoes anyone have some tips for me? I've been making a lot of progress but leaving some of the decision making to memory is definitely causing me to have some inconsistencies lately. I really want to fix this issue. Thanks for any helpful comments/DMs!",
                    "author_fullname": "t2_2bpp3to5",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Daytraders with several very clear setups, how do you organize your trading plan?",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "advice"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_sfqtaz",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.89,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 35,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "advice",
                    "can_mod_post": false,
                    "score": 35,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1643487831.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Daytrading",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a good system for how to trade, and it&amp;#39;s been pretty successful lately. But I am struggling with my execution sometimes, and I think it&amp;#39;s due to decision fatigue. I want to eliminate some more of the unnecessary decisions and not have to think as much as I do right now. I hope some of you can share what&amp;#39;s worked for you. I trade very fluidly, adapting to that morning and trend, so it involves a lot more decision making than something like &amp;quot;take profit at $500 every time&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I imagine a good trading system to be a set of very detailed trade outlines, based on the several setups I trade. These outlines should clearly explain what makes a certain setup &amp;quot;valid&amp;quot;, the way to take profits, problems that may be encountered (news or other outside circumstances that can affect the immediate move), and exceptional circumstances for each, because even identical setups have different results due to different context. Should I try with a notebook, index cards, or some use of software that makes it more visual, etc? I was considering a flow chart but it grew faster than I expected with the decisions involved. I might try it again but I paused that for now. Maybe there&amp;#39;s another way or software I am not aware of.&lt;/p&gt;\n\n&lt;p&gt;Does anyone have some tips for me? I&amp;#39;ve been making a lot of progress but leaving some of the decision making to memory is definitely causing me to have some inconsistencies lately. I really want to fix this issue. Thanks for any helpful comments/DMs!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "60b87564-3190-11ea-812e-0e318b890fdd",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "sfqtaz",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "gdenko",
                    "discussion_type": null,
                    "num_comments": 46,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Daytrading/comments/sfqtaz/daytraders_with_several_very_clear_setups_how_do/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/sfqtaz/daytraders_with_several_very_clear_setups_how_do/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1643487831.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Daytrading",
                    "selftext": "First of all, I want to thank CJ the mod on here for his posts. I recently read some of his posts and they are invaluable. One thing that struck me is the “decision fatigue” he mentioned in one of his posts. I had a suspicion of this with my trading but didn’t think it was real. I started learning about trading around 2012. I bought some “gurus” materials which were basically whole bunch of indicators. After a little while without success, I realized that I wanted to learn the meat and bones of the market. So I ended up finding a price action course which I felt much better about. \n\nI paper traded the new system for about a year and learned more about the system before quitting it all. It’s a good system that works if you trade it properly. For the next several years years I’d pick up trading again for a couple months and then quit again several times. What I noticed is that every time I started trading after taking a long break, I would do well. But as weeks past by, I would start doing bad and then quit. \n\nThis past August I started again until now still going. Again, I was doing well until the last 3 weeks and especially the past 2 has been bad. Just taking bad trades. I trade live 1 futures MES contract for about the first hour after open using a 950 tick chart. My max risk is 8 ticks for a 10 tick profit. \n\nAny advice on how to get back on track? Take a big break? Would you call this decision fatigue?",
                    "author_fullname": "t2_t57dknj",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Wanted to share about my progress day trading and take any advice given.",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "advice"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Daytrading",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_qdxzmu",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.87,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 6,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "advice",
                    "can_mod_post": false,
                    "score": 6,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1634964186.0,
                    "link_flair_type": "richtext",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Daytrading",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I want to thank CJ the mod on here for his posts. I recently read some of his posts and they are invaluable. One thing that struck me is the “decision fatigue” he mentioned in one of his posts. I had a suspicion of this with my trading but didn’t think it was real. I started learning about trading around 2012. I bought some “gurus” materials which were basically whole bunch of indicators. After a little while without success, I realized that I wanted to learn the meat and bones of the market. So I ended up finding a price action course which I felt much better about. &lt;/p&gt;\n\n&lt;p&gt;I paper traded the new system for about a year and learned more about the system before quitting it all. It’s a good system that works if you trade it properly. For the next several years years I’d pick up trading again for a couple months and then quit again several times. What I noticed is that every time I started trading after taking a long break, I would do well. But as weeks past by, I would start doing bad and then quit. &lt;/p&gt;\n\n&lt;p&gt;This past August I started again until now still going. Again, I was doing well until the last 3 weeks and especially the past 2 has been bad. Just taking bad trades. I trade live 1 futures MES contract for about the first hour after open using a 950 tick chart. My max risk is 8 ticks for a 10 tick profit. &lt;/p&gt;\n\n&lt;p&gt;Any advice on how to get back on track? Take a big break? Would you call this decision fatigue?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "60b87564-3190-11ea-812e-0e318b890fdd",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qxlo",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "qdxzmu",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "vlad546",
                    "discussion_type": null,
                    "num_comments": 15,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Daytrading/comments/qdxzmu/wanted_to_share_about_my_progress_day_trading_and/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Daytrading/comments/qdxzmu/wanted_to_share_about_my_progress_day_trading_and/",
                    "subreddit_subscribers": 3791009,
                    "created_utc": 1634964186.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}