{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 2,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "DMAcademy",
                    "selftext": "I don't want this to sound like a [r/reationship](https://www.reddit.com/r/reationship/) post, but I want to give you all a little background. A little understanding as to why this is so important to me and why I **can't not** DM a game, despite all my shortcomings.\n\nMy wife and I have been together for 16 years, since we were both about 15. She is the single most important thing in my life. Because of Covid, our usual DnD game has been suspended for the foreseeable future. We haven't had a game since February and it is breaking my wife's heart. She works so hard every day in an incredibly stressful job and spends her nights listening to DnD liveplay podcasts. She talks about how badly she wishes she could play again.\n\nRecently, she asked me if I would be willing to DM a game with a small number of our closest friends (who will play remotely). I was sure she was joking. She kept asking and I realized she was serious. I realized that in 16 years, this is the second biggest thing she as ever asked me to do. The first being when she asked ME to marry her. My wife, sweet, smart, and endlessly compassionate, doesn't ask me for anything, ***ever.*** This must be important to her.\n\nI agreed. I agreed because I lost my job due to the pandemic and I can, will, and want to do this for her. She deserves to be happy and I want to take as much of the burden of the real world off of her shoulders as I can. Especially because I am not contributing as much as I was when I had a job.\n\nThe problem is: I am not a smart person. I am not quick or very clever. That joke, \"DnD is all math and improv!\" -- I put two math teachers into retirement (not kidding). I made my high school drama teacher cry laughing -- in a very bad way. But my wife, being the amazing person she is, thinks I can do anything. I know better and I am not confident I can run an interesting/fun game. If it matters, I am also dyslexic and it can be embarrassing to talk at length. It fusses with my language center of my head and that doesn't mesh well with a fantasy setting with fantasy names.\n\nI am reading the core books cover-to-cover and am actively researching how to DM. I am devoting a few hours a day to studying online resources. I have audiobooks to listen to while I am doing my chores. I want to do well. I have a little experience with DnD especially and two years with a paper RPG. That, I am discovering, is woefully little enough to take on the task of being a DM.\n\nI feel good about storytelling and NPC creation. I am trying to bring in interesting elements of science and philosophy I know my players would find interesting. I like creative writing and actively enjoy worldbuilding.\n\nI feel terrified of keeping rules in my head, the math involved, and managing a game with three players who will derail any plans I make. I am not quick on my feet.\n\n**I apologize. This got long.**\n\n**tl;dr**: dumbass needs help DMing to prove love and commitment to an amazing woman.\n\nAny thoughts? Ideas? Maybe a little reassurances or hard truths?\n\nThank you so much for reading.\n\n&amp;#x200B;\n\n**EDIT:**\n\nI am going to be honest. I posted this just before bed and rolled over five minutes later, feeling self-conscious about spilling my guts out, and *thought* I deleted this post. When I woke up this morning, my wife rushed into the bedroom to tell me she found this and that I had over 200 replies. I poured a huge cup of coffee, sat down, and read them **all.**\n\nNot going to lie, I am overwhelmed in the best way. The outpouring of support is more than I could have ever expected. I am blown away by the number of people offering to talk with me personally. That is amazing and so very, very thoughtful. From the bottom of my heart: Thank you, every single one of you who took the time to read this and reply. I want to reply to each and every one of you. With so many replies, I won't be able to. Know that I have read them all!\n\n**In response to the advice you all have been so kind to offer:**\n\nI did run a series of two-hour-long-ish games with just my wife with a very simple goal. I had her solve a murder mystery, role-play heavy. I hardly prepared at all, with just NPC names and a *very* general idea, as a test to see if I could think on my feet with each of her decisions. It went very well! At least she says so. As many of you have said, I did fuck up and make mistakes. It was so much easier with just her. I learned a lot in such a short time and it confirmed what many of you have said: She either didn't notice the fuck-ups or didn't care. She got to be a hero and that's all that mattered to her.\n\nIn response to relying on other players with rules, etc. One of my players *is a DM* of her own game. I didn't realize how focused I was on how she might think of me negatively that it didn't occur to me that I might instead lean on her expertise. In speaking with her, I found out she doesn't to any prep work at all, save downing several glasses of wine. The fact that I have basic lore for this world is blowing her mind. That might be what spurred me on to prep *more* to impress her. Thanks to all of you, I will let that go. It will be a fun game either way.\n\nYou all are very right. One player is my wife, the other is her best friend, and the other is our closest friend. They know me and will understand if I flub a word or take time to think. They have all seen me toasted on whiskey at 3am and going off on facts about shipwrecks; I doubt they will concentrate on a mispronounced word or two. Mistakes are going to happen and I can't let the fact that I am *a bit* (haha, a huge one) of a perfectionist get in the way.\n\nIn a similar vein, these are my closest friends. I know what media they have consumed and what they like to see in a story. I am lucky to know that one player wants to be an All Might-like hero, another wants to have a complex character with challenged morals, and another wants to get sauced and socialize. In regards to stealing ideas: I am totally doing that. With players who love both high fantasy and sci-fi epics, I want to be able to give them the best of both worlds. All three of them love stories with deep lore and twists, which I believe I can bring to the table.\n\nI have asked my players what they would like from this game. Hilariously, I received three different replies. My wife wants to roleplay and laugh, another wants a hack and slash, and the third hardly cares. I will try my best to mix it up!\n\nOne thing that did surprise me is how many replies told me not to over-prep my games. I didn't realize how that might become a real problem. In one way, I am trying to do that. I am setting it up for a number of options for the players, while also realizing that they might not take any of them. I am trying my very, very best not to railroad them into my preconstructed ideas. Three very creative players at my table is daunting; they will take me by surprise. I am prepared to laugh and make it silly. I really do hope they give me stories to tell about how they circumvented my plans with truly amazing feats of roundabout thinking. I was mainly worried about 'decision fatigue' and bringing down the mood of the game.\n\nAnother surprise was how many of you told me not to focus on the books! Thanks to the fact that I have listened to the DnD liveplays with my wife over and over again, I do have an understanding on how the game functions. You were all right: I was putting DMs on a pedestal. Trying my best and allowing lots of flexibility will get me to the goal -- a fun and engaging game.\n\nMany replies said to start small. I hear you 100%!! That is technically the game plan as it stands now. I have a whole 'arc zero' of about two to five games with the expressed purpose of getting to know my players. There is a really simple goal planned: find cave, find the missing heiress, find the mystery of the main story. The next arc is similar; help the refugees find medicine and hunt down a thief. After that, I am hoping it can build into plenty of chances to battle and roleplay.\n\n***Yes, my wife found this post***. *Immediately.* She assured me that I am not an idiot and I will always listen to her when she talks with me with that open heart of hers. She also cried from fuzzy feelings. I told her all about how dedicated I am a while back, but seeing it in words made her realize how committed I am. I won't treat this game like a chore, but I will take the goal of making her happy as my greatest motivation.\n\n**Extra edit:** \n\nMy wonderful bride bought me lunch today as a thank you and told me flat-out not to put too much pressure on myself. I will redirect my brain away from all my worries and just allow myself to do the best I can and have as much fun as possible! ",
                    "author_fullname": "t2_7xg6alfs",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "My wife has asked me to DM a game and she deserves to be happy. Problem is, I am not very smart. DM advice?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/DMAcademy",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_jxitnn",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 0.98,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3089,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Need Advice",
                    "can_mod_post": false,
                    "score": 3089,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1605897326.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1605847878.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.DMAcademy",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want this to sound like a &lt;a href=\"https://www.reddit.com/r/reationship/\"&gt;r/reationship&lt;/a&gt; post, but I want to give you all a little background. A little understanding as to why this is so important to me and why I &lt;strong&gt;can&amp;#39;t not&lt;/strong&gt; DM a game, despite all my shortcomings.&lt;/p&gt;\n\n&lt;p&gt;My wife and I have been together for 16 years, since we were both about 15. She is the single most important thing in my life. Because of Covid, our usual DnD game has been suspended for the foreseeable future. We haven&amp;#39;t had a game since February and it is breaking my wife&amp;#39;s heart. She works so hard every day in an incredibly stressful job and spends her nights listening to DnD liveplay podcasts. She talks about how badly she wishes she could play again.&lt;/p&gt;\n\n&lt;p&gt;Recently, she asked me if I would be willing to DM a game with a small number of our closest friends (who will play remotely). I was sure she was joking. She kept asking and I realized she was serious. I realized that in 16 years, this is the second biggest thing she as ever asked me to do. The first being when she asked ME to marry her. My wife, sweet, smart, and endlessly compassionate, doesn&amp;#39;t ask me for anything, &lt;strong&gt;&lt;em&gt;ever.&lt;/em&gt;&lt;/strong&gt; This must be important to her.&lt;/p&gt;\n\n&lt;p&gt;I agreed. I agreed because I lost my job due to the pandemic and I can, will, and want to do this for her. She deserves to be happy and I want to take as much of the burden of the real world off of her shoulders as I can. Especially because I am not contributing as much as I was when I had a job.&lt;/p&gt;\n\n&lt;p&gt;The problem is: I am not a smart person. I am not quick or very clever. That joke, &amp;quot;DnD is all math and improv!&amp;quot; -- I put two math teachers into retirement (not kidding). I made my high school drama teacher cry laughing -- in a very bad way. But my wife, being the amazing person she is, thinks I can do anything. I know better and I am not confident I can run an interesting/fun game. If it matters, I am also dyslexic and it can be embarrassing to talk at length. It fusses with my language center of my head and that doesn&amp;#39;t mesh well with a fantasy setting with fantasy names.&lt;/p&gt;\n\n&lt;p&gt;I am reading the core books cover-to-cover and am actively researching how to DM. I am devoting a few hours a day to studying online resources. I have audiobooks to listen to while I am doing my chores. I want to do well. I have a little experience with DnD especially and two years with a paper RPG. That, I am discovering, is woefully little enough to take on the task of being a DM.&lt;/p&gt;\n\n&lt;p&gt;I feel good about storytelling and NPC creation. I am trying to bring in interesting elements of science and philosophy I know my players would find interesting. I like creative writing and actively enjoy worldbuilding.&lt;/p&gt;\n\n&lt;p&gt;I feel terrified of keeping rules in my head, the math involved, and managing a game with three players who will derail any plans I make. I am not quick on my feet.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I apologize. This got long.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: dumbass needs help DMing to prove love and commitment to an amazing woman.&lt;/p&gt;\n\n&lt;p&gt;Any thoughts? Ideas? Maybe a little reassurances or hard truths?&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for reading.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I am going to be honest. I posted this just before bed and rolled over five minutes later, feeling self-conscious about spilling my guts out, and &lt;em&gt;thought&lt;/em&gt; I deleted this post. When I woke up this morning, my wife rushed into the bedroom to tell me she found this and that I had over 200 replies. I poured a huge cup of coffee, sat down, and read them &lt;strong&gt;all.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Not going to lie, I am overwhelmed in the best way. The outpouring of support is more than I could have ever expected. I am blown away by the number of people offering to talk with me personally. That is amazing and so very, very thoughtful. From the bottom of my heart: Thank you, every single one of you who took the time to read this and reply. I want to reply to each and every one of you. With so many replies, I won&amp;#39;t be able to. Know that I have read them all!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In response to the advice you all have been so kind to offer:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I did run a series of two-hour-long-ish games with just my wife with a very simple goal. I had her solve a murder mystery, role-play heavy. I hardly prepared at all, with just NPC names and a &lt;em&gt;very&lt;/em&gt; general idea, as a test to see if I could think on my feet with each of her decisions. It went very well! At least she says so. As many of you have said, I did fuck up and make mistakes. It was so much easier with just her. I learned a lot in such a short time and it confirmed what many of you have said: She either didn&amp;#39;t notice the fuck-ups or didn&amp;#39;t care. She got to be a hero and that&amp;#39;s all that mattered to her.&lt;/p&gt;\n\n&lt;p&gt;In response to relying on other players with rules, etc. One of my players &lt;em&gt;is a DM&lt;/em&gt; of her own game. I didn&amp;#39;t realize how focused I was on how she might think of me negatively that it didn&amp;#39;t occur to me that I might instead lean on her expertise. In speaking with her, I found out she doesn&amp;#39;t to any prep work at all, save downing several glasses of wine. The fact that I have basic lore for this world is blowing her mind. That might be what spurred me on to prep &lt;em&gt;more&lt;/em&gt; to impress her. Thanks to all of you, I will let that go. It will be a fun game either way.&lt;/p&gt;\n\n&lt;p&gt;You all are very right. One player is my wife, the other is her best friend, and the other is our closest friend. They know me and will understand if I flub a word or take time to think. They have all seen me toasted on whiskey at 3am and going off on facts about shipwrecks; I doubt they will concentrate on a mispronounced word or two. Mistakes are going to happen and I can&amp;#39;t let the fact that I am &lt;em&gt;a bit&lt;/em&gt; (haha, a huge one) of a perfectionist get in the way.&lt;/p&gt;\n\n&lt;p&gt;In a similar vein, these are my closest friends. I know what media they have consumed and what they like to see in a story. I am lucky to know that one player wants to be an All Might-like hero, another wants to have a complex character with challenged morals, and another wants to get sauced and socialize. In regards to stealing ideas: I am totally doing that. With players who love both high fantasy and sci-fi epics, I want to be able to give them the best of both worlds. All three of them love stories with deep lore and twists, which I believe I can bring to the table.&lt;/p&gt;\n\n&lt;p&gt;I have asked my players what they would like from this game. Hilariously, I received three different replies. My wife wants to roleplay and laugh, another wants a hack and slash, and the third hardly cares. I will try my best to mix it up!&lt;/p&gt;\n\n&lt;p&gt;One thing that did surprise me is how many replies told me not to over-prep my games. I didn&amp;#39;t realize how that might become a real problem. In one way, I am trying to do that. I am setting it up for a number of options for the players, while also realizing that they might not take any of them. I am trying my very, very best not to railroad them into my preconstructed ideas. Three very creative players at my table is daunting; they will take me by surprise. I am prepared to laugh and make it silly. I really do hope they give me stories to tell about how they circumvented my plans with truly amazing feats of roundabout thinking. I was mainly worried about &amp;#39;decision fatigue&amp;#39; and bringing down the mood of the game.&lt;/p&gt;\n\n&lt;p&gt;Another surprise was how many of you told me not to focus on the books! Thanks to the fact that I have listened to the DnD liveplays with my wife over and over again, I do have an understanding on how the game functions. You were all right: I was putting DMs on a pedestal. Trying my best and allowing lots of flexibility will get me to the goal -- a fun and engaging game.&lt;/p&gt;\n\n&lt;p&gt;Many replies said to start small. I hear you 100%!! That is technically the game plan as it stands now. I have a whole &amp;#39;arc zero&amp;#39; of about two to five games with the expressed purpose of getting to know my players. There is a really simple goal planned: find cave, find the missing heiress, find the mystery of the main story. The next arc is similar; help the refugees find medicine and hunt down a thief. After that, I am hoping it can build into plenty of chances to battle and roleplay.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Yes, my wife found this post&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Immediately.&lt;/em&gt; She assured me that I am not an idiot and I will always listen to her when she talks with me with that open heart of hers. She also cried from fuzzy feelings. I told her all about how dedicated I am a while back, but seeing it in words made her realize how committed I am. I won&amp;#39;t treat this game like a chore, but I will take the goal of making her happy as my greatest motivation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Extra edit:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;My wonderful bride bought me lunch today as a thank you and told me flat-out not to put too much pressure on myself. I will redirect my brain away from all my worries and just allow myself to do the best I can and have as much fun as possible! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "9815c3fc-e727-11ea-9028-0ed1695d6d69",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3f611",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#00a6a5",
                    "id": "jxitnn",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "apathyacres",
                    "discussion_type": null,
                    "num_comments": 399,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/DMAcademy/comments/jxitnn/my_wife_has_asked_me_to_dm_a_game_and_she/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/DMAcademy/comments/jxitnn/my_wife_has_asked_me_to_dm_a_game_and_she/",
                    "subreddit_subscribers": 640650,
                    "created_utc": 1605847878.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "DMAcademy",
                    "selftext": "“Inspired by a Tumblr post, I’d like to play a “Dork” magician. Instead of a dark magician. I usually play characters specifically to avoid the complicated ness and decision fatigue of using spells and magic, but I’d like to give it a try.\n\nSo if you have any funny ideas that sound related I’d love to hear them! Thinking of making them human.”\n \nthis is what they were thinking, any silly dorky spells they should have or combination of spells \n\nTIA, i am a new dm who has run a ranger and paladin character so i am a bit inexperienced to help w this \n\nalso we are running the lost mines of Phandalin!",
                    "author_fullname": "t2_bjnyv72",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "player wants to run a dorky wizard who is perceived as dorky and dumb but takes themselves seriously",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/DMAcademy",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_125zybu",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 0.66,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Need Advice: Other",
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1680122226.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.DMAcademy",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;“Inspired by a Tumblr post, I’d like to play a “Dork” magician. Instead of a dark magician. I usually play characters specifically to avoid the complicated ness and decision fatigue of using spells and magic, but I’d like to give it a try.&lt;/p&gt;\n\n&lt;p&gt;So if you have any funny ideas that sound related I’d love to hear them! Thinking of making them human.”&lt;/p&gt;\n\n&lt;p&gt;this is what they were thinking, any silly dorky spells they should have or combination of spells &lt;/p&gt;\n\n&lt;p&gt;TIA, i am a new dm who has run a ranger and paladin character so i am a bit inexperienced to help w this &lt;/p&gt;\n\n&lt;p&gt;also we are running the lost mines of Phandalin!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "3a42fcce-78a6-11ec-a5d8-5efdb87b66fb",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3f611",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#007373",
                    "id": "125zybu",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "civilmick",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/DMAcademy/comments/125zybu/player_wants_to_run_a_dorky_wizard_who_is/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/DMAcademy/comments/125zybu/player_wants_to_run_a_dorky_wizard_who_is/",
                    "subreddit_subscribers": 640650,
                    "created_utc": 1680122226.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}