{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 3,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "financialindependence",
                    "selftext": "TL:DR - pursuing FI has been great, but am now overwhelmed with how much there is that I can do with my life. It's causing decision fatigue. How do other people cope?\n\n&amp;#x200B;\n\nLike many other people who pursue financial independence, I enjoy planning things. While I'm old enough now to know that \"the best-laid plans of mice and men often go awry\", I've always been someone who enjoys thinking about what my available options are, deciding what I want and how to go about it, and making that happen over the medium or long-term. This has been a helpful trait in pursuing FI, and I'm glad to be inclined in this way.\n\n&amp;#x200B;\n\nHowever...I'm finding in the past couple years that I'm almost stressed out by all the additional options for what to do with my life that pursuing FI has given me. \n\n&amp;#x200B;\n\nWhen I was young, I felt that I had few options except to roll up my sleeves and grind it out in my choice of career - it was my only way of getting a financial base and building a life for myself. I didn't have an impoverished upbringing or anything, but I did have parents who maybe didn't have the best mindset about money. I wanted a career and I wanted financial stability in a way that they didn't really believe was possible. So, to me, the choice was simple - \"work and build wealth\" as much as I could in order to build a future for myself, or \"be careless and build nothing\", living from hand-to-mouth and not building any sort of future. For me, the choice was obvious.\n\n&amp;#x200B;\n\nNow, years later, we have a solid financial base in our lives. We will certainly be able to retire early if we choose, and we can combine that with some other fun adventures if we are smart about it. However, while I'm incredibly grateful to have the opportunities I have, I increasingly feel overwhelmed by all the things I COULD choose to do with my life. \n\n&amp;#x200B;\n\nShould I stay in my job another 5 years, or another 10 years, or another 15 years? Should I stay in my career and keep grinding it out, or try to pursue any passion projects? Should I try to write a book? Should I take a sabbatical and travel around the world? Should I stay in my city or move to the country? Should I get a vacation house? Should I try to leave the country during the colder months ever year? (I'm in Canada, winters are cold.) Should I look at getting a bigger house? A custom house? A smaller house? What do I want???\n\n&amp;#x200B;\n\nA lot of this is just human psychology - I think of [Dan Gilbert's TED talk](https://www.ted.com/talks/dan_gilbert_the_surprising_science_of_happiness) on happiness, and how having more options to choose from can be a source of stress. The whole idea that the company that sells three kinds of jam will sell more jam than the company that makes seventeen kinds of jam. I also enjoyed [Mark Manson's book](https://markmanson.net/books/subtle-art), and agree with his conclusion that people don't have this \"one passion\" in their lives that they need to be \"true to\" - there are many things we can do with our lives and there will always be upsides and downsides to whatever path we choose, and it's important to accept and be OK with that.\n\n&amp;#x200B;\n\nSo I've gotten my head around all that, but I'm still having trouble with strategies to cope with all of the new decisions that pursuing FI allows you to make. To other people pursuing FI - do you sometimes get overwhelmed with the sheer amount of options available in your life? If so, how do you keep your journey focused? How do you decide on one course of action and not get overwhelmed with the dozen other things that you could also do instead?",
                    "author_fullname": "t2_2pl87guw",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "FIRE and decision fatigue -",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/financialindependence",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_hy9nya",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.91,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 463,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 463,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1595780336.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.financialindependence",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL:DR - pursuing FI has been great, but am now overwhelmed with how much there is that I can do with my life. It&amp;#39;s causing decision fatigue. How do other people cope?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Like many other people who pursue financial independence, I enjoy planning things. While I&amp;#39;m old enough now to know that &amp;quot;the best-laid plans of mice and men often go awry&amp;quot;, I&amp;#39;ve always been someone who enjoys thinking about what my available options are, deciding what I want and how to go about it, and making that happen over the medium or long-term. This has been a helpful trait in pursuing FI, and I&amp;#39;m glad to be inclined in this way.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;However...I&amp;#39;m finding in the past couple years that I&amp;#39;m almost stressed out by all the additional options for what to do with my life that pursuing FI has given me. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;When I was young, I felt that I had few options except to roll up my sleeves and grind it out in my choice of career - it was my only way of getting a financial base and building a life for myself. I didn&amp;#39;t have an impoverished upbringing or anything, but I did have parents who maybe didn&amp;#39;t have the best mindset about money. I wanted a career and I wanted financial stability in a way that they didn&amp;#39;t really believe was possible. So, to me, the choice was simple - &amp;quot;work and build wealth&amp;quot; as much as I could in order to build a future for myself, or &amp;quot;be careless and build nothing&amp;quot;, living from hand-to-mouth and not building any sort of future. For me, the choice was obvious.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Now, years later, we have a solid financial base in our lives. We will certainly be able to retire early if we choose, and we can combine that with some other fun adventures if we are smart about it. However, while I&amp;#39;m incredibly grateful to have the opportunities I have, I increasingly feel overwhelmed by all the things I COULD choose to do with my life. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Should I stay in my job another 5 years, or another 10 years, or another 15 years? Should I stay in my career and keep grinding it out, or try to pursue any passion projects? Should I try to write a book? Should I take a sabbatical and travel around the world? Should I stay in my city or move to the country? Should I get a vacation house? Should I try to leave the country during the colder months ever year? (I&amp;#39;m in Canada, winters are cold.) Should I look at getting a bigger house? A custom house? A smaller house? What do I want???&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;A lot of this is just human psychology - I think of &lt;a href=\"https://www.ted.com/talks/dan_gilbert_the_surprising_science_of_happiness\"&gt;Dan Gilbert&amp;#39;s TED talk&lt;/a&gt; on happiness, and how having more options to choose from can be a source of stress. The whole idea that the company that sells three kinds of jam will sell more jam than the company that makes seventeen kinds of jam. I also enjoyed &lt;a href=\"https://markmanson.net/books/subtle-art\"&gt;Mark Manson&amp;#39;s book&lt;/a&gt;, and agree with his conclusion that people don&amp;#39;t have this &amp;quot;one passion&amp;quot; in their lives that they need to be &amp;quot;true to&amp;quot; - there are many things we can do with our lives and there will always be upsides and downsides to whatever path we choose, and it&amp;#39;s important to accept and be OK with that.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ve gotten my head around all that, but I&amp;#39;m still having trouble with strategies to cope with all of the new decisions that pursuing FI allows you to make. To other people pursuing FI - do you sometimes get overwhelmed with the sheer amount of options available in your life? If so, how do you keep your journey focused? How do you decide on one course of action and not get overwhelmed with the dozen other things that you could also do instead?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/fh4jbwI06v-n9gbyVYLQCrDwQ-2Pr1V9WPNxpnVdGJw.jpg?auto=webp&amp;s=d574c65f3a1f613f9944055868ade0ea055fedb0",
                                    "width": 560,
                                    "height": 420
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/fh4jbwI06v-n9gbyVYLQCrDwQ-2Pr1V9WPNxpnVdGJw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=f3d0e58652c9d0abfe0fcc73236e7d7565375ef2",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/fh4jbwI06v-n9gbyVYLQCrDwQ-2Pr1V9WPNxpnVdGJw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=99994e0a72a932624f021349e856281b297b201d",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/fh4jbwI06v-n9gbyVYLQCrDwQ-2Pr1V9WPNxpnVdGJw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=f6bee72aca8b3c762c5b5c13599302e7c31fe4c9",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {},
                                "id": "qboNxQkBwNFKvApcS-ELbYPfr7G1ptUCRdpjGUiBcn4"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2t34z",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "hy9nya",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "FIRE_At_Llama_Speed",
                    "discussion_type": null,
                    "num_comments": 120,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/financialindependence/comments/hy9nya/fire_and_decision_fatigue/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/financialindependence/comments/hy9nya/fire_and_decision_fatigue/",
                    "subreddit_subscribers": 2265171,
                    "created_utc": 1595780336.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "financialindependence",
                    "selftext": "So it's been a full year since I've been RE and wanted to give a quick update on my [original post](https://www.reddit.com/r/financialindependence/comments/adj08l/35_11m_luck_stumbles_dedication_and_thrift_an_11/). Spoiler: I'm loving the FIRE and don't have any plan to go back to work at all!  I've put the TL;DR up front, but I've got a lot more details below if you're interested in reading those!\n\n* After taking an 11 month Leave of Absence, I officially gave my notice and my last day of employment was in early January.\n* My net worth went from $1.10M to $1.40M with a few paychecks, cashing out a ton of PTO, a small annual bonus, and a surging stock market. With my current budget of $33K/year, this would amount to a 2.37% withdrawal rate, which for someone who is risk averse (especially given the long bull run in the past decade and valuations where they are currently at) is very comforting.\n* 2019 Actual budget was only $500 above planned and I found that a lot of my planned budget categories costs were higher than my actual spend.\n* Overall, I'm extremely happy with my decision to RE - I can spend more time with my hobbies, friends, and [pursue things that are bringing more meaning to my life](https://www.reddit.com/r/financialindependence/comments/dbcrtr/giving_after_fire_1_month_volunteering_at_summer/). I know there have been a few recent posts about not being happy after RE, but I'm truly enjoying all of it and not finding any boredom whatsoever!\n* I applied and got accepted to a second LGBT summer camp as a cabin counselor! I've got 3 days at a spring camp, 3 weeks with Summer Camp #1, and 5 weeks with Summer Camp #2.  With training for each of the camps, it'll be 68 days of volunteering this summer!\n* Major goal this is to get better at climbing (leading sport and trad climbs outdoor at 5.10b-5.10d level) so I can apply to be an outdoor instructor at Outward Bound or NOLS (National Outdoor Leadership School).\n\nIn the rest of the post I will cover the following topics: Major FIRE actions, Quality of Life Update, Budget in FIRE, Goals for Year 2 of FIRE,  Notable Experiences Since my Last Update, and Notable Events/Trips for 2020. So read on for more details!\n\n# Major FIRE actions\n\n* Moved 401k to Vanguard IRA rollover account. This gave me some anxiety because a mid 6-figure check was sent via snail-mail. o\\_O\n* Changed taxable investments to not auto-invest to get a cashflow source not that I'm not generating a salary.  I got $18K in dividends from my taxable accounts last year, most of it qualified.\n* After lots of research and debating pros/cons, I decided to balance health care costs, present taxes, with future taxes and am targeting an AGI of $30,200 next year.  I will have the roughly $18K in dividends (based on 2019) and $12,200 of of IRA to Roth IRA rollover income. If dividends come in lower than $18K, I will sell of some mutual funds to get LT capital gains to make up the difference. **My estimated 2020 tax at that income level will be $975 ($400 Federal and $575 State).** The $30.2K AGI puts me in the top range for the Silver 73 CSR subsidy range. I hypothetically had the option to keep my premium to $1/month with super low deductibles and out of pocket costs, but it didn't leave any headroom to convert IRA to Roth IRA. Ultimately, I chose to pay a higher health insurance premiums ($474/year instead of $12/year), which is effectively a 3.80% tax to rollover $12.2K to Roth IRA.  \n* Signed up for ACA covereage started Feb 1st for $39.50/month for a Silver 73 HMO with CSR with $3700/$375 deductible with fixed fee co-pays for normal doctor visits and labs/tests. There were issues with the website so I had to call in via phone to continue the application. Also, I had to talk to them and insist/clarify that I no longer had health insurance at work  - they input it into the system that I still had a job and it was going to cost me something like $500+/month.\n\n# Quality of Life Update\n\nI definitely don't feel any guilt about not working or feel bored (I've seen a lot of posts recently commenting on either or both topics) - I've got so many things I do outside of work that I enjoy and I've been able to spend so much more time with friends and family post-FIRE.\n\n**Downshifting**\n\nI have a much more laid back attitude with life. Before FIRE I was very much a \"always on the go\", Type A kind of person, feeling like I had to optimize every bit of every day, partially because I had limited time at home, but also because I wanted to \"maximize life\". While on a 3 week vacation, I actually had 1-2 days where I actually just lounged around at my hotel swimming pool instead of seeing cultural sights and exploring the city. If you bet me a year ago that I'd spend an entire day not doing anything besides laying at the pool and eating, I would have thought you were crazy. With the ability to do slower travel and therefore less pressure to squeeze everything in, I've found that FIRE has given me a a stronger sense of calm/relaxation from the normal frantic life and resulted in a lot less stress.\n\n**Decisions and Structure**\n\nFrom time to time, I found that there was a lot of things to do and it was often tiring to choose what to do. Making decisions takes energy and effort (see the book \"The Paradox of Choice\" for further information on choice and loss aversion). With a large lack of defined work schedule and structure, it was taking energy to make those decisions. What I've done to combat having to make so many decisions is to create a shell structure so I'm doing the things I want to avoid suffering from decision fatigue.\n\nFor example, Monday nights are always board game nights at my lcoal store, Monday and Thursday afternoon are my lead climbing days, Tuesdays are my puzzles or cheap movie nights, and Friday are my theater nights. Nothing is set in stone of course, but having the structure relieves me from having to make decisions all the time over things that I want to do and can let me spend more time on meaningful decisions.\n\n# Budget in FIRE\n\nI spent more on travel and some other areas, but surprisingly my spend was still only &lt;$500 greater than my planned budget, despite paying for (effectively) Cobra Health Insurance for 6 months. The following are a few random musings of some areas where my budget has decreased as a result of FIRE:\n\n**Lower expenses as a result of FIRE:**\n\n* Saving on airfare by travelling on non-peak days/times.\n* Taking advantage of $5 Tuesdays at AMC and other matinee movie prices.\n* Lower food costs because I'm eating more at home more often.\n* Lower transit costs because I've been riding my bike much more. Previously, I felt pressed for time so I would take the bus or train to places or Uber/Lyft, but now I get on my bike for more exercise and fresh air, while saving money.\n* Will get about 2 months of \"free\" food (\\~$1100 based on my budget) while volunteering at summer camp. Note: I'm doing the camp because I love it and it's not really \"free\" since I'm donating a lot of my time, but it just happens to be a side perk for volunteering.\n\n# Goals for Year 2 of FIRE\n\n* Lead a 5.10D sport route and lead a 5.10A trad route.\n* Get in even better shape, mostly so I can become a better climber. Aiming for 3 climbing days a week and 2-3 cardio/strength conditioning. Specific goal is to get to 13% body fat and 145 pounds (currently at 16%/152).\n* Volunteer more with LGBT summer camps than I did in 2019 (I already have 68 days for 2020 planned compared to 24 in 2019).\n* Apply and get accepted to work for NOLS or Outward Bound as an outdoor backpacking/climbing instructor.  I would especially love to guide some LGBT/POC affinity groups.\n\n# Notable experiences since my last [update](https://www.reddit.com/r/financialindependence/comments/bqv9i4/100_days_on_loa_a_quantitative_view_of_my_time/):\n\n* Ate at Blue Hill at Stone Barnes.\n* Mountain biked for the first time, including some pretty difficult (for me) single track.\n* Did a 5 pitch multi pitch route, leading 3 pitches (it was super soft). Climbed 2 different 6B+ routes (\\~5.10D) on top rope without any takes. Those are the hardest grades I've ever climbed.\n* Saw a 7 hour play, The Inheritance, which was absolutely incredible.\n* Visited Thailand for 3 weeks, my 38th country.\n* Saw Harry Potter and the Cursed Child!\n\n# Notable planned events/trips for 2020\n\n* Disneyworld and Universal Studios for a 10 days.\n* Brazil trip for a month to travel/climb and to see my new niece (I'm a first time uncle!).\n* Volunteer at two summer camps (including training, 68 days).\n* Text/phone bank and canvas for swing states in September/October.\n* Laos and Cambodia trip for 3 weeks to climb in Thakkek.\n\nHope you found the post enjoyable and/or informative.  Please let me know if you have any questions/comments!",
                    "author_fullname": "t2_1094hm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 1,
                    "clicked": false,
                    "title": "UPDATE (1 year in and loving it!): 35, $1.1M - Luck, Stumbles, Dedication, and Thrift - An 11 Year Journey to FI",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/financialindependence",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_f261kn",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.93,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1831,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": "6191dafc-5328-11e5-a571-0e86da199117",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1831,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1581413423.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.financialindependence",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So it&amp;#39;s been a full year since I&amp;#39;ve been RE and wanted to give a quick update on my &lt;a href=\"https://www.reddit.com/r/financialindependence/comments/adj08l/35_11m_luck_stumbles_dedication_and_thrift_an_11/\"&gt;original post&lt;/a&gt;. Spoiler: I&amp;#39;m loving the FIRE and don&amp;#39;t have any plan to go back to work at all!  I&amp;#39;ve put the TL;DR up front, but I&amp;#39;ve got a lot more details below if you&amp;#39;re interested in reading those!&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;After taking an 11 month Leave of Absence, I officially gave my notice and my last day of employment was in early January.&lt;/li&gt;\n&lt;li&gt;My net worth went from $1.10M to $1.40M with a few paychecks, cashing out a ton of PTO, a small annual bonus, and a surging stock market. With my current budget of $33K/year, this would amount to a 2.37% withdrawal rate, which for someone who is risk averse (especially given the long bull run in the past decade and valuations where they are currently at) is very comforting.&lt;/li&gt;\n&lt;li&gt;2019 Actual budget was only $500 above planned and I found that a lot of my planned budget categories costs were higher than my actual spend.&lt;/li&gt;\n&lt;li&gt;Overall, I&amp;#39;m extremely happy with my decision to RE - I can spend more time with my hobbies, friends, and &lt;a href=\"https://www.reddit.com/r/financialindependence/comments/dbcrtr/giving_after_fire_1_month_volunteering_at_summer/\"&gt;pursue things that are bringing more meaning to my life&lt;/a&gt;. I know there have been a few recent posts about not being happy after RE, but I&amp;#39;m truly enjoying all of it and not finding any boredom whatsoever!&lt;/li&gt;\n&lt;li&gt;I applied and got accepted to a second LGBT summer camp as a cabin counselor! I&amp;#39;ve got 3 days at a spring camp, 3 weeks with Summer Camp #1, and 5 weeks with Summer Camp #2.  With training for each of the camps, it&amp;#39;ll be 68 days of volunteering this summer!&lt;/li&gt;\n&lt;li&gt;Major goal this is to get better at climbing (leading sport and trad climbs outdoor at 5.10b-5.10d level) so I can apply to be an outdoor instructor at Outward Bound or NOLS (National Outdoor Leadership School).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In the rest of the post I will cover the following topics: Major FIRE actions, Quality of Life Update, Budget in FIRE, Goals for Year 2 of FIRE,  Notable Experiences Since my Last Update, and Notable Events/Trips for 2020. So read on for more details!&lt;/p&gt;\n\n&lt;h1&gt;Major FIRE actions&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Moved 401k to Vanguard IRA rollover account. This gave me some anxiety because a mid 6-figure check was sent via snail-mail. o_O&lt;/li&gt;\n&lt;li&gt;Changed taxable investments to not auto-invest to get a cashflow source not that I&amp;#39;m not generating a salary.  I got $18K in dividends from my taxable accounts last year, most of it qualified.&lt;/li&gt;\n&lt;li&gt;After lots of research and debating pros/cons, I decided to balance health care costs, present taxes, with future taxes and am targeting an AGI of $30,200 next year.  I will have the roughly $18K in dividends (based on 2019) and $12,200 of of IRA to Roth IRA rollover income. If dividends come in lower than $18K, I will sell of some mutual funds to get LT capital gains to make up the difference. &lt;strong&gt;My estimated 2020 tax at that income level will be $975 ($400 Federal and $575 State).&lt;/strong&gt; The $30.2K AGI puts me in the top range for the Silver 73 CSR subsidy range. I hypothetically had the option to keep my premium to $1/month with super low deductibles and out of pocket costs, but it didn&amp;#39;t leave any headroom to convert IRA to Roth IRA. Ultimately, I chose to pay a higher health insurance premiums ($474/year instead of $12/year), which is effectively a 3.80% tax to rollover $12.2K to Roth IRA.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Signed up for ACA covereage started Feb 1st for $39.50/month for a Silver 73 HMO with CSR with $3700/$375 deductible with fixed fee co-pays for normal doctor visits and labs/tests. There were issues with the website so I had to call in via phone to continue the application. Also, I had to talk to them and insist/clarify that I no longer had health insurance at work  - they input it into the system that I still had a job and it was going to cost me something like $500+/month.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Quality of Life Update&lt;/h1&gt;\n\n&lt;p&gt;I definitely don&amp;#39;t feel any guilt about not working or feel bored (I&amp;#39;ve seen a lot of posts recently commenting on either or both topics) - I&amp;#39;ve got so many things I do outside of work that I enjoy and I&amp;#39;ve been able to spend so much more time with friends and family post-FIRE.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Downshifting&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I have a much more laid back attitude with life. Before FIRE I was very much a &amp;quot;always on the go&amp;quot;, Type A kind of person, feeling like I had to optimize every bit of every day, partially because I had limited time at home, but also because I wanted to &amp;quot;maximize life&amp;quot;. While on a 3 week vacation, I actually had 1-2 days where I actually just lounged around at my hotel swimming pool instead of seeing cultural sights and exploring the city. If you bet me a year ago that I&amp;#39;d spend an entire day not doing anything besides laying at the pool and eating, I would have thought you were crazy. With the ability to do slower travel and therefore less pressure to squeeze everything in, I&amp;#39;ve found that FIRE has given me a a stronger sense of calm/relaxation from the normal frantic life and resulted in a lot less stress.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Decisions and Structure&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;From time to time, I found that there was a lot of things to do and it was often tiring to choose what to do. Making decisions takes energy and effort (see the book &amp;quot;The Paradox of Choice&amp;quot; for further information on choice and loss aversion). With a large lack of defined work schedule and structure, it was taking energy to make those decisions. What I&amp;#39;ve done to combat having to make so many decisions is to create a shell structure so I&amp;#39;m doing the things I want to avoid suffering from decision fatigue.&lt;/p&gt;\n\n&lt;p&gt;For example, Monday nights are always board game nights at my lcoal store, Monday and Thursday afternoon are my lead climbing days, Tuesdays are my puzzles or cheap movie nights, and Friday are my theater nights. Nothing is set in stone of course, but having the structure relieves me from having to make decisions all the time over things that I want to do and can let me spend more time on meaningful decisions.&lt;/p&gt;\n\n&lt;h1&gt;Budget in FIRE&lt;/h1&gt;\n\n&lt;p&gt;I spent more on travel and some other areas, but surprisingly my spend was still only &amp;lt;$500 greater than my planned budget, despite paying for (effectively) Cobra Health Insurance for 6 months. The following are a few random musings of some areas where my budget has decreased as a result of FIRE:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lower expenses as a result of FIRE:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Saving on airfare by travelling on non-peak days/times.&lt;/li&gt;\n&lt;li&gt;Taking advantage of $5 Tuesdays at AMC and other matinee movie prices.&lt;/li&gt;\n&lt;li&gt;Lower food costs because I&amp;#39;m eating more at home more often.&lt;/li&gt;\n&lt;li&gt;Lower transit costs because I&amp;#39;ve been riding my bike much more. Previously, I felt pressed for time so I would take the bus or train to places or Uber/Lyft, but now I get on my bike for more exercise and fresh air, while saving money.&lt;/li&gt;\n&lt;li&gt;Will get about 2 months of &amp;quot;free&amp;quot; food (~$1100 based on my budget) while volunteering at summer camp. Note: I&amp;#39;m doing the camp because I love it and it&amp;#39;s not really &amp;quot;free&amp;quot; since I&amp;#39;m donating a lot of my time, but it just happens to be a side perk for volunteering.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Goals for Year 2 of FIRE&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Lead a 5.10D sport route and lead a 5.10A trad route.&lt;/li&gt;\n&lt;li&gt;Get in even better shape, mostly so I can become a better climber. Aiming for 3 climbing days a week and 2-3 cardio/strength conditioning. Specific goal is to get to 13% body fat and 145 pounds (currently at 16%/152).&lt;/li&gt;\n&lt;li&gt;Volunteer more with LGBT summer camps than I did in 2019 (I already have 68 days for 2020 planned compared to 24 in 2019).&lt;/li&gt;\n&lt;li&gt;Apply and get accepted to work for NOLS or Outward Bound as an outdoor backpacking/climbing instructor.  I would especially love to guide some LGBT/POC affinity groups.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Notable experiences since my last &lt;a href=\"https://www.reddit.com/r/financialindependence/comments/bqv9i4/100_days_on_loa_a_quantitative_view_of_my_time/\"&gt;update&lt;/a&gt;:&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Ate at Blue Hill at Stone Barnes.&lt;/li&gt;\n&lt;li&gt;Mountain biked for the first time, including some pretty difficult (for me) single track.&lt;/li&gt;\n&lt;li&gt;Did a 5 pitch multi pitch route, leading 3 pitches (it was super soft). Climbed 2 different 6B+ routes (~5.10D) on top rope without any takes. Those are the hardest grades I&amp;#39;ve ever climbed.&lt;/li&gt;\n&lt;li&gt;Saw a 7 hour play, The Inheritance, which was absolutely incredible.&lt;/li&gt;\n&lt;li&gt;Visited Thailand for 3 weeks, my 38th country.&lt;/li&gt;\n&lt;li&gt;Saw Harry Potter and the Cursed Child!&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Notable planned events/trips for 2020&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Disneyworld and Universal Studios for a 10 days.&lt;/li&gt;\n&lt;li&gt;Brazil trip for a month to travel/climb and to see my new niece (I&amp;#39;m a first time uncle!).&lt;/li&gt;\n&lt;li&gt;Volunteer at two summer camps (including training, 68 days).&lt;/li&gt;\n&lt;li&gt;Text/phone bank and canvas for swing states in September/October.&lt;/li&gt;\n&lt;li&gt;Laos and Cambodia trip for 3 weeks to climb in Thakkek.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Hope you found the post enjoyable and/or informative.  Please let me know if you have any questions/comments!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "40, FIRE since 1/1/2019",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2t34z",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "f261kn",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "hungn3",
                    "discussion_type": null,
                    "num_comments": 315,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/financialindependence/comments/f261kn/update_1_year_in_and_loving_it_35_11m_luck/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/financialindependence/comments/f261kn/update_1_year_in_and_loving_it_35_11m_luck/",
                    "subreddit_subscribers": 2265171,
                    "created_utc": 1581413423.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "financialindependence",
                    "selftext": "It has been over a year now since I quit my job. It feels like an eternity ago.\n\nAt first it was very difficult emotionally. Work provided me structure and purpose. It took me a few months to figure out what my new path in life will be.\n\nSocially it has been difficult too. Few people my age have the freedom that I do. Most people are bogged down with commitments and responsibilities. I found it hard to integrate into society because I felt so different.\n\nA common first reaction of telling people I'm retired is that they actually think I'm on a sabbatical. Others think I'm lying. Some think I got lucky or am a lot richer than I am.\n\nI've learned to navigate the social aspects better. What has helped is finding projects of my own to work on. I no longer tell people I'm retired. When people ask I will usually say I'm financially independent, then talk about the projects I am working on.\n\nOne of the most difficult decisions I've been facing is where to live. The only thing that tied me to my former city was my job. With that gone I have no more ties to a single location. Having the freedom to live anywhere in the world has resulted in decision fatigue.\n\nUltimately I don't think I want to live in any one place. I want to establish homes in multiple locations. I want to continue traveling the world. It is simply too difficult of a decision to make of where to live when I haven't been everywhere yet.\n\nI thought when I retired I would not be worried about money. But that ambition inside of me never died. I always want more. I get a thrill from making money.\n\nThere was a brief moment when I considered going back into the workforce (a.k.a. getting a job). I thought it might be nice to have structure, to be told what to do, to be part of something bigger. Ultimately that moment did not last long (it actually died when I was interviewed and I remembered what bullshit corporate culture is). I forfeited my work rights, so getting a job there would incredibly difficult if I ever did want to do so. I can't see myself wanting to be employed again.\n\nI've set out new endeavors where I can continue to work on increasingly growing projects. It keeps me intellectually stimulated. It provides structure and purpose. Frankly, it just gives me something to do, a reason to wake up.\n\nBoredom is one thing I've suffered from a lot over the past year. Having so much time to fill up has actually been challenging. Often I simply just don't know what to do with my time. I feel that I waste a lot of time because I can afford to.\n\nI don't think not having a job has made me any happier. It's just a different state of existence now. I feel a lot more free. I don't give in to anyone. This is my new normal.",
                    "author_fullname": "t2_2ut5uuw3",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Reflections on 1 year of early retirement",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/financialindependence",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_eechga",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.94,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 825,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": "6191dafc-5328-11e5-a571-0e86da199117",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 825,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1577063205.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1577059331.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.financialindependence",
                    "allow_live_comments": true,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It has been over a year now since I quit my job. It feels like an eternity ago.&lt;/p&gt;\n\n&lt;p&gt;At first it was very difficult emotionally. Work provided me structure and purpose. It took me a few months to figure out what my new path in life will be.&lt;/p&gt;\n\n&lt;p&gt;Socially it has been difficult too. Few people my age have the freedom that I do. Most people are bogged down with commitments and responsibilities. I found it hard to integrate into society because I felt so different.&lt;/p&gt;\n\n&lt;p&gt;A common first reaction of telling people I&amp;#39;m retired is that they actually think I&amp;#39;m on a sabbatical. Others think I&amp;#39;m lying. Some think I got lucky or am a lot richer than I am.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve learned to navigate the social aspects better. What has helped is finding projects of my own to work on. I no longer tell people I&amp;#39;m retired. When people ask I will usually say I&amp;#39;m financially independent, then talk about the projects I am working on.&lt;/p&gt;\n\n&lt;p&gt;One of the most difficult decisions I&amp;#39;ve been facing is where to live. The only thing that tied me to my former city was my job. With that gone I have no more ties to a single location. Having the freedom to live anywhere in the world has resulted in decision fatigue.&lt;/p&gt;\n\n&lt;p&gt;Ultimately I don&amp;#39;t think I want to live in any one place. I want to establish homes in multiple locations. I want to continue traveling the world. It is simply too difficult of a decision to make of where to live when I haven&amp;#39;t been everywhere yet.&lt;/p&gt;\n\n&lt;p&gt;I thought when I retired I would not be worried about money. But that ambition inside of me never died. I always want more. I get a thrill from making money.&lt;/p&gt;\n\n&lt;p&gt;There was a brief moment when I considered going back into the workforce (a.k.a. getting a job). I thought it might be nice to have structure, to be told what to do, to be part of something bigger. Ultimately that moment did not last long (it actually died when I was interviewed and I remembered what bullshit corporate culture is). I forfeited my work rights, so getting a job there would incredibly difficult if I ever did want to do so. I can&amp;#39;t see myself wanting to be employed again.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve set out new endeavors where I can continue to work on increasingly growing projects. It keeps me intellectually stimulated. It provides structure and purpose. Frankly, it just gives me something to do, a reason to wake up.&lt;/p&gt;\n\n&lt;p&gt;Boredom is one thing I&amp;#39;ve suffered from a lot over the past year. Having so much time to fill up has actually been challenging. Often I simply just don&amp;#39;t know what to do with my time. I feel that I waste a lot of time because I can afford to.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think not having a job has made me any happier. It&amp;#39;s just a different state of existence now. I feel a lot more free. I don&amp;#39;t give in to anyone. This is my new normal.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "FIRED",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2t34z",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "eechga",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "tidemp",
                    "discussion_type": null,
                    "num_comments": 287,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/financialindependence/comments/eechga/reflections_on_1_year_of_early_retirement/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/financialindependence/comments/eechga/reflections_on_1_year_of_early_retirement/",
                    "subreddit_subscribers": 2265171,
                    "created_utc": 1577059331.0,
                    "num_crossposts": 2,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}