{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 4,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Healthygamergg",
                    "selftext": "Hey y’all, I really value Dr. K’s content, and it has helped so many people (myself included!) \n\nThere is so much content from Dr. K I almost feel overwhelmed with how far my thinking can change and I can hardly parse through so much information. \n\nAlso, not to cast a stone at him, but are there any weaknesses to the way of life or thinking Dr. K uses? \n\nAgain, thanks Dr. K, I just want to make sure I’m balanced in my content intake and where I need to be careful of creating blind spots in my life! ",
                    "author_fullname": "t2_39dqj3yv",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I get decision fatigue from all of Dr. K’s content",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Personal Improvement"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Healthygamergg",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1bflfhv",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 0.84,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 4,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Personal Improvement",
                    "can_mod_post": false,
                    "score": 4,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1710528826.0,
                    "link_flair_type": "richtext",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Healthygamergg",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey y’all, I really value Dr. K’s content, and it has helped so many people (myself included!) &lt;/p&gt;\n\n&lt;p&gt;There is so much content from Dr. K I almost feel overwhelmed with how far my thinking can change and I can hardly parse through so much information. &lt;/p&gt;\n\n&lt;p&gt;Also, not to cast a stone at him, but are there any weaknesses to the way of life or thinking Dr. K uses? &lt;/p&gt;\n\n&lt;p&gt;Again, thanks Dr. K, I just want to make sure I’m balanced in my content intake and where I need to be careful of creating blind spots in my life! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "43ab7b86-e6ac-11ed-a365-4e05039e72ec",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_26y265",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#000000",
                    "id": "1bflfhv",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Lego_Eagle",
                    "discussion_type": null,
                    "num_comments": 5,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Healthygamergg/comments/1bflfhv/i_get_decision_fatigue_from_all_of_dr_ks_content/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Healthygamergg/comments/1bflfhv/i_get_decision_fatigue_from_all_of_dr_ks_content/",
                    "subreddit_subscribers": 121968,
                    "created_utc": 1710528826.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Healthygamergg",
                    "selftext": "**I want to break out of my patterns of Codependency and Limerance in romantic relationships.**   \n[https://youtube.com/shorts/mlasFYifFd0?feature=shared](https://youtube.com/shorts/mlasFYifFd0?feature=shared)\n\nHi everyone,  \nI am currently recovering from a very brutal breakup. A few weeks ago, I was ruthlessly dumped completely randomly and suddenly by who I thought was my soulmate and the person I would marry. I've come to respect his decision and trust that I'm going to be fine, but there is a lot I need to process and understand. I really want to \"work on myself.\"\n\n  \nOne of the reasons he gave me for dumping me is this:\n\n&gt; \"I know you love me a lot, but it really seems like you depend on me for your happiness, and I know that our relationship will turn codependent. In some ways it already is codependent because I often feel an intense desire to avoid disappointing you which is not healthy. People need to learn how to feel happy and content with themselves so that they are not overly dependent on another person for their happiness. And sometimes I feel so drained trying to cheer you up or make you smile or laugh.\"\n\nI can't stop thinking about it and I want your opinion, first of all, on whether this is true and if yes, *what do?*\n\nYes, I am a hopeless romantic. I am a big introvert with a very small social battery, and I'm extremely picky, but when I do \"imprint\" on someone, I project really hard and fall in love really fast. In all my relationships so far, I felt like I loved them way more than they could reciprocate. He said he had been planning to break up for a very long time but was afraid to hurt me, so I'm wondering, was I so delusional and blinded by love that I couldn't even see that he was suffering, or was he just so good at concealing his hurt from me?\n\nTo me, love and friendship have always been about acceptance, about finding someone who's as weird as me. I've always had trouble fitting in, so when someone actually does get me, it's like crack! I often end up oversharing and trauma dumping, which I now realize is a symptom of loneliness. This has cost me many friendships. I get addicted to people to the point that I get sick of them and they of me.\n\nI'm also realizing now that I have the same pattern even when it comes to forming and maintaining friendships. I have more guy friends than female friends. All of my female friendships have been really intense and ended abruptly and brutally.\n\nI'm wondering if I even know how to be happy. The only time I pursue my hobbies is when I am *obsessed*. I do suffer from maladaptive daydreaming. I was always scared of marriage, but in this relationship, I obsessively thought about it every single day. I even made a Pinterest wedding board (most girls have this anyway) and a wedding playlist when we were not even engaged, lol. I daydream so hard sometimes that I procrastinate on my responsibilities until I become derealized. Consequences start to lose importance and urgency, and self-sabotage becomes imminent.\n\nThere are many things that made my codependency worse. For some reason I could never get my romantic partners to meet my friend group, whereas I spent most of my time happily socializing with their friend group and had limited social interaction outside of the relationships.\n\nI have an anxious attachment style. I do get bombarded with intrusive thoughts and anxiety quite easily, which causes jealousy and relationship anxiety. I hate feeling jealous because I like to spread love and positivity, but I do suffer from low self-esteem sometimes. I've had a rough childhood and have always used books, art and video games as a means of escapism. I think I use pleasure as a sedative rather than a luxury. I do have low willpower, high impulsiveness, low conscientiousness, and also, alcoholism runs in my family, which is why I have always tried to be careful with all substances, including coffee.\n\nAnother thing that has been bothering me is that I have been called manipulative, and my ex always said that I have low emotional empathy but high cognitive empathy. It's hard for me to see someone's point of view, but when I do, I'm usually ride or die, which is why I joke that all my friends are misfits who befriend me only because nobody else can tolerate their company. My ex was no different. I was his first girlfriend. He's kind of weird, but I accepted all his flaws. I loved him so fiercely, and I was so devoted to this relationship. I would have done anything to save it.\n\nI was a little codependent in the relationship when I got sick last year. I had a series of panic attacks in March last year, followed by a depressive episode that was at times so agonizing that I was truly afraid I would hurt myself. In those dark days, he was sometimes the only thing that kept me going. I know it's hard to love a depressed person, but it's also worth mentioning that he is training to be a psychotherapist, for fuck's sake, so I always felt safe sharing and opening up to him because I thought he had a better understanding of me than I did myself. I relied on him a little too much for help and took his opinions very seriously when I had decision fatigue. I don't know what even is healthy anymore?\n\nThis relationship was particularly hard because it was long-distance, but it was totally worth it because of how magical, transformative, and healing it was for both of us. We live on different continents. We had doubts in the beginning, but we both made promises to fight for it and keep it alive until we could be together. He has a lot of mental health problems too, in fact, a lot more than me! He has crippling social anxiety and ADHD and suffers from porn addiction, among other things. My illness was pretty short in comparison, and I wasn't sick when we met. While life is still pretty hard because I am stressed about school, student debt, and finding a job after graduation, I was almost recovered from my depression when he dumped me.\n\nIronically, one of the reasons why I did not want to fly there to live with him, even though his family was kind of pressuring me to, is because I did not want to depend on him for anything. Also, my family is protective of me, and they wouldn't want me to move to a different country just for love.\n\nOn one hand, I think that I was able to stay happy and content exactly where I was because I could find happiness in little things and daily routines instead of making him the source of my happiness. He is younger than me by two years, so I knew he would need more time than me to become financially independent, and I was okay with it because I knew I was the *hard carry* in this relationship. We decided to wait until we were both financially stable to make any big decisions like getting married, even though we talked about it every single day, but I guess it was hard for him. However, now I'm wondering if maladaptive daydreaming and projection were what carried me so deep into this mess.\n\nI never saw the breakup coming because he has literally never shared with me even once that he's been struggling, even though we talked for hours. We both knew it would be hard, and we were in it together, so I really don't understand how he can suddenly do a 180 like that and call me an energy vampire. I am 28 now. I have had three very serious, very long, very rewarding, but very hard relationships. The first one started when I was just 16, which means that the longest time I've been single in over a decade is only 1 year and 3 months from October 2020 to 2022 (and that's mostly because it was during the pandemic, so I couldn't meet people anyway). I have a vivid imagination because I am an artist, and I also have very intense and mystical dreams (a lot of which are about him, so I haven't been able to sleep well recently because I wake up crying whenever I have one of those).\n\nHow do I heal from this? I did have to do a lot of inner child work during my depressive episode to process my childhood traumas. I brought people back into my life and rebuilt broken relationships with family members, even though there was a generational history of hurt and abuse there. I think I'm on the right track because now I truly understand the true value of forgiveness and how liberating it can be. I've cycled through all the stages of grief multiple times and have been able to process almost every emotion except anger. I don't know what to do with anger, and it keeps resurfacing unhealthily, ruining my peace of mind. All I want to do is move on.\n\nI feel very similar to this post: [https://www.youtube.com/watch?v=UbGZaGzWdfs](https://www.youtube.com/watch?v=UbGZaGzWdfs). A few days ago, when I was feeling really low, I made the stupid decision to go on a dating app, and I have 10k likes on Bumble right now, which is making me even more sad because despite how hard I try and how good I get, I get an absurd amount of male attention but no real friends. I don't understand why I am never enough. I can't find any meaningful connection and if I do it's always such a huge rollercoaster that I think maybe it's easier to find comfort in loneliness than risk all the heartbreak.\n\nBreakups teach you about what you value the most in life, and if it is not yourself, you're fucked. How do I rebuild myself and find happiness within me?  \n  \nLooking for some wisdom and advice. ",
                    "author_fullname": "t2_10o4hi3txc",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Codependency and Limerance",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Dating / Sex / Relationships (FRIDAY ONLY)"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Healthygamergg",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1d4ynid",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 6,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Dating / Sex / Relationships (FRIDAY ONLY)",
                    "can_mod_post": false,
                    "score": 6,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1717170124.0,
                    "link_flair_type": "richtext",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Healthygamergg",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;I want to break out of my patterns of Codependency and Limerance in romantic relationships.&lt;/strong&gt;&lt;br/&gt;\n&lt;a href=\"https://youtube.com/shorts/mlasFYifFd0?feature=shared\"&gt;https://youtube.com/shorts/mlasFYifFd0?feature=shared&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hi everyone,&lt;br/&gt;\nI am currently recovering from a very brutal breakup. A few weeks ago, I was ruthlessly dumped completely randomly and suddenly by who I thought was my soulmate and the person I would marry. I&amp;#39;ve come to respect his decision and trust that I&amp;#39;m going to be fine, but there is a lot I need to process and understand. I really want to &amp;quot;work on myself.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;One of the reasons he gave me for dumping me is this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I know you love me a lot, but it really seems like you depend on me for your happiness, and I know that our relationship will turn codependent. In some ways it already is codependent because I often feel an intense desire to avoid disappointing you which is not healthy. People need to learn how to feel happy and content with themselves so that they are not overly dependent on another person for their happiness. And sometimes I feel so drained trying to cheer you up or make you smile or laugh.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t stop thinking about it and I want your opinion, first of all, on whether this is true and if yes, &lt;em&gt;what do?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes, I am a hopeless romantic. I am a big introvert with a very small social battery, and I&amp;#39;m extremely picky, but when I do &amp;quot;imprint&amp;quot; on someone, I project really hard and fall in love really fast. In all my relationships so far, I felt like I loved them way more than they could reciprocate. He said he had been planning to break up for a very long time but was afraid to hurt me, so I&amp;#39;m wondering, was I so delusional and blinded by love that I couldn&amp;#39;t even see that he was suffering, or was he just so good at concealing his hurt from me?&lt;/p&gt;\n\n&lt;p&gt;To me, love and friendship have always been about acceptance, about finding someone who&amp;#39;s as weird as me. I&amp;#39;ve always had trouble fitting in, so when someone actually does get me, it&amp;#39;s like crack! I often end up oversharing and trauma dumping, which I now realize is a symptom of loneliness. This has cost me many friendships. I get addicted to people to the point that I get sick of them and they of me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also realizing now that I have the same pattern even when it comes to forming and maintaining friendships. I have more guy friends than female friends. All of my female friendships have been really intense and ended abruptly and brutally.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m wondering if I even know how to be happy. The only time I pursue my hobbies is when I am &lt;em&gt;obsessed&lt;/em&gt;. I do suffer from maladaptive daydreaming. I was always scared of marriage, but in this relationship, I obsessively thought about it every single day. I even made a Pinterest wedding board (most girls have this anyway) and a wedding playlist when we were not even engaged, lol. I daydream so hard sometimes that I procrastinate on my responsibilities until I become derealized. Consequences start to lose importance and urgency, and self-sabotage becomes imminent.&lt;/p&gt;\n\n&lt;p&gt;There are many things that made my codependency worse. For some reason I could never get my romantic partners to meet my friend group, whereas I spent most of my time happily socializing with their friend group and had limited social interaction outside of the relationships.&lt;/p&gt;\n\n&lt;p&gt;I have an anxious attachment style. I do get bombarded with intrusive thoughts and anxiety quite easily, which causes jealousy and relationship anxiety. I hate feeling jealous because I like to spread love and positivity, but I do suffer from low self-esteem sometimes. I&amp;#39;ve had a rough childhood and have always used books, art and video games as a means of escapism. I think I use pleasure as a sedative rather than a luxury. I do have low willpower, high impulsiveness, low conscientiousness, and also, alcoholism runs in my family, which is why I have always tried to be careful with all substances, including coffee.&lt;/p&gt;\n\n&lt;p&gt;Another thing that has been bothering me is that I have been called manipulative, and my ex always said that I have low emotional empathy but high cognitive empathy. It&amp;#39;s hard for me to see someone&amp;#39;s point of view, but when I do, I&amp;#39;m usually ride or die, which is why I joke that all my friends are misfits who befriend me only because nobody else can tolerate their company. My ex was no different. I was his first girlfriend. He&amp;#39;s kind of weird, but I accepted all his flaws. I loved him so fiercely, and I was so devoted to this relationship. I would have done anything to save it.&lt;/p&gt;\n\n&lt;p&gt;I was a little codependent in the relationship when I got sick last year. I had a series of panic attacks in March last year, followed by a depressive episode that was at times so agonizing that I was truly afraid I would hurt myself. In those dark days, he was sometimes the only thing that kept me going. I know it&amp;#39;s hard to love a depressed person, but it&amp;#39;s also worth mentioning that he is training to be a psychotherapist, for fuck&amp;#39;s sake, so I always felt safe sharing and opening up to him because I thought he had a better understanding of me than I did myself. I relied on him a little too much for help and took his opinions very seriously when I had decision fatigue. I don&amp;#39;t know what even is healthy anymore?&lt;/p&gt;\n\n&lt;p&gt;This relationship was particularly hard because it was long-distance, but it was totally worth it because of how magical, transformative, and healing it was for both of us. We live on different continents. We had doubts in the beginning, but we both made promises to fight for it and keep it alive until we could be together. He has a lot of mental health problems too, in fact, a lot more than me! He has crippling social anxiety and ADHD and suffers from porn addiction, among other things. My illness was pretty short in comparison, and I wasn&amp;#39;t sick when we met. While life is still pretty hard because I am stressed about school, student debt, and finding a job after graduation, I was almost recovered from my depression when he dumped me.&lt;/p&gt;\n\n&lt;p&gt;Ironically, one of the reasons why I did not want to fly there to live with him, even though his family was kind of pressuring me to, is because I did not want to depend on him for anything. Also, my family is protective of me, and they wouldn&amp;#39;t want me to move to a different country just for love.&lt;/p&gt;\n\n&lt;p&gt;On one hand, I think that I was able to stay happy and content exactly where I was because I could find happiness in little things and daily routines instead of making him the source of my happiness. He is younger than me by two years, so I knew he would need more time than me to become financially independent, and I was okay with it because I knew I was the &lt;em&gt;hard carry&lt;/em&gt; in this relationship. We decided to wait until we were both financially stable to make any big decisions like getting married, even though we talked about it every single day, but I guess it was hard for him. However, now I&amp;#39;m wondering if maladaptive daydreaming and projection were what carried me so deep into this mess.&lt;/p&gt;\n\n&lt;p&gt;I never saw the breakup coming because he has literally never shared with me even once that he&amp;#39;s been struggling, even though we talked for hours. We both knew it would be hard, and we were in it together, so I really don&amp;#39;t understand how he can suddenly do a 180 like that and call me an energy vampire. I am 28 now. I have had three very serious, very long, very rewarding, but very hard relationships. The first one started when I was just 16, which means that the longest time I&amp;#39;ve been single in over a decade is only 1 year and 3 months from October 2020 to 2022 (and that&amp;#39;s mostly because it was during the pandemic, so I couldn&amp;#39;t meet people anyway). I have a vivid imagination because I am an artist, and I also have very intense and mystical dreams (a lot of which are about him, so I haven&amp;#39;t been able to sleep well recently because I wake up crying whenever I have one of those).&lt;/p&gt;\n\n&lt;p&gt;How do I heal from this? I did have to do a lot of inner child work during my depressive episode to process my childhood traumas. I brought people back into my life and rebuilt broken relationships with family members, even though there was a generational history of hurt and abuse there. I think I&amp;#39;m on the right track because now I truly understand the true value of forgiveness and how liberating it can be. I&amp;#39;ve cycled through all the stages of grief multiple times and have been able to process almost every emotion except anger. I don&amp;#39;t know what to do with anger, and it keeps resurfacing unhealthily, ruining my peace of mind. All I want to do is move on.&lt;/p&gt;\n\n&lt;p&gt;I feel very similar to this post: &lt;a href=\"https://www.youtube.com/watch?v=UbGZaGzWdfs\"&gt;https://www.youtube.com/watch?v=UbGZaGzWdfs&lt;/a&gt;. A few days ago, when I was feeling really low, I made the stupid decision to go on a dating app, and I have 10k likes on Bumble right now, which is making me even more sad because despite how hard I try and how good I get, I get an absurd amount of male attention but no real friends. I don&amp;#39;t understand why I am never enough. I can&amp;#39;t find any meaningful connection and if I do it&amp;#39;s always such a huge rollercoaster that I think maybe it&amp;#39;s easier to find comfort in loneliness than risk all the heartbreak.&lt;/p&gt;\n\n&lt;p&gt;Breakups teach you about what you value the most in life, and if it is not yourself, you&amp;#39;re fucked. How do I rebuild myself and find happiness within me?  &lt;/p&gt;\n\n&lt;p&gt;Looking for some wisdom and advice. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/uxx0nBLs7zuQ0zhBFUp_2wjdOK-xo7fqJdInyTkulm4.jpg?auto=webp&amp;s=401e4301d5560b18105de5b1e9909ed9c1585194",
                                    "width": 405,
                                    "height": 720
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/uxx0nBLs7zuQ0zhBFUp_2wjdOK-xo7fqJdInyTkulm4.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=eb86decbaa9be0b8c8cabc09b67cc7b70623508c",
                                        "width": 108,
                                        "height": 192
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/uxx0nBLs7zuQ0zhBFUp_2wjdOK-xo7fqJdInyTkulm4.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=270919071ca77ebf268675c7bea5132c73f7f4f8",
                                        "width": 216,
                                        "height": 384
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/uxx0nBLs7zuQ0zhBFUp_2wjdOK-xo7fqJdInyTkulm4.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=65162977d874727f91855470fe9cfc3e1eaca636",
                                        "width": 320,
                                        "height": 568
                                    }
                                ],
                                "variants": {},
                                "id": "V--lsKE-W3g2vCfQi8EYn4ASp8pj82RB9aTPApiBqEg"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "5d56b9ec-e6ac-11ed-a05a-ea5cfa6a8c45",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_26y265",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#ff00ff",
                    "id": "1d4ynid",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "No_Pomelo1534",
                    "discussion_type": null,
                    "num_comments": 6,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Healthygamergg/comments/1d4ynid/codependency_and_limerance/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Healthygamergg/comments/1d4ynid/codependency_and_limerance/",
                    "subreddit_subscribers": 121968,
                    "created_utc": 1717170124.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Healthygamergg",
                    "selftext": "For myself, and people who have ADHD, it's difficult distinguishing between what \"must be done\" and what one wants to do. Sometimes, the lines between responsibility and desire become so blurred that you can work hard at something that has no real standing in reality. Video games are a perfect example of this phenomenon, where you believe you are working incredibly hard at something, and surely it feels as though you are persisting through obstructions which inspire you to use creative thinking and abstract solution skills, but ultimately they are escapist behaviors that draw you further away from the ability to withstand true discomfort with true consequences. How do you engage work that you must get done, not just because it is a simple responsibility of your life that everyone knows you should do, like spending an hour per day exercising. But things like freelance work, studying, preparing for your future, etc, where you have an unlimited amount of opportunities and options for utilizing your effort. I've found for the most part that these things lead to decision fatigue and more self-distancing from action/choice-making, because you have so many points that beg your attention, and each one somewhat promises to bring you closer to your goals. It's the \"grass is always greener\" effect, where you can begin working on one thing, and then something else tells you it needs to get done as well, because it is equally as important. For example, you're looking for an apartment, but then you find yourself distracted by options to convert a van, or to live in a tiny home, and now it's challenging to sift through these different options and understand which yields the most benefit for your individual journey. How do you organize your day so that you work on a few things that are most beneficial to your life, which aren't escapist practices to protect you against the barrage of responsibilities an adult naturally encounters?",
                    "author_fullname": "t2_heoud",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "How do you know what work is most important, and how do you get it done?",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Personal Improvement"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Healthygamergg",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_174xfwi",
                    "quarantine": false,
                    "link_flair_text_color": "light",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Personal Improvement",
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1696975185.0,
                    "link_flair_type": "richtext",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Healthygamergg",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For myself, and people who have ADHD, it&amp;#39;s difficult distinguishing between what &amp;quot;must be done&amp;quot; and what one wants to do. Sometimes, the lines between responsibility and desire become so blurred that you can work hard at something that has no real standing in reality. Video games are a perfect example of this phenomenon, where you believe you are working incredibly hard at something, and surely it feels as though you are persisting through obstructions which inspire you to use creative thinking and abstract solution skills, but ultimately they are escapist behaviors that draw you further away from the ability to withstand true discomfort with true consequences. How do you engage work that you must get done, not just because it is a simple responsibility of your life that everyone knows you should do, like spending an hour per day exercising. But things like freelance work, studying, preparing for your future, etc, where you have an unlimited amount of opportunities and options for utilizing your effort. I&amp;#39;ve found for the most part that these things lead to decision fatigue and more self-distancing from action/choice-making, because you have so many points that beg your attention, and each one somewhat promises to bring you closer to your goals. It&amp;#39;s the &amp;quot;grass is always greener&amp;quot; effect, where you can begin working on one thing, and then something else tells you it needs to get done as well, because it is equally as important. For example, you&amp;#39;re looking for an apartment, but then you find yourself distracted by options to convert a van, or to live in a tiny home, and now it&amp;#39;s challenging to sift through these different options and understand which yields the most benefit for your individual journey. How do you organize your day so that you work on a few things that are most beneficial to your life, which aren&amp;#39;t escapist practices to protect you against the barrage of responsibilities an adult naturally encounters?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "43ab7b86-e6ac-11ed-a365-4e05039e72ec",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_26y265",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#000000",
                    "id": "174xfwi",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Cameronfb",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Healthygamergg/comments/174xfwi/how_do_you_know_what_work_is_most_important_and/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Healthygamergg/comments/174xfwi/how_do_you_know_what_work_is_most_important_and/",
                    "subreddit_subscribers": 121968,
                    "created_utc": 1696975185.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Healthygamergg",
                    "selftext": "Hi y'all, I need some advice in getting back into my work mindset that I haven't been in for a while. I'm starting my career in film and video production, and it seems while I have a lot of projects and potential projects I either want to do or are being offered to me, I don't know how to concentrate on one and stick to it, which leads me to overthink, get decision fatigue, and leaves me with having done minimal work on any of the individual projects. \n\nI knew being in the creative industry would be risky, and come with its own issues. I chose to be in this industry regardless because I thought, whenever I have a project I want to finish I will get it finished no matter what. But now I have a few projects I want to produce, two for myself out of my budget (very low), a music video for a friend, and a short film/web series adaption of a local author's book (the music video and the adaption would both be funded by the musician friend and the author, respectively - and they haven't given specific timelines yet). I want to be able to all of them, and that along with stress of not having a regular job and other stressful life things make it hard to focus at all. \n\nAn additional stress for me is that, in college I used to get creatively fueled by being around friends in study halls and such - goofing off with them weirdly helped. Now everyone has 9-to-5s, (which I'm also trying to get, but without much success so far) which makes it much harder to meet with them or have that similar vibe. Being alone doesn't help with the creativity block.  \n\nAny fellow creatives here have suggestions for how to focus? Or perhaps a logic for how to focus on one project at a time? I can imagine writing stuff down helps - so far I just write an idea down in my phone whenever it comes to me regarding any of these projects, but it still hasn't helped. I've genuinely been losing sleep over this. Any suggestions would be appreciated.",
                    "author_fullname": "t2_m1sgr",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "How to clear my mind to get back into creativity?",
                    "link_flair_richtext": [
                        {
                            "e": "text",
                            "t": "Need Help / Advice"
                        }
                    ],
                    "subreddit_name_prefixed": "r/Healthygamergg",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_121g2ov",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Need Help / Advice",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1679735313.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1679734871.0,
                    "link_flair_type": "richtext",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Healthygamergg",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi y&amp;#39;all, I need some advice in getting back into my work mindset that I haven&amp;#39;t been in for a while. I&amp;#39;m starting my career in film and video production, and it seems while I have a lot of projects and potential projects I either want to do or are being offered to me, I don&amp;#39;t know how to concentrate on one and stick to it, which leads me to overthink, get decision fatigue, and leaves me with having done minimal work on any of the individual projects. &lt;/p&gt;\n\n&lt;p&gt;I knew being in the creative industry would be risky, and come with its own issues. I chose to be in this industry regardless because I thought, whenever I have a project I want to finish I will get it finished no matter what. But now I have a few projects I want to produce, two for myself out of my budget (very low), a music video for a friend, and a short film/web series adaption of a local author&amp;#39;s book (the music video and the adaption would both be funded by the musician friend and the author, respectively - and they haven&amp;#39;t given specific timelines yet). I want to be able to all of them, and that along with stress of not having a regular job and other stressful life things make it hard to focus at all. &lt;/p&gt;\n\n&lt;p&gt;An additional stress for me is that, in college I used to get creatively fueled by being around friends in study halls and such - goofing off with them weirdly helped. Now everyone has 9-to-5s, (which I&amp;#39;m also trying to get, but without much success so far) which makes it much harder to meet with them or have that similar vibe. Being alone doesn&amp;#39;t help with the creativity block.  &lt;/p&gt;\n\n&lt;p&gt;Any fellow creatives here have suggestions for how to focus? Or perhaps a logic for how to focus on one project at a time? I can imagine writing stuff down helps - so far I just write an idea down in my phone whenever it comes to me regarding any of these projects, but it still hasn&amp;#39;t helped. I&amp;#39;ve genuinely been losing sleep over this. Any suggestions would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "5ccf47d4-b76d-11eb-90c4-0e2245f61661",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_26y265",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "#349e48",
                    "id": "121g2ov",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "joesatmoes",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Healthygamergg/comments/121g2ov/how_to_clear_my_mind_to_get_back_into_creativity/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/Healthygamergg/comments/121g2ov/how_to_clear_my_mind_to_get_back_into_creativity/",
                    "subreddit_subscribers": 121968,
                    "created_utc": 1679734871.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}