{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 1,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "TryingForABaby",
                    "selftext": "My husband (29M) and I (36F) have been trying for about a year and a half, with no luck, and seemingly no progress. As each month passes, my resolve to keep trying wanes, and it's harder and harder to make the choice to keep at it. \n\nI'm frustrated that so much of the effort and risk has fallen on me, as the person with a uterus. \n\nAbout a year ago, I tapered off of my ADHD medication, because I couldn't find any clear guidance on whether a stimulant will prevent implantation or cause early miscarriage. Of course there's \"no way to ethically research\" this topic, and my doctors have treated the question like a hot potato (GP said to ask my psychiatrist who said to ask my OB who said to consult with my psychiatrist). \n\nI've been dutifully taking my prenatal, as well as some other supplements (calcium, iron) recommended by my ND. I've cut wayyy back on my vices, and took six months fully off of alcohol to see if that made any difference. I've started watching my macros and making sure I consume around 100g of protein most days. I went to weekly acupuncture for a couple of months, to a person who specializes in hormone health and reproductive care. \n\nI've been tracking my BBT for about a year, first with a morning temp check, and then with the TempDrop arm band, which was pricey but helped with having confidence in what my BBT is. I have been testing with OPKs every other month or so. All of the equipment, supplements, healthcare, tests, I have purchased and managed.\n\nI've gotten half a dozen blood draws and a pelvic ultrasound, all of which came back as within the normal range, nothing looked concerning. Despite my husband being much more definitively interested in having a child, I had to practically beg him to get a sperm test. So far the *only* negative feedback we've received from these tests is that his sperm looked like he was dehydrated. And somehow, while my physicians have encouraged me to live with a kind of monk-like purity, his doctors keep telling him he doesn't need to make any lifestyle changes, and that his substantial cannabis consumption is unlikely to have any impact on his fertility. \n\nIn a private conversation with my husband, my MIL offered to pay for IVF. I've been very definitive that I am not willing to do IVF. I feel violated that this conversation happened behind my back, and resent that my husband, in laws, and one of my parents are all eagerly watching my body and waiting for a baby to pop out of it.\n\nIn the past year, our sex life has transformed from a fun, spontaneous, and mutually pleasurable dynamic, to a mission-oriented series of rote tasks. If I have an orgasm, it is a quiet, solitary thing that I do on my own time, separate from the business of getting sperm into me. \n\nMy husband is frustrated that I only talk about the negative aspects of this process. He wants to hear more hope and excitement from me. But I don't feel hope and excitement. Since I've borne the vast majority of the costs and efforts to conceive over the last year, and since my pleasure and bodily autonomy have been the first things to be sacrificed to build a family... I expect that pregnancy and parenthood will be a similarly imbalanced division of \"labor\" vs. \"fruits of labor,\" of risk vs. reward... I've been using up ALL of my positive energy in taking action toward conceiving, and at the end of the day, I feel exhausted and sad about how the process has gone, not excited about what *might* come of it.\n\nAnd, of course, with our age difference, I'm acutely aware that the longer this takes, the more precarious the stakes are for my health. \n\nEach month, as the end of my cycle approaches, I run through this laundry list of sunk costs, and find myself feeling less and less inclined to keep making this effort. I don't know how to rebalance the effort to conceive in our marriage, how to reintroduce my pleasure into our sex life, or how to find the determination to keep at it. \n\nFor as long as we've been TFAB, I still manage to hop back on the fence every month, when it doesn't happen. \n\nTL;DR - 16 cycles of TTC and the inequity of effort and changes to how I relate to my body and sex have me drained!",
                    "author_fullname": "t2_2wui2o9x",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Monthly Decision Fatigue",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/TryingForABaby",
                    "hidden": false,
                    "pwls": 7,
                    "link_flair_css_class": "red",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1c5na6a",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.9,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 15,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "VENT",
                    "can_mod_post": false,
                    "score": 15,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1713291701.0,
                    "link_flair_type": "text",
                    "wls": 7,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.TryingForABaby",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband (29M) and I (36F) have been trying for about a year and a half, with no luck, and seemingly no progress. As each month passes, my resolve to keep trying wanes, and it&amp;#39;s harder and harder to make the choice to keep at it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m frustrated that so much of the effort and risk has fallen on me, as the person with a uterus. &lt;/p&gt;\n\n&lt;p&gt;About a year ago, I tapered off of my ADHD medication, because I couldn&amp;#39;t find any clear guidance on whether a stimulant will prevent implantation or cause early miscarriage. Of course there&amp;#39;s &amp;quot;no way to ethically research&amp;quot; this topic, and my doctors have treated the question like a hot potato (GP said to ask my psychiatrist who said to ask my OB who said to consult with my psychiatrist). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been dutifully taking my prenatal, as well as some other supplements (calcium, iron) recommended by my ND. I&amp;#39;ve cut wayyy back on my vices, and took six months fully off of alcohol to see if that made any difference. I&amp;#39;ve started watching my macros and making sure I consume around 100g of protein most days. I went to weekly acupuncture for a couple of months, to a person who specializes in hormone health and reproductive care. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been tracking my BBT for about a year, first with a morning temp check, and then with the TempDrop arm band, which was pricey but helped with having confidence in what my BBT is. I have been testing with OPKs every other month or so. All of the equipment, supplements, healthcare, tests, I have purchased and managed.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gotten half a dozen blood draws and a pelvic ultrasound, all of which came back as within the normal range, nothing looked concerning. Despite my husband being much more definitively interested in having a child, I had to practically beg him to get a sperm test. So far the &lt;em&gt;only&lt;/em&gt; negative feedback we&amp;#39;ve received from these tests is that his sperm looked like he was dehydrated. And somehow, while my physicians have encouraged me to live with a kind of monk-like purity, his doctors keep telling him he doesn&amp;#39;t need to make any lifestyle changes, and that his substantial cannabis consumption is unlikely to have any impact on his fertility. &lt;/p&gt;\n\n&lt;p&gt;In a private conversation with my husband, my MIL offered to pay for IVF. I&amp;#39;ve been very definitive that I am not willing to do IVF. I feel violated that this conversation happened behind my back, and resent that my husband, in laws, and one of my parents are all eagerly watching my body and waiting for a baby to pop out of it.&lt;/p&gt;\n\n&lt;p&gt;In the past year, our sex life has transformed from a fun, spontaneous, and mutually pleasurable dynamic, to a mission-oriented series of rote tasks. If I have an orgasm, it is a quiet, solitary thing that I do on my own time, separate from the business of getting sperm into me. &lt;/p&gt;\n\n&lt;p&gt;My husband is frustrated that I only talk about the negative aspects of this process. He wants to hear more hope and excitement from me. But I don&amp;#39;t feel hope and excitement. Since I&amp;#39;ve borne the vast majority of the costs and efforts to conceive over the last year, and since my pleasure and bodily autonomy have been the first things to be sacrificed to build a family... I expect that pregnancy and parenthood will be a similarly imbalanced division of &amp;quot;labor&amp;quot; vs. &amp;quot;fruits of labor,&amp;quot; of risk vs. reward... I&amp;#39;ve been using up ALL of my positive energy in taking action toward conceiving, and at the end of the day, I feel exhausted and sad about how the process has gone, not excited about what &lt;em&gt;might&lt;/em&gt; come of it.&lt;/p&gt;\n\n&lt;p&gt;And, of course, with our age difference, I&amp;#39;m acutely aware that the longer this takes, the more precarious the stakes are for my health. &lt;/p&gt;\n\n&lt;p&gt;Each month, as the end of my cycle approaches, I run through this laundry list of sunk costs, and find myself feeling less and less inclined to keep making this effort. I don&amp;#39;t know how to rebalance the effort to conceive in our marriage, how to reintroduce my pleasure into our sex life, or how to find the determination to keep at it. &lt;/p&gt;\n\n&lt;p&gt;For as long as we&amp;#39;ve been TFAB, I still manage to hop back on the fence every month, when it doesn&amp;#39;t happen. &lt;/p&gt;\n\n&lt;p&gt;TL;DR - 16 cycles of TTC and the inequity of effort and changes to how I relate to my body and sex have me drained!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "b688dbb2-5273-11e3-ad66-12313b079641",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2sil5",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "1c5na6a",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "MotherofChonk",
                    "discussion_type": null,
                    "num_comments": 7,
                    "send_replies": true,
                    "whitelist_status": "some_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/TryingForABaby/comments/1c5na6a/monthly_decision_fatigue/",
                    "parent_whitelist_status": "some_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/TryingForABaby/comments/1c5na6a/monthly_decision_fatigue/",
                    "subreddit_subscribers": 138722,
                    "created_utc": 1713291701.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}