{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 5,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "wedding",
                    "selftext": "i am so over making decisions at this point &amp; currently i am struggling with my gifts for my mother, my soon to be mother in law, and finishing touches for bridesmaids gifts. so far i got my mom and future MIL a cute, elevated pair of Kendra Scott earrings to wear for the wedding but i wanna top off their gifts. I wanted to get them each a luxury perfume and have the bottle engraved but it would honestly be around $300-400 to do so and that’s a big chunk and mine and my fiancé’s honeymoon fund. what are some equally fancy and sentimental but affordable options they will love? no Rae Dunn esque suggestions please. lol i don’t wanna get them cheap “mother of ___” robes bc i want something they will actually keep and cherish. also for my bridesmaids so far they have: matching pajamas, face mask, eye mask, lip oil and a matching shade of DIOR blush. i wanna top it off as well. it’s a beach wedding but i don’t want anything cheesy or crappy that gets tossed into the junkyard. again, i have a humble budget so pls don’t suggest anything crazy. i have 12 bridesmaids as well so i also can’t afford to drop $1500 for everyone’s makeup or hair. ",
                    "author_fullname": "t2_e5feqmlw",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Wedding aficionados - pls help this bride to be with decision fatigue :)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/wedding",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "help",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1bcx2pj",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.88,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 13,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Help!",
                    "can_mod_post": false,
                    "score": 13,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1710249588.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.wedding",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;i am so over making decisions at this point &amp;amp; currently i am struggling with my gifts for my mother, my soon to be mother in law, and finishing touches for bridesmaids gifts. so far i got my mom and future MIL a cute, elevated pair of Kendra Scott earrings to wear for the wedding but i wanna top off their gifts. I wanted to get them each a luxury perfume and have the bottle engraved but it would honestly be around $300-400 to do so and that’s a big chunk and mine and my fiancé’s honeymoon fund. what are some equally fancy and sentimental but affordable options they will love? no Rae Dunn esque suggestions please. lol i don’t wanna get them cheap “mother of ___” robes bc i want something they will actually keep and cherish. also for my bridesmaids so far they have: matching pajamas, face mask, eye mask, lip oil and a matching shade of DIOR blush. i wanna top it off as well. it’s a beach wedding but i don’t want anything cheesy or crappy that gets tossed into the junkyard. again, i have a humble budget so pls don’t suggest anything crazy. i have 12 bridesmaids as well so i also can’t afford to drop $1500 for everyone’s makeup or hair. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qhtr",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "1bcx2pj",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "honeybearlavender",
                    "discussion_type": null,
                    "num_comments": 31,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/wedding/comments/1bcx2pj/wedding_aficionados_pls_help_this_bride_to_be/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/wedding/comments/1bcx2pj/wedding_aficionados_pls_help_this_bride_to_be/",
                    "subreddit_subscribers": 171125,
                    "created_utc": 1710249588.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "wedding",
                    "selftext": "As the title says, I was unable to enjoy my bach trip and I'm terrified that I'm going to hate the rest of my wedding festivities for the same reasons. \n\nAt the risk of sounding high maintenance, I do *not* enjoy being the center of attention in any setting. I don't like doing big things for my birthday, I don't like public praise at work, I don't like PDA from my partner. It makes me feel downright uncomfortable and slightly anxious. My baseline of anxiety is probably a little higher than the average person's but I've put a lot of work and time in therapy into managing it.\n\nI just got home from my bach trip and am so upset that I couldn't get out of my head enough to enjoy it. I was stressed for days leading up to it and that didn't get better during the trip. I did not like being the center of attention and having to make every single \"little\" decision of the weekend- I worked with my MOH to plan out the itinerary and bigger activities but as most brides are during their special weekend, was peppered with little things like \"Do we want to order apps for the table? Which one? What music do you want to listen to while we get ready? Which drinking game do you want to play?\" etc. \n\nThe decision fatigue was exhausting and just made me anxious. Not all of my bridesmaids knew each other and I have different relationships with them and wanted to ensure that everyone had a good time. I'm grateful that I have girls who want to ensure I'm having a good time but having to be consulted for every little thing was exhausting and in a weird way made me feel like I had no control over the weekend. \n\nAdditionally, I felt almost guilty that we were doing things focused on me all weekend. I had two bridesmaids that have different tastes in trips and while they were polite and active participants, I could tell this wasn't their speed. We had so much liquor and food left over and I feel guilty that my girls \"wasted\" money on me. They wouldn't let me buy my own drinks at the bar- I had to pull my credit card out of my friend's hands bc was tired of having to ask someone for a drink every time I wanted one. \n\nI know that all of this came from a good spot- my MOH is a very anxious person and I could tell this trip stressed her out but she was so committed to making sure that I was having a good time. I am SO grateful for all that she did to plan the trip and so grateful that my friends used their PTO and traveled pretty far to go on this trip. \n\nHowever, I'm worried that the rest of my \\~ bridal era \\~ will make me feel the same. I physically feel like crap and as I'm sitting here writing this, I have the worst Sunday Scaries I've had in a while. My MIL and mom are both waiting on me to give them dates that I would be available for showers and engagement parties and while I am so grateful for them to throw something like this for me, I'm scared that I'm going to be anxious during them. \n\nI also feel like I'm not doing the \"bridal era\" right because I don't enjoy these activities- I feel guilty and anxious about people feeling obligated to do these things for me. \n\nEven more so, I'm terrified that I'm going to spend the entire weekend of my actual wedding stressed tf out, worried that everyone's not enjoying themselves, and/or regretting having a bigger wedding/feeling guilty that people are spending their time and money to travel to our wedding.\n\nHas anyone else experienced this? I feel like a crazy person especially reading and re-reading this but need some assurance that other non-center of attention brides were able to actually enjoy their weddings. I am head over heels in love with my fiance and am so excited to marry him and celebrate with all of our friends. I just can't get out of. my own head when the spotlight is on me and me alone. \n\n\n\n",
                    "author_fullname": "t2_7z1e9phw",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Being the center of attention made me hate my bachelorette trip- will I hate the rest of my wedding festivities? ",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/wedding",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "discussion",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1fn6onp",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.5,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 0,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Discussion",
                    "can_mod_post": false,
                    "score": 0,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1727047577.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.wedding",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, I was unable to enjoy my bach trip and I&amp;#39;m terrified that I&amp;#39;m going to hate the rest of my wedding festivities for the same reasons. &lt;/p&gt;\n\n&lt;p&gt;At the risk of sounding high maintenance, I do &lt;em&gt;not&lt;/em&gt; enjoy being the center of attention in any setting. I don&amp;#39;t like doing big things for my birthday, I don&amp;#39;t like public praise at work, I don&amp;#39;t like PDA from my partner. It makes me feel downright uncomfortable and slightly anxious. My baseline of anxiety is probably a little higher than the average person&amp;#39;s but I&amp;#39;ve put a lot of work and time in therapy into managing it.&lt;/p&gt;\n\n&lt;p&gt;I just got home from my bach trip and am so upset that I couldn&amp;#39;t get out of my head enough to enjoy it. I was stressed for days leading up to it and that didn&amp;#39;t get better during the trip. I did not like being the center of attention and having to make every single &amp;quot;little&amp;quot; decision of the weekend- I worked with my MOH to plan out the itinerary and bigger activities but as most brides are during their special weekend, was peppered with little things like &amp;quot;Do we want to order apps for the table? Which one? What music do you want to listen to while we get ready? Which drinking game do you want to play?&amp;quot; etc. &lt;/p&gt;\n\n&lt;p&gt;The decision fatigue was exhausting and just made me anxious. Not all of my bridesmaids knew each other and I have different relationships with them and wanted to ensure that everyone had a good time. I&amp;#39;m grateful that I have girls who want to ensure I&amp;#39;m having a good time but having to be consulted for every little thing was exhausting and in a weird way made me feel like I had no control over the weekend. &lt;/p&gt;\n\n&lt;p&gt;Additionally, I felt almost guilty that we were doing things focused on me all weekend. I had two bridesmaids that have different tastes in trips and while they were polite and active participants, I could tell this wasn&amp;#39;t their speed. We had so much liquor and food left over and I feel guilty that my girls &amp;quot;wasted&amp;quot; money on me. They wouldn&amp;#39;t let me buy my own drinks at the bar- I had to pull my credit card out of my friend&amp;#39;s hands bc was tired of having to ask someone for a drink every time I wanted one. &lt;/p&gt;\n\n&lt;p&gt;I know that all of this came from a good spot- my MOH is a very anxious person and I could tell this trip stressed her out but she was so committed to making sure that I was having a good time. I am SO grateful for all that she did to plan the trip and so grateful that my friends used their PTO and traveled pretty far to go on this trip. &lt;/p&gt;\n\n&lt;p&gt;However, I&amp;#39;m worried that the rest of my ~ bridal era ~ will make me feel the same. I physically feel like crap and as I&amp;#39;m sitting here writing this, I have the worst Sunday Scaries I&amp;#39;ve had in a while. My MIL and mom are both waiting on me to give them dates that I would be available for showers and engagement parties and while I am so grateful for them to throw something like this for me, I&amp;#39;m scared that I&amp;#39;m going to be anxious during them. &lt;/p&gt;\n\n&lt;p&gt;I also feel like I&amp;#39;m not doing the &amp;quot;bridal era&amp;quot; right because I don&amp;#39;t enjoy these activities- I feel guilty and anxious about people feeling obligated to do these things for me. &lt;/p&gt;\n\n&lt;p&gt;Even more so, I&amp;#39;m terrified that I&amp;#39;m going to spend the entire weekend of my actual wedding stressed tf out, worried that everyone&amp;#39;s not enjoying themselves, and/or regretting having a bigger wedding/feeling guilty that people are spending their time and money to travel to our wedding.&lt;/p&gt;\n\n&lt;p&gt;Has anyone else experienced this? I feel like a crazy person especially reading and re-reading this but need some assurance that other non-center of attention brides were able to actually enjoy their weddings. I am head over heels in love with my fiance and am so excited to marry him and celebrate with all of our friends. I just can&amp;#39;t get out of. my own head when the spotlight is on me and me alone. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qhtr",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "1fn6onp",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "SnooBananas2853",
                    "discussion_type": null,
                    "num_comments": 7,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/wedding/comments/1fn6onp/being_the_center_of_attention_made_me_hate_my/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/wedding/comments/1fn6onp/being_the_center_of_attention_made_me_hate_my/",
                    "subreddit_subscribers": 171125,
                    "created_utc": 1727047577.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "wedding",
                    "selftext": "As said! We aren’t cruise people, and I have a medical condition that would mean if we picked a beach resort I’d spend all day inside alone, due to issues with heat and being in the sun. We don’t want to pay a lot of money for honeymoon that we don’t get to spend together, so beach is out. \n\nWe LOVE the idea of an all inclusive resort, though, after the stress and decision fatigue of planning a wedding. \n\nWhat have you done/are you doing with your partner? Has anyone found any non-beach options that don’t require planning and managing it all yourself ??\n\n\n\nThanks !",
                    "author_fullname": "t2_zzyo5xruz",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Honeymoon ideas… are there inclusive trips that aren’t beach or cruise???",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/wedding",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "discussion",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1edi61q",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.64,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Discussion",
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1722091965.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.wedding",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As said! We aren’t cruise people, and I have a medical condition that would mean if we picked a beach resort I’d spend all day inside alone, due to issues with heat and being in the sun. We don’t want to pay a lot of money for honeymoon that we don’t get to spend together, so beach is out. &lt;/p&gt;\n\n&lt;p&gt;We LOVE the idea of an all inclusive resort, though, after the stress and decision fatigue of planning a wedding. &lt;/p&gt;\n\n&lt;p&gt;What have you done/are you doing with your partner? Has anyone found any non-beach options that don’t require planning and managing it all yourself ??&lt;/p&gt;\n\n&lt;p&gt;Thanks !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "b6683000-16b4-11e4-a47a-12313b0d3999",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qhtr",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "1edi61q",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Dry_Rain_6483",
                    "discussion_type": null,
                    "num_comments": 15,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/wedding/comments/1edi61q/honeymoon_ideas_are_there_inclusive_trips_that/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/wedding/comments/1edi61q/honeymoon_ideas_are_there_inclusive_trips_that/",
                    "subreddit_subscribers": 171125,
                    "created_utc": 1722091965.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "wedding",
                    "selftext": "We are one month out and i am stressed.   \nHow do you deal with decision fatigue? we are both people pleasers and trying to focus on what we want/need. \n\nJust want the wedding over with and to go on our honeymoon. ",
                    "author_fullname": "t2_2caay845",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Stressssssssed",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/wedding",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "discussion",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1femrk7",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.87,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 6,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Discussion",
                    "can_mod_post": false,
                    "score": 6,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1726092931.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.wedding",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We are one month out and i am stressed.&lt;br/&gt;\nHow do you deal with decision fatigue? we are both people pleasers and trying to focus on what we want/need. &lt;/p&gt;\n\n&lt;p&gt;Just want the wedding over with and to go on our honeymoon. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qhtr",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "1femrk7",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ehawwky",
                    "discussion_type": null,
                    "num_comments": 3,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/wedding/comments/1femrk7/stressssssssed/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/wedding/comments/1femrk7/stressssssssed/",
                    "subreddit_subscribers": 171125,
                    "created_utc": 1726092931.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "wedding",
                    "selftext": "So my fiancée and I are having an Indian wedding so expect colours! But I'm not Indian so in a way I want to make the colours complimentary. At the moment we've finalised our outfit, I'll be wearing dusty pink with darker pink and gold embroidery, and he'll be wearing a royal blue with gold embroidery.\n\nWe've decided to have an all white with greeneries deco with cream walkway. The venue has royal blue and gold line carpet all through out. \n\nQuestion is what colour should I based my bridal bouquet on? I'm thinking to have a mixture of those 3 colours but 1. I think blue flowers look a bit weird and 2. I think that's an odd combo of colours. If it helps, I may be able to tweak the decor as we have a little bit of time but nothing too drastic I think.\n\nI'm having major decision fatigue that I don't know what looks good anymore\n\nTLDR: what colour of bridal bouquet if I'm wearing pink, fiancèe wearing royal blue and decor is white with greeneries.",
                    "author_fullname": "t2_hbta3fm4",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Colours help! for bridal bouquet and maybe decor",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/wedding",
                    "hidden": false,
                    "pwls": 6,
                    "link_flair_css_class": "discussion",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_tgr6za",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "Discussion",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1647571117.0,
                    "link_flair_type": "text",
                    "wls": 6,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.wedding",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my fiancée and I are having an Indian wedding so expect colours! But I&amp;#39;m not Indian so in a way I want to make the colours complimentary. At the moment we&amp;#39;ve finalised our outfit, I&amp;#39;ll be wearing dusty pink with darker pink and gold embroidery, and he&amp;#39;ll be wearing a royal blue with gold embroidery.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve decided to have an all white with greeneries deco with cream walkway. The venue has royal blue and gold line carpet all through out. &lt;/p&gt;\n\n&lt;p&gt;Question is what colour should I based my bridal bouquet on? I&amp;#39;m thinking to have a mixture of those 3 colours but 1. I think blue flowers look a bit weird and 2. I think that&amp;#39;s an odd combo of colours. If it helps, I may be able to tweak the decor as we have a little bit of time but nothing too drastic I think.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m having major decision fatigue that I don&amp;#39;t know what looks good anymore&lt;/p&gt;\n\n&lt;p&gt;TLDR: what colour of bridal bouquet if I&amp;#39;m wearing pink, fiancèe wearing royal blue and decor is white with greeneries.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "link_flair_template_id": "b6683000-16b4-11e4-a47a-12313b0d3999",
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_2qhtr",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "tgr6za",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "CarrotThyme",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": "all_ads",
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/wedding/comments/tgr6za/colours_help_for_bridal_bouquet_and_maybe_decor/",
                    "parent_whitelist_status": "all_ads",
                    "stickied": false,
                    "url": "https://www.reddit.com/r/wedding/comments/tgr6za/colours_help_for_bridal_bouquet_and_maybe_decor/",
                    "subreddit_subscribers": 171125,
                    "created_utc": 1647571117.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}