{
    "kind": "Listing",
    "data": {
        "modhash": "",
        "dist": 2,
        "facets": {},
        "after": null,
        "geo_filter": "",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "WeightLossAdvice",
                    "selftext": "My biggest problem is late-night eating. I strongly suspect that a big cause of my inability to stay away from the frig before going to bed is what is known as [\"decision fatigue\"](https://www.ama-assn.org/delivering-care/public-health/what-doctors-wish-patients-knew-about-decision-fatigue#:~:text=Decision%20fatigue%20is%20%E2%80%9Cthe%20idea,more%20difficult%20it%20can%20become.%E2%80%9D). That is, by 10PM, I've made 250 good eating choices, and I finally just give up and 'reward' myself for all those good decisions.\n\nDoes anyone have a trick, hack, or way to counteract decision fatigue?  \n",
                    "author_fullname": "t2_anga9",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "How to deal with 'decision fatigue' (just getting tired of telling yourself 'no')?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/WeightLossAdvice",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_1b4uql4",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.33,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 0,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 0,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1709403378.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.WeightLossAdvice",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My biggest problem is late-night eating. I strongly suspect that a big cause of my inability to stay away from the frig before going to bed is what is known as &lt;a href=\"https://www.ama-assn.org/delivering-care/public-health/what-doctors-wish-patients-knew-about-decision-fatigue#:%7E:text=Decision%20fatigue%20is%20%E2%80%9Cthe%20idea,more%20difficult%20it%20can%20become.%E2%80%9D\"&gt;&amp;quot;decision fatigue&amp;quot;&lt;/a&gt;. That is, by 10PM, I&amp;#39;ve made 250 good eating choices, and I finally just give up and &amp;#39;reward&amp;#39; myself for all those good decisions.&lt;/p&gt;\n\n&lt;p&gt;Does anyone have a trick, hack, or way to counteract decision fatigue?  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_31a4o",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "1b4uql4",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Prairiefyre",
                    "discussion_type": null,
                    "num_comments": 5,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/WeightLossAdvice/comments/1b4uql4/how_to_deal_with_decision_fatigue_just_getting/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/WeightLossAdvice/comments/1b4uql4/how_to_deal_with_decision_fatigue_just_getting/",
                    "subreddit_subscribers": 446576,
                    "created_utc": 1709403378.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "WeightLossAdvice",
                    "selftext": "I've been planning to do this post for a while, to share my thoughts and my story with you guys, but I figured it was too early in my process to share. However another post just touched on sort of the same topic, so I'm using my reply to that thread as the basis for my own post. \n\nThere is mounting evidence that long term, substantial weight loss is statistically very difficult to achieve. I think this is mostly true for people who have been overweight for a long time. The studies  are in the exact number, but the general consensus is that between 65 and 80% of people have regained any weight lost after 2 years, and even more after 5 years. Some data suggests that after 5 years, weight maintenance becomes easier, but very few studies actually run for that long, so the data pool is small. \n\n\nBut, the many studies now also show that BMI alone doesn't have the same predictive factor in terms of disease and death as was once thought. There are other lifestyle factors that can negate a high BMI, such as not drinking or smoking, getting enough exercise, not eating overly processed foods. \n\nPersonally, I've been varying degrees of overweight my entire life. My mum took me to Weight Watchers when I was 13 and that was the beginning of a long and difficult road of shame, body dysmorphia and emotional eating.  I've spent so much time learning about nutrition and health. My weight is not a question of needing to be educated about healthy food. I'm a very driven and ambitious person, and in every other aspect of my life I always reach my goals. My weight is not a question of lacking self-discipline. \nThe hardest thing for me about being overweight has not been the physical looks side of things, but the general consensus that fat people are almost by definition lazy, spineless creatures who should just....you know, stop eating. \n\nI was heavily inspired by the book \"Atomic Habits\" which talks about identity based habits, and setting goals that you can achieve every single day, as opposed to some future set goal that you may or may not reach for months or years. \nI also did a challenge this summer to wear the same dress for 100 days, and it was really eye opening in terms of the amount of decision fatigue we experience and also how long it actually takes to settle into new routines. \n\nI'm 34 years old, currently 114 kgs but healthy. I have no chronic illnesses, no aches and pains, I'm not limited by my weight in my daily life. I would like to keep it that way. I want to be healthy, and live a long, active life with my kids. Would I also like to be able to wear size 40 (EU) clothes? Sure. But I've worked enough with my own mindset, that I like how I look now as well. I make an effort, I look nice. The rest is what it is, you know. \nBut I'm a nurse, and I'm around old and sick people all the time. I know that 114 kg on a 60 or 70 year old is massively different, and I know I wouldn't be able to buy a private life insurance at my current weight. \nI'm planning to have a third child within the next few years, and would like to go through my last pregnancy and childbirth as healthy as possible.\n\nBased on all these various studies and my own experience of yo-yo-ing, I've shifted my focus from my weight to my health. My goal isn't to lose x amount of weight or reach x goal weight. My goal is to incorporate healthy, informed habits into my life in a way that lets me maintain them, even when I am tired, overwhelmed, busy with life. \n\nSo I've devised a sort of tailor made cognitive behaviour program, spanning two years to fix my relationship with food. Every three months I implement a new habit or guideline, making it 8 habits in total. The slow pace allows me to take the time to approach each new habit from multiple different perspectives and get a good handle on it, before moving on to the next new thing. My aim is that this method means I won't backslide during periods of low energy. I had decided on the first four habits before I started, in September 2022. Knowing what the next step is, has turned out to also be extremely beneficial for me. I'm a thinker, and I need time to think about everything and really mull things over. Know months in advance what the next habit will be, and putting it into perspective with the already implemented habits is very helpful. \n\nMy first habit to implement was to eat three meals a day; breakfast, lunch and dinner. The big takeaway for me here was to shift food from a desire driven activity to a rationality driven activity. \nMy second habit to implement was to incorporate fruit or vegetables as a major part of every meal. Not necessarily gourmet cooking every time, could just be some raw carrots and an apple with my lunch. But it had to be there. This made me think about nutrition without restricting anything. It also reinforced that food should mainly be about getting the necessary nutrients to thrive. \nMy third habit, the one I'm currently doing is to not eat anything after dinner. It's been a process so far, but I think I've found out what helps me the most, and that is getting enough calories and enough protein in during the day to prevent cravings at night. I've started drinking a protein shake in the mornings and I now have a healthy and filling snack prepared in advance for when I get off work in the afternoon. \nMy next habit will be to only eat one junky thing each day. So like, sure I can eat crisps or chocolate for lunch at work, but then I can't eat cake in the evening at home. Or teaching myself to plan ahead and think \"if I want to have that cake tonight, I will have to say no to the chocolate now\". \nMy fifth habit will be a bit different, as it will be tracking my calories for a month. Not with any intention of restricting, but just as a data collection thing. \nAfter that, I have three more habits to implement, but I don't know what they will be yet. At least one of them will be something about physical activity, but I need to figure out what exactly. \n\nIt's important for me that all my habits are quite general, flexible things that allow me to live a normal daily life, where some days I have a lot of time and energy and others I have none. I have kids, I' m a single parent, I work as a nurse which is hectic at the best of times. I'm going back to uni in the summer. My days aren't predictable and I need a system that allows for that. \n\nThe habits I've chosen are super basic, common sense things that are probably no brainers for people who have always had a healthy relationship with food.  But for me, being able to actually live by these habits effortlessly and consistently will be life changing. \n\nI weighed myself when I started, and I'll weigh myself at the 1 year mark and then again when I finish. Maybe I've lost weight, maybe I haven't, but regardless of the number on the scale, I'll be a healthy person. \n\nAn important last note, is that this approach completely sidesteps all the guilt, shame and general bullshit about how bodies are supposed to look and how we're supposed to feel about it. Being able to work on my relationship with food, without also mixing in my relationship with my looks has been such a relief.\n\nThanks for coming to my TED talk.",
                    "author_fullname": "t2_43a6fcbv",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "An alternative approach to weight loss and health",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/WeightLossAdvice",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_12ht5m5",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.87,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 11,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 11,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1681154716.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.WeightLossAdvice",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been planning to do this post for a while, to share my thoughts and my story with you guys, but I figured it was too early in my process to share. However another post just touched on sort of the same topic, so I&amp;#39;m using my reply to that thread as the basis for my own post. &lt;/p&gt;\n\n&lt;p&gt;There is mounting evidence that long term, substantial weight loss is statistically very difficult to achieve. I think this is mostly true for people who have been overweight for a long time. The studies  are in the exact number, but the general consensus is that between 65 and 80% of people have regained any weight lost after 2 years, and even more after 5 years. Some data suggests that after 5 years, weight maintenance becomes easier, but very few studies actually run for that long, so the data pool is small. &lt;/p&gt;\n\n&lt;p&gt;But, the many studies now also show that BMI alone doesn&amp;#39;t have the same predictive factor in terms of disease and death as was once thought. There are other lifestyle factors that can negate a high BMI, such as not drinking or smoking, getting enough exercise, not eating overly processed foods. &lt;/p&gt;\n\n&lt;p&gt;Personally, I&amp;#39;ve been varying degrees of overweight my entire life. My mum took me to Weight Watchers when I was 13 and that was the beginning of a long and difficult road of shame, body dysmorphia and emotional eating.  I&amp;#39;ve spent so much time learning about nutrition and health. My weight is not a question of needing to be educated about healthy food. I&amp;#39;m a very driven and ambitious person, and in every other aspect of my life I always reach my goals. My weight is not a question of lacking self-discipline. \nThe hardest thing for me about being overweight has not been the physical looks side of things, but the general consensus that fat people are almost by definition lazy, spineless creatures who should just....you know, stop eating. &lt;/p&gt;\n\n&lt;p&gt;I was heavily inspired by the book &amp;quot;Atomic Habits&amp;quot; which talks about identity based habits, and setting goals that you can achieve every single day, as opposed to some future set goal that you may or may not reach for months or years. \nI also did a challenge this summer to wear the same dress for 100 days, and it was really eye opening in terms of the amount of decision fatigue we experience and also how long it actually takes to settle into new routines. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 34 years old, currently 114 kgs but healthy. I have no chronic illnesses, no aches and pains, I&amp;#39;m not limited by my weight in my daily life. I would like to keep it that way. I want to be healthy, and live a long, active life with my kids. Would I also like to be able to wear size 40 (EU) clothes? Sure. But I&amp;#39;ve worked enough with my own mindset, that I like how I look now as well. I make an effort, I look nice. The rest is what it is, you know. \nBut I&amp;#39;m a nurse, and I&amp;#39;m around old and sick people all the time. I know that 114 kg on a 60 or 70 year old is massively different, and I know I wouldn&amp;#39;t be able to buy a private life insurance at my current weight. \nI&amp;#39;m planning to have a third child within the next few years, and would like to go through my last pregnancy and childbirth as healthy as possible.&lt;/p&gt;\n\n&lt;p&gt;Based on all these various studies and my own experience of yo-yo-ing, I&amp;#39;ve shifted my focus from my weight to my health. My goal isn&amp;#39;t to lose x amount of weight or reach x goal weight. My goal is to incorporate healthy, informed habits into my life in a way that lets me maintain them, even when I am tired, overwhelmed, busy with life. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ve devised a sort of tailor made cognitive behaviour program, spanning two years to fix my relationship with food. Every three months I implement a new habit or guideline, making it 8 habits in total. The slow pace allows me to take the time to approach each new habit from multiple different perspectives and get a good handle on it, before moving on to the next new thing. My aim is that this method means I won&amp;#39;t backslide during periods of low energy. I had decided on the first four habits before I started, in September 2022. Knowing what the next step is, has turned out to also be extremely beneficial for me. I&amp;#39;m a thinker, and I need time to think about everything and really mull things over. Know months in advance what the next habit will be, and putting it into perspective with the already implemented habits is very helpful. &lt;/p&gt;\n\n&lt;p&gt;My first habit to implement was to eat three meals a day; breakfast, lunch and dinner. The big takeaway for me here was to shift food from a desire driven activity to a rationality driven activity. \nMy second habit to implement was to incorporate fruit or vegetables as a major part of every meal. Not necessarily gourmet cooking every time, could just be some raw carrots and an apple with my lunch. But it had to be there. This made me think about nutrition without restricting anything. It also reinforced that food should mainly be about getting the necessary nutrients to thrive. \nMy third habit, the one I&amp;#39;m currently doing is to not eat anything after dinner. It&amp;#39;s been a process so far, but I think I&amp;#39;ve found out what helps me the most, and that is getting enough calories and enough protein in during the day to prevent cravings at night. I&amp;#39;ve started drinking a protein shake in the mornings and I now have a healthy and filling snack prepared in advance for when I get off work in the afternoon. \nMy next habit will be to only eat one junky thing each day. So like, sure I can eat crisps or chocolate for lunch at work, but then I can&amp;#39;t eat cake in the evening at home. Or teaching myself to plan ahead and think &amp;quot;if I want to have that cake tonight, I will have to say no to the chocolate now&amp;quot;. \nMy fifth habit will be a bit different, as it will be tracking my calories for a month. Not with any intention of restricting, but just as a data collection thing. \nAfter that, I have three more habits to implement, but I don&amp;#39;t know what they will be yet. At least one of them will be something about physical activity, but I need to figure out what exactly. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important for me that all my habits are quite general, flexible things that allow me to live a normal daily life, where some days I have a lot of time and energy and others I have none. I have kids, I&amp;#39; m a single parent, I work as a nurse which is hectic at the best of times. I&amp;#39;m going back to uni in the summer. My days aren&amp;#39;t predictable and I need a system that allows for that. &lt;/p&gt;\n\n&lt;p&gt;The habits I&amp;#39;ve chosen are super basic, common sense things that are probably no brainers for people who have always had a healthy relationship with food.  But for me, being able to actually live by these habits effortlessly and consistently will be life changing. &lt;/p&gt;\n\n&lt;p&gt;I weighed myself when I started, and I&amp;#39;ll weigh myself at the 1 year mark and then again when I finish. Maybe I&amp;#39;ve lost weight, maybe I haven&amp;#39;t, but regardless of the number on the scale, I&amp;#39;ll be a healthy person. &lt;/p&gt;\n\n&lt;p&gt;An important last note, is that this approach completely sidesteps all the guilt, shame and general bullshit about how bodies are supposed to look and how we&amp;#39;re supposed to feel about it. Being able to work on my relationship with food, without also mixing in my relationship with my looks has been such a relief.&lt;/p&gt;\n\n&lt;p&gt;Thanks for coming to my TED talk.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": true,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_31a4o",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "12ht5m5",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "marlyn_does_reddit",
                    "discussion_type": null,
                    "num_comments": 3,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/WeightLossAdvice/comments/12ht5m5/an_alternative_approach_to_weight_loss_and_health/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.reddit.com/r/WeightLossAdvice/comments/12ht5m5/an_alternative_approach_to_weight_loss_and_health/",
                    "subreddit_subscribers": 446576,
                    "created_utc": 1681154716.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": null
    }
}